#----
# Огонь прямой наводкой (распределение по времени суток):

metadict_detail['-Вероятность поражения цели пулей (боец)'] = {
        '-Стрельба днём по цели (боец)':0.9,
        '-Стрельба ночью по цели (боец)':0.1,
        }

metadict_detail['-Вероятность поражения цели снарядом (танк)'] = {
        '-Стрельба днём по цели (танк)':0.9,
        '-Стрельба ночью по цели (танк)':0.1,
        }

metadict_detail['-Вероятность поражения цели снарядом (ББМ)'] = {
        '-Стрельба днём по цели (ББМ)':0.9,
        '-Стрельба ночью по цели (ББМ)':0.1,
        }

metadict_detail['-Вероятность поражения цели снарядом (пегас)'] = {
        '-Стрельба днём по цели (пегас)':0.7,
        '-Стрельба ночью по цели (пегас)':0.3,
        }

metadict_detail['-Вероятность поражения цели ракетой (самолёт)'] = {
        '-Стрельба днём по цели (самолёт)':0.9,
        '-Стрельба ночью по цели (самолёт)':0.1,
        }

metadict_detail['-Вероятность поражения цели ракетой (планёр)'] = {
        '-Стрельба днём по цели (планёр)':0.7,
        '-Стрельба ночью по цели (планёр)':0.3,
        }

#----
# Огонь прямой наводкой (распределение по типам боевых действий):

metadict_detail['-Стрельба днём по цели (боец)'] = {
        '-Стрельба днём по цели (боец) (встречный бой)':0.2,
        '-Стрельба днём по цели (боец) (наступление)':0.4,
        '-Стрельба днём по цели (боец) (оборона)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (боец)'] = {
        '-Стрельба ночью по цели (боец) (встречный бой)':0.2,
        '-Стрельба ночью по цели (боец) (наступление)':0.4,
        '-Стрельба ночью по цели (боец) (оборона)':0.4,
        }

metadict_detail['-Стрельба днём по цели (танк)'] = {
        '-Стрельба днём по цели (танк) (встречный бой)':0.2,
        '-Стрельба днём по цели (танк) (наступление)':0.4,
        '-Стрельба днём по цели (танк) (оборона)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (танк)'] = {
        '-Стрельба ночью по цели (танк) (встречный бой)':0.2,
        '-Стрельба ночью по цели (танк) (наступление)':0.4,
        '-Стрельба ночью по цели (танк) (оборона)':0.4,
        }

metadict_detail['-Стрельба днём по цели (ББМ)'] = {
        '-Стрельба днём по цели (ББМ) (встречный бой)':0.2,
        '-Стрельба днём по цели (ББМ) (наступление)':0.4,
        '-Стрельба днём по цели (ББМ) (оборона)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (ББМ)'] = {
        '-Стрельба ночью по цели (ББМ) (встречный бой)':0.2,
        '-Стрельба ночью по цели (ББМ) (наступление)':0.4,
        '-Стрельба ночью по цели (ББМ) (оборона)':0.4,
        }

metadict_detail['-Стрельба днём по цели (пегас)'] = {
        '-Стрельба днём по цели (пегас) (встречный бой)':0.2,
        '-Стрельба днём по цели (пегас) (наступление)':0.4,
        '-Стрельба днём по цели (пегас) (оборона)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (пегас)'] = {
        '-Стрельба ночью по цели (пегас) (встречный бой)':0.2,
        '-Стрельба ночью по цели (пегас) (наступление)':0.4,
        '-Стрельба ночью по цели (пегас) (оборона)':0.4,
        }

metadict_detail['-Стрельба днём по цели (самолёт)'] = {
        '-Стрельба днём по цели (самолёт) (наступление)':0.2,
        '-Стрельба днём по цели (самолёт) (оборона)':0.4,
        '-Стрельба днём по цели (самолёт) (марш)':0.4,
        }

metadict_detail['-Стрельба днём по цели (планёр)'] = {
        '-Стрельба днём по цели (планёр) (наступление)':0.2,
        '-Стрельба днём по цели (планёр) (оборона)':0.4,
        '-Стрельба днём по цели (планёр) (марш)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (самолёт)'] = {
        '-Стрельба ночью по цели (самолёт) (наступление)':0.2,
        '-Стрельба ночью по цели (самолёт) (оборона)':0.4,
        '-Стрельба ночью по цели (самолёт) (марш)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (планёр)'] = {
        '-Стрельба ночью по цели (планёр) (наступление)':0.2,
        '-Стрельба ночью по цели (планёр) (оборона)':0.4,
        '-Стрельба ночью по цели (планёр) (марш)':0.4,
        }


#----
# Огонь прямой наводкой (ввод коэффициентов условной обстановки):

metadict_detail['-Стрельба днём по цели (ББМ) (встречный бой)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.4,
        }

metadict_detail['-Стрельба днём по цели (ББМ) (наступление)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (ББМ) (оборона)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.6,
        }

metadict_detail['-Стрельба днём по цели (боец) (встречный бой)'] = {
        '-Стрельба по цели (боец)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (боец) (наступление)'] = {
        '-Стрельба по цели (боец)':1 * 0.1,
        }

metadict_detail['-Стрельба днём по цели (боец) (оборона)'] = {
        '-Стрельба по цели (боец)':1 * 0.3,
        }

metadict_detail['-Стрельба днём по цели (пегас) (встречный бой)'] = {
        '-Стрельба по цели (пегас)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (пегас) (наступление)'] = {
        '-Стрельба по цели (пегас)':1 * 0.1,
        }

metadict_detail['-Стрельба днём по цели (пегас) (оборона)'] = {
        '-Стрельба по цели (пегас)':1 * 0.3,
        }

metadict_detail['-Стрельба днём по цели (самолёт) (марш)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.1,
        }

metadict_detail['-Стрельба днём по цели (самолёт) (наступление)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.3,
        }

metadict_detail['-Стрельба днём по цели (самолёт) (оборона)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (планёр) (марш)'] = {
        '-Стрельба по цели (планёр)':1 * 0.1,
        }

metadict_detail['-Стрельба днём по цели (планёр) (наступление)'] = {
        '-Стрельба по цели (планёр)':1 * 0.3,
        }

metadict_detail['-Стрельба днём по цели (планёр) (оборона)'] = {
        '-Стрельба по цели (планёр)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (танк) (встречный бой)'] = {
        '-Стрельба по цели (танк)':1 * 0.4,
        }

metadict_detail['-Стрельба днём по цели (танк) (наступление)'] = {
        '-Стрельба по цели (танк)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (танк) (оборона)'] = {
        '-Стрельба по цели (танк)':1 * 0.6,
        }

metadict_detail['-Стрельба ночью по цели (ББМ) (встречный бой)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.2,
        }

metadict_detail['-Стрельба ночью по цели (ББМ) (наступление)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (ББМ) (оборона)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.3,
        }

metadict_detail['-Стрельба ночью по цели (боец) (встречный бой)'] = {
        '-Стрельба по цели (боец)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (боец) (наступление)'] = {
        '-Стрельба по цели (боец)':1 * 0.05,
        }

metadict_detail['-Стрельба ночью по цели (боец) (оборона)'] = {
        '-Стрельба по цели (боец)':1 * 0.15,
        }

metadict_detail['-Стрельба ночью по цели (пегас) (встречный бой)'] = {
        '-Стрельба по цели (пегас)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (пегас) (наступление)'] = {
        '-Стрельба по цели (пегас)':1 * 0.05,
        }

metadict_detail['-Стрельба ночью по цели (пегас) (оборона)'] = {
        '-Стрельба по цели (пегас)':1 * 0.15,
        }

metadict_detail['-Стрельба ночью по цели (самолёт) (марш)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.05,
        }

metadict_detail['-Стрельба ночью по цели (самолёт) (наступление)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.15,
        }

metadict_detail['-Стрельба ночью по цели (самолёт) (оборона)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (планёр) (марш)'] = {
        '-Стрельба по цели (планёр)':1 * 0.05,
        }

metadict_detail['-Стрельба ночью по цели (планёр) (наступление)'] = {
        '-Стрельба по цели (планёр)':1 * 0.15,
        }

metadict_detail['-Стрельба ночью по цели (планёр) (оборона)'] = {
        '-Стрельба по цели (планёр)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (танк) (встречный бой)'] = {
        '-Стрельба по цели (танк)':1 * 0.2,
        }

metadict_detail['-Стрельба ночью по цели (танк) (наступление)'] = {
        '-Стрельба по цели (танк)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (танк) (оборона)'] = {
        '-Стрельба по цели (танк)':1 * 0.3,
        }

#----
# Огонь прямой наводкой (распределение огня в бою):

metadict_detail['-Стрельба по цели (ББМ)'] = {
        '-Прямой подавляющий огонь':0.7,
        '-Прямой огонь по бронетехнике':0.2,
        '-Прямой огонь по пехоте':0.1 * 3,
        }

metadict_detail['-Стрельба по цели (боец)'] = {
        '-Прямой подавляющий огонь':0.95,
        '-Прямой огонь по пехоте':0.05,
        }

metadict_detail['-Стрельба по цели (танк)'] = {
        '-Прямой огонь по танкам':0.7,
        '-Прямой огонь по бронетехнике':0.3 * 3,
        }

metadict_detail['-Стрельба по цели (пегас)'] = {
        '-Зенитный огонь по пегасам':1,
        }

metadict_detail['-Стрельба по цели (самолёт)'] = {
        '-Ракетный огонь по самолётам':1,
        }

metadict_detail['-Стрельба по цели (планёр)'] = {
        '-Ракетный огонь по планёрам':1,
        }

#----
# Навесной огонь (ввод коэффициентов построения):
# http://armor.kiev.ua/wiki/index.php?title=Теория_вероятностей_в_артиллерии._Часть_1._Разрушение_одиночной_ДЗОТ

metadict_detail['-Радиус поражения пехоты осколками (метров)'] = {
        # Радиус поражения, это 20% вероятность попадания осколка в цель 1.08 кв.метра:
        # http://saper.isnet.ru/mines-2/razlet-osk.html
        # Расстояние между бойцам в стрелковой цепи -- 8 метров.
        '-Вероятность поражения цели осколками (боец)':1/8,
        }

metadict_detail['-Радиус поражения бронетехники осколками (метров)'] = {
        # "О роли артиллерии в борьбе с бронецелями" Виктор Мураховский:
        # http://otvaga2004.ru/kaleydoskop/kaleydoskop-art/artillerii-v-borbe-s-br/
        # Расстояние между танками в боевом строю -- 100 метров.
        '-Вероятность поражения цели осколками (танк)':1/100,
        }

#----
# Навесной огонь (распределение по времени суток):

metadict_detail['-Вероятность поражения цели осколками (боец)'] = {
        '-Навесной огонь днём по цели (боец)':0.9,
        '-Навесной огонь ночью по цели (боец)':0.1,
        }

metadict_detail['-Вероятность поражения цели авиабомбой (боец)'] = {
        '-Навесной огонь днём по цели (боец)':0.9,
        '-Навесной огонь ночью по цели (боец)':0.1,
        }

metadict_detail['-Вероятность поражения цели осколками (танк)'] = {
        '-Навесной огонь днём по цели (танк)':0.9,
        '-Навесной огонь ночью по цели (танк)':0.1,
        }

metadict_detail['-Вероятность поражения цели авиабомбой (танк)'] = {
        '-Навесной огонь днём по цели (танк)':0.9,
        '-Навесной огонь ночью по цели (танк)':0.1,
        }

#----
# Огонь прямой наводкой (распределение по типам боевых действий):

metadict_detail['-Навесной огонь днём по цели (боец)'] = {
        '-Навесной огонь днём по цели (боец) (встречный бой)':0.2,
        '-Навесной огонь днём по цели (боец) (наступление)':0.4,
        '-Навесной огонь днём по цели (боец) (оборона)':0.4,
        }

metadict_detail['-Навесной огонь ночью по цели (боец)'] = {
        '-Навесной огонь ночью по цели (боец) (встречный бой)':0.2,
        '-Навесной огонь ночью по цели (боец) (наступление)':0.4,
        '-Навесной огонь ночью по цели (боец) (оборона)':0.4,
        }

metadict_detail['-Навесной огонь днём по цели (танк)'] = {
        '-Навесной огонь днём по цели (танк) (встречный бой)':0.2,
        '-Навесной огонь днём по цели (танк) (наступление)':0.4,
        '-Навесной огонь днём по цели (танк) (оборона)':0.4,
        }

metadict_detail['-Навесной огонь ночью по цели (танк)'] = {
        '-Навесной огонь ночью по цели (танк) (встречный бой)':0.2,
        '-Навесной огонь ночью по цели (танк) (наступление)':0.4,
        '-Навесной огонь ночью по цели (танк) (оборона)':0.4,
        }

#----
# Навесной огонь (ввод коэффициентов условной обстановки):

metadict_detail['-Навесной огонь днём по цели (боец) (встречный бой)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.2,
        }

metadict_detail['-Навесной огонь днём по цели (боец) (наступление)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.1,
        }

metadict_detail['-Навесной огонь днём по цели (боец) (оборона)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.3,
        }

metadict_detail['-Навесной огонь днём по цели (танк) (встречный бой)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.4,
        }

metadict_detail['-Навесной огонь днём по цели (танк) (наступление)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.2,
        }

metadict_detail['-Навесной огонь днём по цели (танк) (оборона)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.6,
        }

metadict_detail['-Навесной огонь ночью по цели (боец) (встречный бой)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.1,
        }

metadict_detail['-Навесной огонь ночью по цели (боец) (наступление)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.05,
        }

metadict_detail['-Навесной огонь ночью по цели (боец) (оборона)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.15,
        }

metadict_detail['-Навесной огонь ночью по цели (танк) (встречный бой)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.2,
        }

metadict_detail['-Навесной огонь ночью по цели (танк) (наступление)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.1,
        }

metadict_detail['-Навесной огонь ночью по цели (танк) (оборона)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.3,
        }

#----
# Навесной огонь (распределение огня в бою):

metadict_detail['-Навесной огонь по цели (танк)'] = {
        '-Навесной подавляющий огонь':0.7,
        '-Навесной огонь по бронетехнике':0.2,
        '-Навесной огонь по танкам':0.1,
        }

metadict_detail['-Навесной огонь по цели (боец)'] = {
        '-Навесной подавляющий огонь':0.9,
        '-Навесной огонь по пехоте':0.1,
        }

#----
# Артиллерия (распределение огня в бою)

metadict_detail['-Расчётный боеприпас (РБ)'] = {
        '--Боекомплект (РБ)':1,
        '-Боеприпасы (РБ) (стрельба)':1,
        }

metadict_detail['-Расчётный боеприпас (ядерный) (РБ)'] = {
        '--Боекомплект (РБ ядерный)':1,
        '-Боеприпасы (РБ) (стрельба)':1,
        }

metadict_detail['-Боеприпасы (РБ) (стрельба)'] = {
        # Исправить
            # Лишь 20% вероятных позиций противника являются истинными.
            # Лишь 10% огня артиллерии совпадает по времени (с АСУ "Манёвр" 40%).
            # Армейские/фронтовые РУК гораздо эффективнее?
                # Они стреляют чаще всего по колоннам на марше.
        '-Боеприпасы (РБ) (накрытие)':0.2 * 0.4,
        #'-Боеприпасы (РБ) (накрытие)':1,
        }

metadict_detail['-Боеприпасы (РБ) (накрытие)'] = {
        # Исправить
        # Уточнить.
        # Распределение целей в работе артиллерийского дивизиона:
        '-Огонь артиллерии по противнику в боевом порядке (РБ)':0.2,
        '-Огонь артиллерии по противнику на подготовленных позициях (РБ)':0.6,
        '-Огонь артиллерии по противнику на марше (РБ)':0.2,
        }

metadict_detail['-Огонь артиллерии по противнику в боевом порядке (РБ)'] = {
        '-Огонь артиллерии по взводу мотострелков в боевом порядке (РБ)':0.4,
        '-Огонь артиллерии по взводу танков в боевом порядке (РБ)':0.6,
        }

metadict_detail['-Огонь артиллерии по противнику на подготовленных позициях (РБ)'] = {
        '-Огонь артиллерии по огневому взводу на подготовленных позициях (РБ)':0.1,
        '-Огонь артиллерии по взводу обеспечения на подготовленных позициях (РБ)':0.2,
        '-Огонь артиллерии по взводу мотострелков на подготовленных позициях (РБ)':0.4,
        '-Огонь артиллерии по взводу танков на подготовленных позициях (РБ)':0.3,
        }

metadict_detail['-Огонь артиллерии по противнику на марше (РБ)'] = {
        '-Огонь артиллерии по батарее САУ на марше (РБ)':0.2,
        '-Огонь артиллерии по роте обеспечения на марше (РБ)':0.4,
        '-Огонь артиллерии по роте мотострелков на марше (РБ)':0.2,
        '-Огонь артиллерии по роте танков на марше (РБ)':0.2,
        }

#----
# Артиллерия (нормы огня на подавление):

metadict_detail['-Огонь артиллерии по батарее САУ на марше (РБ)'] = {
        'Батарея САУ на марше (подавление)':1/330,
        }

metadict_detail['-Огонь артиллерии по взводу мотострелков в боевом порядке (РБ)'] = {
        'Мотострелковый взвод в боевом порядке (подавление)':1/1090,
        }

metadict_detail['-Огонь артиллерии по взводу мотострелков на подготовленных позициях (РБ)'] = {
        'Мотострелковый взвод на подготовленных позициях (подавление)':1/690,
        }

metadict_detail['-Огонь артиллерии по взводу обеспечения на подготовленных позициях (РБ)'] = {
        'Взвод обеспечения на подготовленных позициях (подавление)':1/360,
        }

metadict_detail['-Огонь артиллерии по взводу танков в боевом порядке (РБ)'] = {
        'Взвод танков в боевом порядке (подавление)':1/1100,
        }

metadict_detail['-Огонь артиллерии по взводу танков на подготовленных позициях (РБ)'] = {
        'Взвод танков на подготовленных позициях (подавление)':1/690,
        }

metadict_detail['-Огонь артиллерии по огневому взводу на подготовленных позициях (РБ)'] = {
        'Огневой взвод на подготовленных позициях (подавление)':1/340,
        }

metadict_detail['-Огонь артиллерии по роте мотострелков на марше (РБ)'] = {
        'Мотострелковая рота на марше (подавление)':1/220,
        }

metadict_detail['-Огонь артиллерии по роте обеспечения на марше (РБ)'] = {
        'Рота обеспечения на марше (подавление)':1/220,
        }

metadict_detail['-Огонь артиллерии по роте танков на марше (РБ)'] = {
        'Танковая рота на марше (подавление)':1/660,
        }

#----
# Артиллерия (подавление, уничтожение целей):

metadict_detail['Батарея САУ на марше (подавление)'] = {
        # Подавление, это гибель или ранение 30% личного состава и повреждение техники.
        '-Артиллерийский огонь по бронетехнике':8 * 0.3,
        '-Артиллерийский огонь по пехоте':45 * 0.3,
        }

metadict_detail['Взвод обеспечения на подготовленных позициях (подавление)'] = {
        '-Артиллерийский огонь по пехоте':33 * 0.3,
        }

metadict_detail['Взвод танков в боевом порядке (подавление)'] = {
        '-Артиллерийский огонь по танкам':4 * 0.3,
        }

metadict_detail['Взвод танков на подготовленных позициях (подавление)'] = {
        '-Артиллерийский огонь по танкам':4 * 0.3,
        }

metadict_detail['Мотострелковая рота на марше (подавление)'] = {
        '-Артиллерийский огонь по пехоте':114 * 0.3,
        '-Артиллерийский огонь по бронетехнике':10 * 0.3,
        }

metadict_detail['Мотострелковый взвод в боевом порядке (подавление)'] = {
        '-Артиллерийский огонь по пехоте':35 * 0.3,
        '-Артиллерийский огонь по бронетехнике':3 * 0.3,
        }

metadict_detail['Мотострелковый взвод на подготовленных позициях (подавление)'] = {
        '-Артиллерийский огонь по пехоте':35 * 0.3,
        '-Артиллерийский огонь по бронетехнике':3 * 0.3,
        }

metadict_detail['Огневой взвод на подготовленных позициях (подавление)'] = {
        '-Артиллерийский огонь по пехоте':13 * 0.3,
        '-Артиллерийский огонь по бронетехнике':3 * 0.3,
        }

metadict_detail['Рота обеспечения на марше (подавление)'] = {
        '-Артиллерийский огонь по пехоте':114 * 0.3,
        }

metadict_detail['Танковая рота на марше (подавление)'] = {
        '-Артиллерийский огонь по пехоте':33 * 0.3,
        '-Артиллерийский огонь по танкам':10 * 0.3,
        }

#----
# Возможности боекомплекта:

metadict_detail['-Артиллерийский огонь по бронетехнике'] = {
        '-Боекомплект (артиллерией по бронетехнике)':1,
        }

metadict_detail['-Артиллерийский огонь по пехоте'] = {
        '-Боекомплект (артиллерией по пехоте)':1,
        }

metadict_detail['-Артиллерийский огонь по танкам'] = {
        '-Боекомплект (артиллерией по танкам)':1,
        }

metadict_detail['-Навесной огонь по бронетехнике'] = {
        '-Боекомплект (навесным огнём по бронетехнике)':1,
        }

metadict_detail['-Навесной огонь по пехоте'] = {
        '-Боекомплект (навесным огнём по пехоте)':1,
        }

metadict_detail['-Навесной огонь по танкам'] = {
        '-Боекомплект (навесным огнём по танкам)':1,
        }

metadict_detail['-Прямой огонь по бронетехнике'] = {
        '-Боекомплект (прямым огнём по бронетехнике)':1,
        }

metadict_detail['-Прямой огонь по пехоте'] = {
        '-Боекомплект (прямым огнём по пехоте)':1,
        }

metadict_detail['-Прямой огонь по танкам'] = {
        '-Боекомплект (прямым огнём по танкам)':1,
        }

metadict_detail['-Зенитный огонь по пегасам'] = {
        '-Боекомплект (зенитным огнём по пегасам)':1,
        }

metadict_detail['-Ракетный огонь по самолётам'] = {
        '-Боекомплект (ракетами по самолётам)':1,
        }

metadict_detail['-Ракетный огонь по планёрам'] = {
        '-Боекомплект (зенитным огнём по пегасам)':1,
        #'-Боекомплект (ракетами по планёрам)':1,
        }

#----
# Возможности боекомплекта (подавляющий огонь):

metadict_detail['-Прямой подавляющий огонь'] = {
        }

metadict_detail['-Навесной подавляющий огонь'] = {
        }

#----
# Возможности оружия:

metadict_detail['-Расчётное огневое средство (РОС)'] = {
        # Плотность артиллерии в наступлениях второй мировой -- 200 орудий/километр
        '--Фронт огневого вала (метров)':5,
        '--Артиллерия (РОС)':1,
        }

metadict_detail['-Заградительный огонь (метров фронта)'] = {
        # Осколки от взрывов снарядов приравниваются к огню стрелкового оружия:
        '--Полоса обороны в один эшелон (5 пуль/минуту на метр)':1,
        '--Полоса наступления в один эшелон (20 пуль/минуту на метр)':0.5,
        '--Фронт заградительного огня (метров)':1,
        }

metadict_detail['-Боевая скорострельность (выстрелов/минуту)'] = {
        '--Полоса обороны в один эшелон (5 пуль/минуту на метр)':0.2,
        '--Полоса наступления в один эшелон (20 пуль/минуту на метр)':0.05,
        }

metadict_detail['--Полоса обороны в один эшелон (5 пуль/минуту на метр)'] = {
        # С учётом 33% потерь от артиллерийского огня, либо такого же резерва в полку/дивизии.
        '--Фронт в обороне (5 пуль/минуту на метр)':0.66,
        }

metadict_detail['--Полоса наступления в один эшелон (20 пуль/минуту на метр)'] = {
        '--Фронт в наступлении (20 пуль/минуту на метр)':0.66,
        }

#----
# Масса, компиляция:

metadict_detail['-Допустимая масса боеприпасов (килограмм)'] = {
        '-Допустимая масса боеприпасов (тонн)':0.001,
        }

metadict_detail['-Допустимая масса вооружения (килограмм)'] = {
        '-Допустимая масса вооружения (тонн)':0.001,
        }

metadict_detail['-Допустимая масса экипировки (килограмм)'] = {
        '-Допустимая масса экипировки (тонн)':0.001,
        }

metadict_detail['-Допустимая масса оборудования (килограмм)'] = {
        '-Допустимая масса оборудования (тонн)':0.001,
        }

metadict_detail['-Допустимая масса боеприпасов (тонн)'] = {
        '--Боекомплект (тонн)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

metadict_detail['-Допустимая масса вооружения (тонн)'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

metadict_detail['-Допустимая масса экипировки (тонн)'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

#metadict_detail['-Допустимая масса техники (тонн)'] = {
#        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':1,
#        }

#metadict_detail['-Допустимая масса деталей (тонн)'] = {
#        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':1,
#        }

metadict_detail['-Допустимая масса оборудования (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

#----
# Стоимость, компиляция:

metadict_detail['-Допустимая стоимость боеприпасов ($)'] = {
        '---Стоимость боеприпасов (оценочно)':1,
        }

metadict_detail['-Допустимая стоимость вооружения ($)'] = {
        '---Стоимость вооружения (оценочно)':1,
        }

metadict_detail['-Допустимая стоимость оборудования ($)'] = {
        '---Стоимость вооружения (оценочно)':1,
        }

metadict_detail['-Допустимая стоимость техники ($)'] = {
        '---Стоимость вооружения (оценочно)':1,
        }

metadict_detail['-Допустимая стоимость экипировки ($)'] = {
        '---Стоимость вооружения (оценочно)':1,
        }

#----
# Грузоподъёмность, упрощение:

metadict_detail['-Место под боеприпасы (тонн)'] = {
        '--Боеприпасов (тонн)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

metadict_detail['-Место под зенитные ракеты (тонн)'] = {
        '--Боеприпасов (тонн)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

metadict_detail['-Место под взрывчатку и мины (тонн)'] = {
        '--Боеприпасов (тонн)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

metadict_detail['-Место под лёгкую технику (тонн)'] = {
        }

metadict_detail['-Место под тяжёлую технику (тонн)'] = {
        }

metadict_detail['-Место под жидкое топливо (литры)'] = {
        '-Место под жидкое топливо (кубометр)':0.001,
        }

metadict_detail['-Место под жидкое топливо (кубометр)'] = {
        '-Место под жидкое топливо (тонн)':0.85,
        }

metadict_detail['-Место под жидкое топливо (тонн)'] = {
        'Синтетическое топливо (тонн)':1,
        '-Потенциальная энергия биодизеля (МДж)':43000,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Потенциальная энергия биодизеля (МДж)'] = {
        # КПД дизельного двигателя 40%
        '-Энергия маховиков (МДж)':1 * 0.4,
        '-Условное топливо (килограмм)':1 / 29.3,
        }

metadict_detail['-Место под уголь (тонн)'] = {
        'Каменный уголь (тонн)':1,
        '-Потенциальная энергия угля (МДж)':29300,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Потенциальная энергия угля (МДж)'] = {
        # КПД газогенератора 70%, КПД дизельного двигателя 40%
        '-Энергия маховиков (МДж)':1 * 0.7 * 0.4,
        '-Условное топливо (килограмм)':1 / 29.3,
        }

metadict_detail['-Место под маховики (тонн)'] = {
        'Танковый маховик':2,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Место под продовольствие (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Место под воду (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Место под снаряжение (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Место под стройматериалы (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Строительные материалы (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

#----
# Вывод грузов в космос:

metadict_detail['-Полезная нагрузка (низкая опорная орбита) (тонн)'] = {
        'Ракета-носитель':0.05,
        }

metadict_detail['-Полезная нагрузка (геопереходная орбита) (тонн)'] = {
        'Ракета-носитель':0.2,
        }

metadict_detail['-Полезная нагрузка (геостационарная орбита) (тонн)'] = {
        'Ракета-носитель':0.3,
        }

#----
# Ремонтные работы, упрощение:

metadict_detail['_-Ремонт и обработка высокопрочных тканей (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обработка металлических изделий (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и сборка механизмов (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обслуживание ДВС (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обслуживание авиатехники (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обслуживание автотехники (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обслуживание маховиков (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обслуживание оптической электроники (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обслуживание радиотехники (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обслуживание тяжёлого оружия (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обслуживание электротехники (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обслуживание понтонного парка (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

metadict_detail['_-Ремонт и обслуживание лодок и катеров (часов/смену)'] = {
        '_-Ремонт и обслуживание машин/оружия (часов/смену)':1,
        }

#----
# Личный состав (стоимость жизни):

metadict_detail['Генерал'] = {
        # Стоимость жизни солдата, это не только страховка, но и потери для экономики государства:
        # https://ru.wikipedia.org/wiki/Стоимость_человеческой_жизни
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':10000000,
        }

metadict_detail['Генерал (единорог)'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':10000000,
        }

metadict_detail['Генерал (пегас)'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':10000000,
        }

metadict_detail['Полковник'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':8000000,
        }

metadict_detail['Полковник (единорог)'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':8000000,
        }

metadict_detail['Полковник (пегас)'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':8000000,
        }

metadict_detail['Майор'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':5000000,
        }

metadict_detail['Майор (единорог)'] = {
        '-Офицеры':1,
        '---Расовый состав (единороги)':1,
        '---Стоимость жизни (оценочно)':5000000,
        }

metadict_detail['Майор (пегас)'] = {
        '-Офицеры':1,
        '---Расовый состав (пегасы)':1,
        '---Стоимость жизни (оценочно)':5000000,
        }

metadict_detail['Капитан'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':3000000,
        }

metadict_detail['Капитан (единорог)'] = {
        '-Офицеры':1,
        '---Расовый состав (единороги)':1,
        '---Стоимость жизни (оценочно)':3000000,
        }

metadict_detail['Капитан (пегас)'] = {
        '-Офицеры':1,
        '---Расовый состав (пегасы)':1,
        '---Стоимость жизни (оценочно)':3000000,
        }

metadict_detail['Лейтенант'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':2000000,
        }

metadict_detail['Лейтенант (единорог)'] = {
        '-Офицеры':1,
        '---Расовый состав (единороги)':1,
        '---Стоимость жизни (оценочно)':2000000,
        }

metadict_detail['Лейтенант (пегас)'] = {
        '-Офицеры':1,
        '---Расовый состав (пегасы)':1,
        '---Стоимость жизни (оценочно)':2000000,
        }

metadict_detail['Сержант'] = {
        '-Контрактники':1,
        '---Стоимость жизни (оценочно)':1000000,
        }

metadict_detail['Сержант (единорог)'] = {
        '-Контрактники':1,
        '---Расовый состав (единороги)':1,
        '---Стоимость жизни (оценочно)':1000000,
        }

metadict_detail['Сержант (пегас)'] = {
        '-Контрактники':1,
        '---Расовый состав (пегасы)':1,
        '---Стоимость жизни (оценочно)':1000000,
        }

metadict_detail['Рядовой'] = {
        '-Срочники':1,
        '---Стоимость жизни (оценочно)':500000,
        }

metadict_detail['Рядовой (единорог)'] = {
        '-Срочники':1,
        '---Расовый состав (единороги)':1,
        '---Стоимость жизни (оценочно)':500000,
        }

metadict_detail['Рядовой (пегас)'] = {
        '-Срочники':1,
        '---Расовый состав (пегасы)':1,
        '---Стоимость жизни (оценочно)':500000,
        }

#----
# Личный состав (потребности, численность):

metadict_detail['-Офицеры'] = {
        # Исправить
            # Добавь здесь потребность в жилье.
        '---Личный состав (суммарно)':1,
        '---Личный состав (офицеры)':1,
        'Комплект повседневной экипировки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.07,
        '-Расход продовольствия (килограмм/сутки)':3,
        '-Расход питьевой воды (литров/сутки)':15,
        }

metadict_detail['-Унтер-офицеры'] = {
        '---Личный состав (суммарно)':1,
        '---Личный состав (сержанты)':1,
        'Комплект повседневной экипировки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.07,
        '-Расход продовольствия (килограмм/сутки)':3,
        '-Расход питьевой воды (литров/сутки)':15,
        }

metadict_detail['-Рядовые'] = {
        '---Личный состав (суммарно)':1,
        'Комплект повседневной экипировки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.07,
        '-Расход продовольствия (килограмм/сутки)':3,
        '-Расход питьевой воды (литров/сутки)':15,
        }

metadict_detail['-Контрактники'] = {
        '---Личный состав (суммарно)':1,
        '---Личный состав (сержанты)':1,
        'Комплект повседневной экипировки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.07,
        '-Расход продовольствия (килограмм/сутки)':3,
        '-Расход питьевой воды (литров/сутки)':15,
        }

metadict_detail['-Срочники'] = {
        '---Личный состав (суммарно)':1,
        'Комплект повседневной экипировки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.07,
        '-Расход продовольствия (килограмм/сутки)':3,
        '-Расход питьевой воды (литров/сутки)':15,
        }

#----
# Стоимость отряда (для экономики государства):

metadict_detail['---Стоимость жизни (оценочно)'] = {
        '---Стоимость отряда':1,
        }

metadict_detail['---Стоимость боеприпасов (оценочно)'] = {
        '---Стоимость отряда':1,
        '---Стоимость боекомплекта':1,
        }

metadict_detail['---Стоимость вооружения (оценочно)'] = {
        '---Стоимость отряда':1,
        '---Стоимость вооружения':1,
        }

#----
# Исправить
    # Надо бы перенести в отдельный раздел.
# Производственные процессы:

metadict_detail['-Производство досок и бруса (кубометров/час)'] = {
        # Плотность мокрой древесины около тонны/кубометр.
        # Смена лесопильной рамы -- 10 часов.
        '-Производство досок и бруса (кубометров/сутки)':1 * 10,
        '-Расход деловой древесины (тонн/сутки)':1 / 0.75 * 10,
        }

metadict_detail['-Производство досок и бруса (кубометров/сутки)'] = {
        '-Производство строительных материалов (тонн/сутки)':1,
        }

metadict_detail['-Производство свай низководного моста (штук/час)'] = {
        '-Производство свай низководного моста (штук/сутки)':10,
        }

metadict_detail['-Производство свай низководного моста (штук/сутки)'] = {
        # Толщина ствола -- 0.3 м; длина 21.5 м; объём -- 0.57 кубометров;
        # Объём хлыста -- 0.5 кубометра
        '-Производство строительных материалов (тонн/сутки)':0.5,
        '-Расход деловой древесины (тонн/сутки)':0.5 / 0.75,
        }

metadict_detail['-Очистка/дезактивация, опреснение воды (тонн/час)'] = {
        # Машины могут работать по 20 часов в сутки.
        '-Очистка/дезактивация, опреснение воды (тонн/сутки)':1 * 20,
        }

metadict_detail['-Готовка горячей пищи (суточных пайков)'] = {
        # РАСХОДА ТОПЛИВА НА КОММУНАЛЬНО-БЫТОВЫЕ НУЖДЫ ВОИНСКИХ ЧАСТЕЙ:
        # https://lawrussia.ru/bigtexts/law_818/index.htm
        # Приготовление пищи -- 0.56 кг/бойца
        '-Готовка горячей пищи и хлеба (суточных пайков)':1,
        '-Расход технической воды (литров/сутки)':10,
        '-Расход питьевой воды (литров/сутки)':5,
        '-Расход угля (килограмм/сутки)':0.56,
        }

metadict_detail['-Готовка хлеба (тонн/сутки)'] = {
        # РАСХОДА ТОПЛИВА НА ВЫПЕЧКУ ХЛЕБА
        # https://lawrussia.ru/bigtexts/law_818/index.htm
        # Одна буханка -- 0.5 килограмма
        '-Готовка хлеба (буханок/сутки)':1 * 1000 / 0.5,
        '-Расход технической воды (литров/сутки)':1000,
        '-Расход питьевой воды (литров/сутки)':1000,
        '-Расход угля (килограмм/сутки)':60,
        }

metadict_detail['-Готовка хлеба (буханок/сутки)'] = {
        # Пшеничный формовой хлеб -- 240 килокаллорий/100 грамм
        # Рацион 1.5 килограмма (3 буханки, 3600 килокаллорий)
        '-Готовка хлеба (суточных пайков)':0.33,
        }

metadict_detail['-Готовка хлеба (суточных пайков)'] = {
        '-Готовка горячей пищи и хлеба (суточных пайков)':1,
        }

metadict_detail['-Помывка и чистка униформы (килограмм/час)'] = {
        '-Помывка и чистка униформы (тонн/сутки)':1 / 1000 * 20,
        }

metadict_detail['-Сушка и глажка униформы (килограмм/час)'] = {
        '-Сушка и глажка униформы (тонн/сутки)':1 / 1000 * 20,
        }

metadict_detail['-Помывка и чистка униформы (тонн/сутки)'] = {
        # Исправить:
        # Разобраться со средней мощностью стиральных машин
        # А пока считаем расход топлива через тонну белья.
        # Расход воды в МПП-1 был аж 100 кубометров/тонну белья (современных прачечных 11 кубометров/тонну).
        # http://www.russianarms.ru/forum/index.php/topic,6486.0.html
        # Помывка, это только половина процесса:
        '-Помывка/глажка униформы (тонн/сутки)':1 / 2,
        '-Расход технической воды (тонн/сутки)':20,
        '-Расход угля (килограмм/сутки)':2051,
        }

metadict_detail['-Сушка и глажка униформы (тонн/сутки)'] = {
        # Сушка, это половина процесса:
        '-Помывка/глажка униформы (тонн/сутки)':1 / 2,
        '-Расход технической воды (тонн/сутки)':1,
        '-Расход угля (килограмм/сутки)':91,
        }

metadict_detail['-Помывка/глажка униформы (тонн/сутки)'] = {
        '-Очистка/ремонт униформы (комплектов/сутки)':1 * 1000 / 5,
        }

metadict_detail['-Помывка/банная личного состава (солдат/час)'] = {
        # Исправить
        # Бани могут работать по 20 часов/сутки (две смены)
        # А могут ли столько работать банщики?
        '-Помывка/банная личного состава (солдат/сутки)':1 * 20,
        '-Расход технической воды (литров/сутки)':35 * 20,
        '-Расход угля (килограмм/сутки)':0.24 * 20,
        }

metadict_detail['-Помывка/дезинфекция личного состава (солдат/час)'] = {
        # Душевые из ДДУ используются не больше двух часов в сутки
        '-Помывка/душевая личного состава (солдат/сутки)':1 * 2,
        '-Расход технической воды (литров/сутки)':25 * 2,
        '-Расход угля (килограмм/сутки)':0.24 * 2,
        }

#----
# Марш, передвижение войск:

metadict_detail['-Длина колонны артиллерии (метров)'] = {
        '-Длина колонны артиллерии (километров)':0.001,
        }

metadict_detail['-Длина колонны бронетехники (метров)'] = {
        '-Длина колонны бронетехники (километров)':0.001,
        }

metadict_detail['-Длина колонны буксировщиков (метров)'] = {
        '-Длина колонны буксировщиков (километров)':0.001,
        }

metadict_detail['-Длина колонны зенитных войск (метров)'] = {
        '-Длина колонны зенитных войск (километров)':0.001,
        }

metadict_detail['-Длина колонны колёсной бронетехники (метров)'] = {
        '-Длина колонны колёсной бронетехники (километров)':0.001,
        }

metadict_detail['-Длина колонны обеспечения (метров)'] = {
        '-Длина колонны обеспечения (километров)':0.001,
        }

metadict_detail['-Длина колонны снабжения (метров)'] = {
        '-Длина колонны снабжения (километров)':0.001,
        }
 
metadict_detail['-Длина промежутков между батальонными колоннами (метров)'] = {
        '-Длина промежутков между батальонными колоннами (километров)':0.001,
        }

metadict_detail['-Длина промежутков между взводными колоннами (метров)'] = {
        '-Длина промежутков между взводными колоннами (километров)':0.001,
        }

metadict_detail['-Длина промежутков между ротными колоннами (метров)'] = {
        '-Длина промежутков между ротными колоннами (километров)':0.001,
        }

metadict_detail['-Длина колонны артиллерии (километров)'] = {
        '--Длина колонны на марше (километров)':1,
        }

metadict_detail['-Длина колонны бронетехники (километров)'] = {
        '--Длина колонны на марше (километров)':1,
        }

metadict_detail['-Длина колонны буксировщиков (километров)'] = {
        '--Длина колонны на марше (километров)':1,
        }

metadict_detail['-Длина колонны зенитных войск (километров)'] = {
        '--Длина колонны на марше (километров)':1,
        }

metadict_detail['-Длина колонны колёсной бронетехники (километров)'] = {
        '--Длина колонны на марше (километров)':1,
        }

metadict_detail['-Длина колонны обеспечения (километров)'] = {
        '--Длина колонны на марше (километров)':1,
        }

metadict_detail['-Длина колонны снабжения (километров)'] = {
        '--Длина колонны на марше (километров)':1,
        }

metadict_detail['-Длина промежутков между батальонными колоннами (километров)'] = {
        '--Длина колонны на марше (километров)':1,
        }

metadict_detail['-Длина промежутков между взводными колоннами (километров)'] = {
        '--Длина колонны на марше (километров)':1,
        }

metadict_detail['-Длина промежутков между ротными колоннами (километров)'] = {
        '--Длина колонны на марше (километров)':1,
        }

#----
# Потребление энергии (оценочно):

metadict_detail['-Потребление механической энергии (кВт)'] = {
        # Различным оборудованием, работающим круглые сутки
        '--Потребление энергии (МВт)':0.001,
        }

metadict_detail['-Потребление энергии авиацией (кВт)'] = {
        '-Потребление энергии авиацией (МВт)':0.001,
        }

metadict_detail['-Потребление энергии гусеничной техникой (кВт)'] = {
        '-Потребление энергии гусеничной техникой (МВт)':0.001,
        }

metadict_detail['-Потребление энергии колёсной техникой (кВт)'] = {
        '-Потребление энергии колёсной техникой (МВт)':0.001,
        }

metadict_detail['-Потребление энергии авиацией (МВт)'] = {
        # Средняя скорость -- 200 км/час, 0.0556 км/секунду
        '-Потребление энергии авиацией (МДж/км)':1 / 0.05555555,
        }

metadict_detail['-Потребление энергии гусеничной техникой (МВт)'] = {
        # Средняя скорость -- 30 км/час, 0.008333 км/секунду
        '-Потребление энергии гусеничной техникой (МДж/км)':1 / 0.00833333,
        }

metadict_detail['-Потребление энергии колёсной техникой (МВт)'] = {
        # Средняя скорость -- 50 км/час, 0.013888 км/секунду
        '-Потребление энергии колёсной техникой (МДж/км)':1 / 0.01388888,
        }

metadict_detail['-Потребление энергии авиацией (МДж/км)'] = {
        # Средняя скорость -- 200 км/час, 10 часов полёта в сутки
        '--Потребление энергии (МДж/сутки)':200 * 10,
        }

metadict_detail['-Потребление энергии гусеничной техникой (МДж/км)'] = {
        # Средняя скорость -- 30 км/час, 10 часов марша в сутки
        '--Потребление энергии (МДж/сутки)':30 * 10,
        }

metadict_detail['-Потребление энергии колёсной техникой (МДж/км)'] = {
        # Средняя скорость -- 30 км/час, 10 часов марша в сутки
        '--Потребление энергии (МДж/сутки)':30 * 10,
        }

metadict_detail['--Потребление энергии (МДж/сутки)'] = {
        '--Потребление энергии (тонно-маховиков/сутки)':1 / 10 / 1000,
        }

#metadict_detail['--Потребление энергии (кВт)'] = {
#        '--Потребление энергии (МВт)':0.001,
#        }

metadict_detail['--Потребление энергии (МВт)'] = {
        # Точная оценка расхода маховиков, приблизительная топлива или угля:
            # В каждом килограмме маховика -- 10 МДж энергии
            # КПД газогенератора 70%, КПД дизельного двигателя 40%
        '--Потребление энергии (тонно-маховиков/сутки)':1 / 10 / 1000 * 3600 * 24,
        #'--Потребление энергии (тонн угля/сутки)':1 / 0.7 / 0.4 / 29.3 / 1000 * 3600 * 24,
        #'--Потребление энергии (тонн дизеля/сутки)':1 / 0.4 / 43 / 1000 * 3600 * 24,
        }

metadict_detail['-Потребление электрической энергии (кВт)'] = {
        '-Потребление электроэнергии (мегаватт*час)':0.001 * 3.6,
        }

metadict_detail['-Производство электрической энергии (кВт)'] = {
        '-Производство электрической энергии (МВт)':0.001,
        '-Производство электроэнергии (мегаватт*час)':0.001 * 3.6,
        }

metadict_detail['-Производство электрической энергии (МВт)'] = {
        '--Производство энергии (тонно-маховиков/сутки)':1 / 10 / 1000 * 3600 * 24,
        }

metadict_detail['-Производство механической энергии (кВт)'] = {
        '-Производство механической энергии (МВт)':0.001,
        }

metadict_detail['-Производство механической энергии (МВт)'] = {
        '--Производство энергии (тонно-маховиков/сутки)':1 / 10 / 1000 * 3600 * 24,
        }





#----
# Коррекция величин:

metadict_detail['-Тротиловый эквивалент (килограмм)'] = {
        '-Тротиловый эквивалент (тонн)':0.001,
        }

metadict_detail['-Грузооборот предельный (тонно-километров/сутки)'] = {
        '-Грузооборот предельный (тонно-километров/час)':1 / 24,
        }

metadict_detail['-Расход продовольствия (килограмм/сутки)'] = {
        '-Расход продовольствия (тонн/сутки)':1 / 1000,
        }

metadict_detail['-Расход питьевой воды (литров/сутки)'] = {
        '-Расход питьевой воды (тонн/сутки)':1 / 1000,
        }

metadict_detail['-Расход технической воды (литров/сутки)'] = {
        '-Расход технической воды (тонн/сутки)':1 / 1000,
        }

metadict_detail['-Энергия маховиков (МДж)'] = {
        '--Запас энергии (МДж)':1,
        }

metadict_detail['-Условное топливо (килограмм)'] = {
        '--Запас условного топлива (тонн)':1 / 1000,
        }

metadict_detail['--Запас энергии (МДж)'] = {
        # Теплота сгорания каменного угля -- 29.3 МДж/кг; дизельного топлива -- 43 МДж/кг.
        '--Запас энергии (тонно-маховики)':1 / 10 / 1000,
        #'--Запас энергии (тонн угля)':1 / 0.7 / 0.4 / 29.3 / 1000,
        #'--Запас энергии (тонн дизеля)':1 / 0.4 / 43 / 1000,
        }

metadict_detail['-Расход дизельного топлива (килограмм/секунду)'] = {
        #'--Потребление энергии (МВт)':1 * 43,
        '-Расход дизельного топлива (тонн/час)':1 * 3.6,
        }

metadict_detail['-Расход дизельного топлива (тонн/час)'] = {
        # Исправить.
            # Будь внимательней, это усреднённый показатель.
            # Предполагается, что генераторы работают 24 часа/сутки
        '-Расход дизельного топлива (тонн/сутки)':1 * 24,
        }

metadict_detail['-Расход угля (килограмм/сутки)'] = {
        '-Расход угля (килограмм/секунду)':1 / 24 / 60 / 60,
        }

metadict_detail['-Расход угля (килограмм/час)'] = {
        '-Расход угля (килограмм/секунду)':1 / 60 / 60,
        }

metadict_detail['-Расход угля (килограмм/секунду)'] = {
        #'--Потребление энергии (МВт)':1 * 29,
        '-Расход угля (тонн/час)':1 * 3.6,
        }

metadict_detail['-Расход угля (тонн/час)'] = {
        '-Расход угля (тонн/сутки)':1 * 24,
        }

metadict_detail['---Стоимость боекомплекта'] = {
        '---Стоимость боекомплекта (млн)':0.000001,
        }

metadict_detail['---Стоимость вооружения'] = {
        '---Стоимость вооружения (млн)':0.000001,
        }

metadict_detail['---Стоимость отряда'] = {
        '---Стоимость отряда (млн)':0.000001,
        }

metadict_detail['---Стоимость проекта'] = {
        '---Стоимость проекта (млн)':0.000001,
        }

metadict_detail['---Ожидаемые расходы'] = {
        '---Ожидаемые расходы (млн)':0.000001,
        }







#metadict_detail['-Грузовики, бронетехника, тяжёлое оружие (тонн)'] = {
#        '-Грузовики, бронетехника, тяжёлое оружие (килограмм)':1000,
#        }
#
#metadict_detail['-КУНГи, прицепы, расходники, инструменты (тонн)'] = {
#        '-КУНГи, прицепы, расходники, инструменты (килограмм)':1000,
#        }
#
#metadict_detail['-Оружие, боеприпасы, экипировка, солдаты (тонн)'] = {
#        '-Оружие, боеприпасы, экипировка, солдаты (килограмм)':1000,
#        }



#metadict_detail['---Стоимость вооружения (млн)'] = {
#        '---Стоимость вооружения ($)':1000000,
#        }
#
#metadict_detail['---Стоимость боекомплекта (млн)'] = {
#        '---Стоимость боекомплекта ($)':1000000,
#        }

#----
# Убираем лишнее:

metadict_detail['--Налог на добавленную стоимость (бит)'] = {
        }

metadict_detail['--Прогрессивный подоходный налог (бит)'] = {
        }

#metadict_detail['-Допустимые габариты техники (кубометров)'] = {
#        }

metadict_detail['-Объём груза (кубометров)'] = {
        }

metadict_detail['-Объём доступный (кубометров)'] = {
        }

#metadict_detail['-Объём используемый (кубометров)'] = {
#        #'-Объём используемый (литров)':1000,
#        }
