#----
# Вооружённые силы:

metadict_army['Вооружённые силы Эквестрии'] = {
        'Генеральный штаб':1,
        'Сухопутные войска':1,
        'Военно-воздушные силы':1,
        'Военно-морской флот':1,
        'Ракетные войска':1,
        }

#----
# Рода войск:

metadict_army['Военно-воздушные силы'] = {
        'Управление военно-воздушных сил':1,
        'Воздушная группа армий':2,
        'Воздушный флот "Тандерхед"':1,
        'Воздушный флот "Лайтинг"':1,
        'Воздушный флот "Сильверскай"':1,
        }

metadict_army['Сухопутные войска'] = {
        'Управление сухопутных войск':1,
        'Группа армий "Центр"':1,
        'Группа армий "Запад"':1,
        'Внутренние войска':1,
        }

metadict_army['Ракетные войска'] = {
        'Управление ракетных войск':1,
        'Кантерлотская ракетная группа армий':1,
        'Хуффингтонская ракетная группа армий':1,
        'Обеспечение ракетных войск':1,
        }




