#----
# Космические аппараты:

metadict_detail['Спутник оптико-электронной разведки (активный)'] = {
        '|-Производство спутниковых платформ (выпущено штук)':1,
        '-Полезная нагрузка (низкая опорная орбита) (тонн)':5,
        '-Допустимая стоимость техники ($)':2500000,
        }

metadict_detail['Спутник оптико-электронной разведки (выбывший)'] = {
        '|-Производство спутниковых платформ (выпущено штук)':1,
        '-Полезная нагрузка (низкая опорная орбита) (тонн)':5,
        '-Допустимая стоимость техники ($)':2500000,
        }

metadict_detail['Спутник радиотехнической разведки (активный)'] = {
        '|-Производство спутниковых платформ (выпущено штук)':1,
        '-Полезная нагрузка (геопереходная орбита) (тонн)':5,
        '-Допустимая стоимость техники ($)':15000000,
        }

metadict_detail['Спутник радиотехнической разведки (выбывший)'] = {
        '|-Производство спутниковых платформ (выпущено штук)':1,
        '-Полезная нагрузка (геопереходная орбита) (тонн)':5,
        '-Допустимая стоимость техники ($)':15000000,
        }

metadict_detail['Спутник связи (активный)'] = {
        '|-Производство спутниковых платформ (выпущено штук)':1,
        '-Полезная нагрузка (геопереходная орбита) (тонн)':2.5,
        '-Допустимая стоимость техники ($)':2000000,
        }

metadict_detail['Спутник связи (выбывший)'] = {
        '|-Производство спутниковых платформ (выпущено штук)':1,
        '-Полезная нагрузка (геопереходная орбита) (тонн)':2.5,
        '-Допустимая стоимость техники ($)':2000000,
        }

metadict_detail['Спутник системы навигации (активный)'] = {
        '|-Производство спутниковых платформ (выпущено штук)':1,
        '-Полезная нагрузка (геопереходная орбита) (тонн)':2.5,
        '-Допустимая стоимость техники ($)':10000000,
        }

metadict_detail['Спутник системы навигации (выбывший)'] = {
        '|-Производство спутниковых платформ (выпущено штук)':1,
        '-Полезная нагрузка (геопереходная орбита) (тонн)':2.5,
        '-Допустимая стоимость техники ($)':2000000,
        }

metadict_detail['Спутник-ретранслятор (активный)'] = {
        '|-Производство спутниковых платформ (выпущено штук)':1,
        '-Полезная нагрузка (геостационарная орбита) (тонн)':2.5,
        '-Допустимая стоимость техники ($)':2000000,
        }

metadict_detail['Спутник-ретранслятор (выбывший)'] = {
        '|-Производство спутниковых платформ (выпущено штук)':1,
        '-Полезная нагрузка (геостационарная орбита) (тонн)':2.5,
        '-Допустимая стоимость техники ($)':2000000,
        }

#----
# Авиация:

metadict_detail['Сторожевой робот'] = {
        'Платформа мультикоптера':1,
        'Боевой модуль сторожевого робота':1,
        'Электрооборудование и средства связи сторожевого робота':1,
        }

metadict_detail['Разведывательный БПЛА'] = {
        # https://ru.wikipedia.org/wiki/Шмель-1
        'Платформа лёгкого БПЛА':1,
        'Разведывательная аппаратура БПЛА':1,
        'Электрооборудование и средства связи разведывательного БПЛА':1,
        }

metadict_detail['БПЛА радиоподавления'] = {
        'Платформа лёгкого БПЛА':1,
        'Аппаратура БПЛА радиоподавления':1,
        'Электрооборудование и средства связи разведывательного БПЛА':1,
        }

metadict_detail['Истребитель-бомбардировщик'] = {
        # https://ru.wikipedia.org/wiki/МиГ-21
        'Платформа многоцелевого истребителя':1,
        'Вооружение бомбардировщика':0.333,
        'Вооружение фронтового штурмовика':0.333,
        'Вооружение истребителя-перехватчика':0.333,
        }

metadict_detail['Вооружение бомбрадировщика'] = {
        'Точка подвески (24-мм спаренная авиационная пушка)':1,
        'Точка подвески (противотанковая кассетная авиабомба 250 кг)':4,
        }

metadict_detail['Вооружение фронтового штурмовика'] = {
        'Точка подвески (24-мм спаренная авиационная пушка)':1,
        'Точка подвески (ракета воздух-поверхность)':4,
        }

metadict_detail['Вооружение истребителя-перехватчика'] = {
        'Точка подвески (24-мм спаренная авиационная пушка)':1,
        'Точка подвески (ракеты воздух-воздух)':4,
        }

metadict_detail['Транспортный экранолёт'] = {
        # http://www.ekip-aviation-concern.com/rus-b/10.shtml
        # http://www.ekip-aviation-concern.com/rus-b/15.shtml
        'Платформа транспортного экранолёта':1,
        'Грузовая кабина транспортного экранолёта':1,
        }

#----
# Планёры:

metadict_detail['Тяжёлый планёр (транспортный)'] = {
        'Платформа тяжёлого планёра':1,
        'Грузовая кабина тяжёлого планёра':1,
        }

metadict_detail['Тяжёлый планёр (РЛС обнаружения)'] = {
        'Платформа тяжёлого планёра':1,
        'Оборудование РЛС обнаружения':1,
        }

metadict_detail['Тяжёлый планёр (РЛС наведения)'] = {
        'Платформа тяжёлого планёра':1,
        'Оборудование РЛС наведения':1,
        }

metadict_detail['Тяжёлый планёр (станция РТР)'] = {
        'Платформа тяжёлого планёра':1,
        'Оборудование станции дальней радиотехнической разведки':1,
        }

metadict_detail['Лёгкий планёр (перевозка боеприпасов)'] = {
        'Платформа лёгкого планёра':1,
        'Грузовая кабина лёгкого планёра':1,
        '-Место под боеприпасы (тонн)':0.2,
        }

metadict_detail['Лёгкий планёр (перевозка оружия)'] = {
        'Платформа лёгкого планёра':1,
        'Грузовая кабина лёгкого планёра':1,
        }

metadict_detail['Лёгкий планёр (перевозка снаряжения)'] = {
        'Платформа лёгкого планёра':1,
        'Грузовая кабина лёгкого планёра':1,
        }

metadict_detail['Боевой планёр (реактивные снаряды)'] = {
        'Платформа лёгкого планёра':1,
        'Точка подвески (единый пулемёт)':1,
        'Точка подвески (реактивные снаряды)':2,
        }

metadict_detail['Боевой планёр (управляемые ракеты)'] = {
        'Платформа лёгкого планёра':1,
        'Точка подвески (единый пулемёт)':1,
        'Точка подвески (управляемая ракета)':2,
        }

metadict_detail['Боевой планёр (зенитные ракеты)'] = {
        'Платформа лёгкого планёра':1,
        'Точка подвески (единый пулемёт)':1,
        'Точка подвески (зенитная ракета ПЗРК)':2,
        }

metadict_detail['Боевой планёр (авиабомбы)'] = {
        'Платформа лёгкого планёра':1,
        'Точка подвески (единый пулемёт)':1,
        'Точка подвески (противотанковая кассетная авиабомба 50 кг)':1,
        }

#----
# Гусеничная техника на стандартных платформах:

metadict_detail['Основной боевой танк'] = {
        # https://ru.wikipedia.org/wiki/Т-64
        'Платформа ОБТ':1,
        'Боевой модуль ОБТ':1,
        'Лазерная система активной защиты':1,
        }

metadict_detail['Основной боевой танк (КШМ)'] = {
        'Платформа ОБТ':1,
        'Боевой модуль ОБТ':1,
        'Лазерная система активной защиты':1,
        'Оборудование командно-штабной машины':1,
        }

metadict_detail['Боевая машина пехоты'] = {
        # https://ru.wikipedia.org/wiki/Мардер_(БМП)
        'Платформа БМП':1,
        'Боевой модуль БМП':1,
        }

metadict_detail['Боевая машина пехоты (БРМ)'] = {
        'Платформа БМП':1,
        'Боевой модуль БМП':1,
        'Оборудование боевой разведывательной машины':1,
        }

metadict_detail['Боевая машина пехоты (КШМ)'] = {
        'Платформа БМП':1,
        'Боевой модуль БМП':1,
        'Оборудование командно-штабной машины':1,
        }

metadict_detail['Боевая машина десанта'] = {
        # https://ru.wikipedia.org/wiki/Wiesel
        'Платформа БМД':1,
        'Боевой модуль БМД':1,
        }

metadict_detail['Боевая машина десанта (КШМ)'] = {
        'Платформа БМД':1,
        'Боевой модуль БМД':1,
        'Оборудование командно-штабной машины':1,
        }

metadict_detail['Штурмовой робот'] = {
        # http://bastion-opk.ru/nerehta-robotic-systems/
        # Таки не платформа БМД, а шасси БМД, роботу незачем весь корпус таскать.
        'Платформа БМД':1,
        'Боевой модуль БМД':1,
        'Электрооборудование и средства связи штурмового робота':1,
        }

#----
# Колёсная техника на стандартных платформах:

metadict_detail['Бронетранспортёр'] = {
        # https://ru.wikipedia.org/wiki/БТР-60
        'Платформа БТР':1,
        'Боевой модуль БТР':1,
        }

metadict_detail['Бронетранспортёр (ИРМ)'] = {
        # http://saper.isnet.ru/texnica/irm.html
        'Платформа БТР':1,
        'Оборудование инженерной разведывательной машины':1,
        }

metadict_detail['Бронетранспортёр (КШМ)'] = {
        'Платформа БТР':1,
        'Оборудование командно-штабной машины':1,
        }

metadict_detail['Бронетранспортёр (спутниковая связь)'] = {
        'Платформа БТР':1,
        'Оборудование спутниковой связи':1,
        }

metadict_detail['Бронетранспортёр (КВ-радиостанция)'] = {
        'Платформа БТР':1,
        'Оборудование КВ-радиосвязи':1,
        }

metadict_detail['Бронетранспортёр (радиоподавление)'] = {
        'Платформа БТР':1,
        'Оборудование станции радиоподавления':1,
        }

metadict_detail['Бронетранспортёр (звукометрическая разведка)'] = {
        'Платформа БТР':1,
        'Оборудование звукометрической разведки':1,
        }

metadict_detail['Бронетранспортёр (РХБ разведка)'] = {
        'Платформа БТР':1,
        'Оборудование машины РХБ разведки':1,
        }

metadict_detail['Бронетранспортёр (станция радиотехнической разведки)'] = {
        'Платформа БТР':1,
        'Оборудование радиотехнической разведки':1,
        }

metadict_detail['Бронетранспортёр (станция радиоразведки)'] = {
        'Платформа БТР':1,
        'Оборудование станции радиоразведки':1,
        }

metadict_detail['Бронетранспортёр (установка разминирования)'] = {
        # http://saper.isnet.ru/texnica-2/yr-77.html
        # http://saper.isnet.ru/texnica-2/yr-83p.html
        'Платформа БТР':1,
        'Оборудование установки разминирования':1,
        }

#----
# Инженерная техника на стандартных платформах:

metadict_detail['Бронированная ремонтно-эвакуационная машина'] = {
        'Платформа тяжёлого гусеничного тягача':1,
        'Оборудование бронированной ремонтно-эвакуационной машины':1,
        }

metadict_detail['Быстроходная траншейная машина'] = {
        # http://saper.isnet.ru/texnica/btm.html
        'Платформа тяжёлого гусеничного тягача':1,
        'Оборудование быстроходной траншейной машины':1,
        }

metadict_detail['Инженерная машина разграждения'] = {
        # http://saper.isnet.ru/texnica/imr.html
        'Платформа тяжёлого гусеничного тягача':1,
        'Оборудование инженерной машины разграждения':1,
        }

metadict_detail['Машина для отрывки котлована'] = {
        # http://saper.isnet.ru/texnica/mdk-2.html
        'Платформа тяжёлого гусеничного тягача':1,
        'Оборудование машины для отрывки котлована':1,
        }

metadict_detail['Плавающий гусеничный транспортёр'] = {
        # http://saper.isnet.ru/texnica-2/pts-2.html
        'Платформа тяжёлого гусеничного тягача':1,
        'Корпус плавающего гусеничного транспортёра':1,
        }

metadict_detail['Буксируемый катер'] = {
        # http://saper.isnet.ru//texnica/bmk-t.html
        '-Допустимая масса техники (тонн)':6,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        '-Допустимая стоимость техники ($)':100000,
        }

#----
# Артиллерия:

metadict_detail['Бронетранспортёр (автоматический 80-мм миномёт)'] = {
        'Платформа БТР':1,
        'Автоматический 80-мм миномёт':1,
        'Электрооборудование и средства связи батальонной артиллерии':1,
        }

metadict_detail['Полковая 120-мм гаубица'] = {
        # https://ru.wikipedia.org/wiki/122-мм_гаубица_Д-30
        'Устройство 120-мм гаубицы':1,
        '|-Производство 120-мм гаубиц (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':11.4 * 2.5 * 1.95,
        '-Допустимая масса техники (тонн)':7,
        '-Допустимая стоимость техники ($)':500000,
        }

metadict_detail['Полковая 120-мм САУ'] = {
        # https://ru.wikipedia.org/wiki/2С1
        'Платформа БТР':1,
        'Боевой модуль 120-мм САУ':1,
        'Электрооборудование и средства связи полковой артиллерии':1,
        }

metadict_detail['Дивизионная 150-мм гаубица'] = {
        # https://ru.wikipedia.org/wiki/152-мм_гаубица_2А65
        'Устройство 150-мм гаубицы':1,
        '|-Производство 150-мм гаубиц (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':11.4 * 2.5 * 1.95,
        '-Допустимая масса техники (тонн)':7,
        '-Допустимая стоимость техники ($)':1000000,
        }

metadict_detail['Дивизионная 150-мм САУ'] = {
        # https://ru.wikipedia.org/wiki/2С3
        'Платформа тяжёлого гусеничного тягача':1,
        'Боевой модуль 150-мм САУ':1,
        'Электрооборудование и средства связи дивизионной артиллерии':1,
        }

metadict_detail['Дивизионная 210-мм РСЗО'] = {
        # https://ru.wikipedia.org/wiki/Ураган_(РСЗО)
        'Платформа тяжёлого седельного тягача':1,
        'Блок направляющих 210-мм РСЗО':1,
        'Электрооборудование и средства связи дивизионной артиллерии':1,
        }

#----
# Зенитные установки:

metadict_detail['Зенитный ракетный комплекс ближнего действия'] = {
        # https://ru.wikipedia.org/wiki/Оса_(зенитный_ракетный_комплекс)
        'Платформа БТР':1,
        'Лазерная система активной защиты':1,
        'Боевой модуль ЗРК ближнего действия':1,
        'Электрооборудование и средства связи дивизионного ЗРК':1,
        }

metadict_detail['Зенитный ракетный комплекс малой дальности'] = {
        # http://www.russianarms.ru/forum/index.php/topic,10852.0.html
        'Платформа тяжёлого гусеничного тягача':1,
        'Боевой модуль ЗРК малой дальности':1,
        'Электрооборудование и средства связи армейского ЗРК':1,
        }

metadict_detail['Зенитный ракетный комплекс средней дальности'] = {
        # http://www.russianarms.ru/forum/index.php/topic,1338.0.html
        'Платформа тяжёлого гусеничного тягача':1,
        'Боевой модуль ЗРК средней дальности':1,
        'Электрооборудование и средства связи армейского ЗРК':1,
        }

metadict_detail['Прицеп (пусковая установка ЗРК большой дальности)'] = {
        # Это всего лишь прицеп с гидроприводом, он не должен так дорого стоить:
        'Зенитные ракеты большой дальности':1,
        '-Допустимая масса техники (тонн)':3,
        '--Противовоздушные возможности (по самолётам)':0.8,
        '-Допустимая стоимость техники ($)':200000,
        }

metadict_detail['Заряжающая машина ЗРК большой дальности'] = {
        # Стальная рама на рельсовом ходу (это так старомодно)
        '-Допустимая масса техники (тонн)':5,
        '-Допустимая стоимость техники ($)':50000,
        }

#----
# Ракетные комплексы:

metadict_detail['Самоходная пусковая установка тактических ракет'] = {
        # https://ru.wikipedia.org/wiki/Точка_(тактический_ракетный_комплекс)
        # http://www.mil.by/ru/forces/structure/rvia/466/7855/
        'Платформа БТР':1,
        'Направляющая тактической ракеты':1,
        'Электрооборудование и средства связи комплекса тактических ракет':1,
        }

metadict_detail['Транспортно-заряжающая машина тактических ракет'] = {
        # http://www.mil.by/ru/forces/structure/rvia/466/7865/
        'Платформа БТР':1,
        'Ложемент тактической ракеты':2,
        }

metadict_detail['Самоходная пусковая установка оперативно-тактических ракет'] = {
        # http://rbase.new-factoria.ru/missile/wobb/8k14/9p117.shtml
        'Платформа тяжёлого седельного тягача':1,
        'Направляющая оперативно-тактической ракеты':1,
        'Электрооборудование и средства связи комплекса оперативно-тактических ракет':1,
        }

metadict_detail['Транспортно-заряжающая машина оперативно-тактических ракет'] = {
        'Платформа тяжёлого седельного тягача':1,
        'Ложемент оперативно-тактической ракеты':1,
        }

#----
# Тракторы, тягачи:

metadict_detail['Тяжёлый седельный тягач'] = {
        # https://ru.wikipedia.org/wiki/МАЗ-7310
        'Платформа тяжёлого седельного тягача':1,
        }

metadict_detail['Тяжёлый седельный тягач (станция зарядки маховиков)'] = {
        # Перевозка тяжёлой бронетехники и её подзарядка (маховики в днище):
        'Платформа тяжёлого седельного тягача':1,
        'Оборудование станции зарядки маховиков':1,
        }

metadict_detail['Тяжёлый седельный тягач (мобильная АЭС)'] = {
        'Платформа тяжёлого седельного тягача':1,
        'Оборудование мобильной атомной электростанции':1,
        }

metadict_detail['Тяжёлый гусеничный тягач'] = {
        'Платформа тяжёлого гусеничного тягача':1,
        }

metadict_detail['Тяжёлый гусеничный тягач (РЛС обнаружения)'] = {
        # https://ru.wikipedia.org/wiki/П-40
        'Платформа тяжёлого гусеничного тягача':1,
        'Оборудование РЛС обнаружения':1,
        }

metadict_detail['Тяжёлый гусеничный тягач (РЛС наведения)'] = {
        # https://ru.wikipedia.org/wiki/1С32
        'Платформа тяжёлого гусеничного тягача':1,
        'Оборудование РЛС наведения':1,
        }

metadict_detail['Гусеничный трактор'] = {
        'Платформа гусеничного трактора':1,
        }

metadict_detail['Колёсный трактор'] = {
        'Платформа колёсного трактора':1,
        }

#----
# Грузовики (инженерная техника):

metadict_detail['Военный грузовик (экскаватор)'] = {
        # http://saper.isnet.ru/texnica/ex-44.html
        'Платформа военного грузовика':1,
        'Оборудование одноковшового экскаватора':1,
        }

metadict_detail['Военный грузовик (звено понтонно-мостового парка)'] = {
        'Платформа военного грузовика':1,
        'Звено понтонно-мостового парка':1,
        }

metadict_detail['Военный грузовик (тяжёлый механизированный мост)'] = {
        # http://saper.isnet.ru//texnica/tmm.html
        'Платформа военного грузовика':1,
        'Оборудование тяжёлого механизированного моста':1,
        }

metadict_detail['Военный грузовик (установка строительства мостов)'] = {
        # http://saper.isnet.ru//texnica-2/usm.html
        'Платформа военного грузовика':1,
        'Оборудование установки строительства мостов':1,
        }

metadict_detail['Военный грузовик (самосвал)'] = {
        'Платформа военного грузовика':1,
        'Кузов самосвала':1,
        }

metadict_detail['Военный грузовик (автокран)'] = {
        # http://saper.isnet.ru/texnica/avtokran-1.html
        'Платформа военного грузовика':1,
        'Оборудование стрелового крана':1,
        }

metadict_detail['Военный грузовик (бурильная машина)'] = {
        # http://saper.isnet.ru/texnica/bgm.html
        'Платформа военного грузовика':1,
        'Оборудование бурильной машины':1,
        }

metadict_detail['Военный грузовик (пожарная машина)'] = {
        'Платформа военного грузовика':1,
        'Оборудование пожарной машины':1,
        }

metadict_detail['Военный грузовик (авторазливочная станция)'] = {
        'Платформа военного грузовика':1,
        'Оборудование авторазливочной станции':1,
        }

metadict_detail['Военный грузовик (тепловая машина специальной обработки)'] = {
        'Платформа военного грузовика':1,
        'Оборудование тепловой машины специальной обработки':1,
        }

metadict_detail['Военный грузовик (автомобильная фильтровальная станция)'] = {
        # http://saper.isnet.ru/texnica-2/MAFS.html
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование автомобильной фильтровальной станции':1,
        }

#----
# Грузовики (разведка и связь):

metadict_detail['Военный грузовик (радиопеленгационный метеорологический комплекс)'] = {
        # РПМК-1 «Улыбка» (1Б44) - радиопеленгационный метеорологический комплекс
        # http://www.russianarms.ru/forum/index.php?topic=4193.0
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование радиопеленгационного метеорологического комплекса':1,
        }

metadict_detail['Военный грузовик (станция РТР)'] = {
        # 1Л222 Автобаза
        # http://militaryrussia.ru/blog/topic-598.html
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование станции дальней радиотехнической разведки':1,
        }

metadict_detail['Военный грузовик (станция помех наведению)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование станции помех наведению':1,
        }

metadict_detail['Военный грузовик (КВ-радиостанция)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование КВ-радиосвязи':1,
        }

metadict_detail['Военный грузовик (КШМ)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование командно-штабной машины':1,
        }

metadict_detail['Военный грузовик (сервер АСУ)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудованеи сервера АСУ':1,
        }

metadict_detail['Военный грузовик (спутниковая связь)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудованеи спутниковой связи':1,
        }

#----
# Грузовики (обеспечение):

metadict_detail['Военный грузовик (КУНГ)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        }

metadict_detail['Военный грузовик (дезинфекционно-душевой комплекс)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование дезинфекционно-душевого комплекса':1,
        'Прицеп (дезинфекционная установка)':1,
        }

metadict_detail['Военный грузовик (полевая баня)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование полевой бани':1,
        '-Помывка/дезинфекция личного состава (солдат/час)':32,
        }

metadict_detail['Военный грузовик (полевая прачечная)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование полевой прачечной':1,
        }

metadict_detail['Военный грузовик (полевая кухня)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование полевой кухни':1,
        '-Готовка горячей пищи и хлеба (суточных пайков)':200,
        }

metadict_detail['Военный грузовик (полевой хлебозавод)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование полевого хлебозавода':1,
        '-Готовка горячей пищи и хлеба (суточных пайков)':2000,
        }

metadict_detail['Военный грузовик (мастерская)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование мастерской':1,
        }

metadict_detail['Военный грузовик (автомастерская)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование автомастерской':1,
        }

metadict_detail['Военный грузовик (мастерская бронетехники)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование мастерской бронетехники':1,
        }

metadict_detail['Военный грузовик (слесарная мастерская)'] = {
        'Платформа военного грузовика':1,
        'Унифицированный герметичный кузов':1,
        'Оборудование слесарной мастерской':1,
        }

#----
# Грузовики (снабжение):

metadict_detail['Военный грузовик (буксировщик техники)'] = {
        'Платформа военного грузовика':1,
        }

metadict_detail['Военный грузовик (перевозчик зенитных ракет большой дальности)'] = {
        'Платформа военного грузовика':1,
        'Ложемент зенитной ракеты большой дальности':1,
        }

metadict_detail['Военный грузовик (перевозчик авиации)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        }

metadict_detail['Военный грузовик (перевозчик пусковой установки ЗРК)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        }

metadict_detail['Военный грузовик (перевозчик артиллерии)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        }

metadict_detail['Военный грузовик (водная цистерна)'] = {
        'Платформа военного грузовика':1,
        'Автомобильная водная цистерна':1,
        }

metadict_detail['Военный грузовик (топливная цистерна)'] = {
        'Платформа военного грузовика':1,
        'Автомобильная топливная цистерна':1,
        }

metadict_detail['Военный грузовик (боеприпасы)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        '-Место под боеприпасы (тонн)':5,
        }

metadict_detail['Военный грузовик (зенитные ракеты)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        '-Место под зенитные ракеты (тонн)':6,
        }

metadict_detail['Военный грузовик (маховики)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        '-Место под маховики (тонн)':5,
        }

metadict_detail['Военный грузовик (взрывчатка и мины)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        '-Место под взрывчатку и мины (тонн)':5,
        }

metadict_detail['Военный грузовик (продовольствие)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        '-Место под продовольствие (тонн)':5,
        }

metadict_detail['Военный грузовик (снаряжение)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        '-Место под снаряжение (тонн)':5,
        }

metadict_detail['Военный грузовик (строительные материалы)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        '-Место под стройматериалы (тонн)':5,
        }

metadict_detail['Военный грузовик (твёрдое топливо)'] = {
        'Платформа военного грузовика':1,
        'Тентованный кузов':1,
        '-Место под уголь (тонн)':5,
        }

#----
# Прицепы:

metadict_detail['Прицеп (лесопильная рама)'] = {
        # http://saper.isnet.ru/texnica/lrv.html
        'Автомобильный прицеп':1,
        'Лесопильная рама':1,
        }

metadict_detail['Прицеп (дезинфекционная установка)'] = {
        # http://www.evro3.ru/arm/ddk01.html
        'Автомобильный прицеп':1,
        'Оборудование дезинфекционной установки':1,
        }

metadict_detail['Прицеп (полевая кухня)'] = {
        'Автомобильный прицеп':1,
        'Оборудование полевой кухни':1,
        '-Готовка горячей пищи и хлеба (суточных пайков)':130,
        }

metadict_detail['Прицеп (водная цистерна)'] = {
        'Автомобильный прицеп':1,
        'Прицепная водная цистерна':1,
        }

metadict_detail['Прицеп (топливная цистерна)'] = {
        'Автомобильный прицеп':1,
        'Прицепная топливная цистерна':1,
        }

metadict_detail['Прицеп (боеприпасы)'] = {
        'Автомобильный прицеп':1,
        'Тентованный кузов':1,
        '-Место под боеприпасы (тонн)':5,
        }

metadict_detail['Прицеп (зенитные ракеты)'] = {
        'Автомобильный прицеп':1,
        'Тентованный кузов':1,
        '-Место под зенитные ракеты (тонн)':5,
        }

metadict_detail['Прицеп (маховики)'] = {
        'Автомобильный прицеп':1,
        'Тентованный кузов':1,
        '-Место под маховики (тонн)':5,
        }

metadict_detail['Прицеп (взрывчатка и мины)'] = {
        'Автомобильный прицеп':1,
        'Тентованный кузов':1,
        '-Место под взрывчатку и мины (тонн)':5,
        }

metadict_detail['Прицеп (продовольствие)'] = {
        'Автомобильный прицеп':1,
        'Тентованный кузов':1,
        '-Место под продовольствие (тонн)':5,
        }

metadict_detail['Прицеп (снаряжение)'] = {
        'Автомобильный прицеп':1,
        'Тентованный кузов':1,
        '-Место под снаряжение (тонн)':5,
        }

metadict_detail['Прицеп (строительные материалы)'] = {
        'Автомобильный прицеп':1,
        'Тентованный кузов':1,
        '-Место под стройматериалы (тонн)':5,
        }

metadict_detail['Прицеп (твёрдое топливо)'] = {
        'Автомобильный прицеп':1,
        'Тентованный кузов':1,
        '-Место под уголь (тонн)':5,
        }

#----
# Механические устройства:

metadict_detail['Башенный кран'] = {
        # http://www.techstory.ru/krans/krantech/kb308hl_tech.htm
        'Компоненты башенного крана':1,
        '|-Проект башенного крана (выпущено штук)':1,
        '-Допустимая масса оборудования (тонн)':30,
        '-Допустимая стоимость оборудования ($)':50000,
        }

#----
# Гражданская техника:

metadict_detail['Зерноуборочный комбайн'] = {
        # https://ru.wikipedia.org/wiki/СК-5_«Нива»
        'Платформа гусеничного трактора':1,
        'Оборудование зерноуборочного комбайна':1,
        }

metadict_detail['Колёсный трактор (грейдер)'] = {
        # https://ru.wikipedia.org/wiki/СК-5_«Нива»
        'Платформа колёсного трактора':1,
        'Оборудование автогрейдера':1,
        }

metadict_detail['Легковой автомобиль'] = {
        # https://ru.wikipedia.org/wiki/ВАЗ-2103
        # https://www.usatoday.com/story/money/cars/2015/05/04/new-car-transaction-price-3-kbb-kelley-blue-book/26690191/
        'Шасси легкового автомобиля':1,
        'Корпус легкового автомобиля':1,
        '|-Проект легкового автомобиля (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':4.1 * 1.6 * 1.5,
        '-Допустимая масса техники (тонн)':1,
        '-Допустимая стоимость техники ($)':30000,
        }

metadict_detail['Автомобильный прицеп'] = {
        # http://www.russian-trailer.ru/bortovye_tentovie_pricepy/maz_837300_3010/
        'Шасси автомобильного прицепа':1,
        '|-Производство автомобильных прицепов (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':5.3 * 2.5 * 2.3,
        '-Допустимая масса оборудования (тонн)':2.6,
        '-Допустимая стоимость техники ($)':20000,
        }

#----
# Авиационные платформы:

metadict_detail['Платформа мультикоптера'] = {
        'Конструкция мультикоптера':1,
        '|-Производство мультикоптеров (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':3 * 3 * 1,
        '-Допустимая масса техники (тонн)':0.2,
        '-Допустимая стоимость техники ($)':100000,



        '--Потребление энергии (кВт)':60,
        '--Запас энергии (МДж)':300,
        }

metadict_detail['Платформа лёгкого БПЛА'] = {
        'Конструкция лёгкого БПЛА':1,
        '|-Производство лёгких БПЛА (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':3.25 * 2.8 * 1.1,
        '-Допустимая масса техники (тонн)':0.2,
        '-Допустимая стоимость техники ($)':100000,


        '--Потребление энергии (кВт)':30,
        '--Запас энергии (МДж)':300,
        }

metadict_detail['Платформа многоцелевого истребителя'] = {
        'Конструкция истребителя':1,
        'Радиолокатор истребителя':1,
        'Лазерная система активной защиты':1,
        '|-Производство многоцелевых истребителей (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':14.1 * 7.15 * 4.71,
        '-Допустимая масса техники (тонн)':5,
        '-Допустимая стоимость техники ($)':10000000,
        }

metadict_detail['Платформа транспортного экранолёта'] = {
        'Конструкция транспортного экранолёта':1,
        'Радиолокатор транспортного экранолёта':1,
        'Лазерная система активной защиты':1,
        '|-Производство тяжёлых экранолётов (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':62 * 102 * 20.4,
        '-Допустимая масса техники (тонн)':360,
        '-Допустимая стоимость техники ($)':600000000,
        }

metadict_detail['Платформа тяжёлого планёра'] = {
        # https://en.wikipedia.org/wiki/General_Aircraft_Hamilcar
        # https://ru.wikipedia.org/wiki/Ил-32
        'Конструкция тяжёлого планёра':1,
        '|-Производство тяжёлых планёров (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':25 * 36 * 6,
        '-Допустимая масса техники (тонн)':6.6,
        '-Допустимая стоимость техники ($)':200000,
        }

metadict_detail['Платформа лёгкого планёра'] = {
        # Тип конструкции -- парасоль (крыло расположено над фюзеляжем).
        'Конструкция лёгкого планёра':1,
        '|-Производство лёгких планёров (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':9 * 12 * 0.5,
        '-Допустимая масса техники (тонн)':0.06,
        '-Допустимая стоимость техники ($)':10000,
        }

#----
# Стандартизованные платформы:

metadict_detail['Платформа ОБТ'] = {
        # https://ru.wikipedia.org/wiki/Т-64
        'Шасси ОБТ':1,
        'Корпус ОБТ':1,
        'Электрооборудование и средства связи ОБТ':1,
        '|-Производство основных боевых танков (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':9.2 * 6.6 * 3.4,
        '-Допустимая масса техники (тонн)':60,
        '-Допустимая стоимость техники ($)':6000000,
        }

metadict_detail['Платформа БТР'] = {
        'Шасси БТР':1,
        'Корпус БТР':1,
        'Электрооборудование и средства связи БТР':1,
        '|-Производство бронетранспортёров (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':7.6 * 2.8 * 2.4,
        '-Допустимая масса техники (тонн)':10,
        '-Допустимая стоимость техники ($)':1000000,
        }

metadict_detail['Платформа БМД'] = {
        # https://ru.wikipedia.org/wiki/Wiesel
        'Шасси БМД':1,
        'Корпус БМД':1,
        'Электрооборудование и средства связи БМД':1,
        '|-Производство боевых машин десанта (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':3.6 * 1.82 * 1.85,
        '-Допустимая масса техники (тонн)':3,
        '-Допустимая стоимость техники ($)':1000000,
        }

metadict_detail['Платформа БМП'] = {
        # http://armoredgun.org/brm001/germ_9.html
        # http://btvt.narod.ru/4/bmp_marder.htm
        'Шасси БМП':1,
        'Корпус БМП':1,
        'Электрооборудование и средства связи БМП':1,
        '|-Производство боевых машин пехоты (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':6.8 * 3.24 * 3,
        '-Допустимая масса техники (тонн)':30,
        '-Допустимая стоимость техники ($)':3000000,
        }

metadict_detail['Платформа тяжёлого гусеничного тягача'] = {
        # Кабина должна быть хорошо бронирована, как минимум на уровне БМП:
        # https://ru.wikipedia.org/wiki/АТ-Т
        # http://www.bmz.ru/allway/mtt.htm
        'Шасси ОБТ':1,
        'Кабина тяжёлого тягача':1,
        '|-Производство тяжёлых гусеничных тягачей (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':8.7 * 3.3 * 2.7,
        '-Допустимая масса техники (тонн)':20,
        '-Допустимая стоимость техники ($)':1000000,
        }

metadict_detail['Платформа тяжёлого седельного тягача'] = {
        # https://ru.wikipedia.org/wiki/МАЗ-7310
        'Шасси тяжёлого седельного тягача':1,
        'Кабина тяжёлого тягача':1,
        '|-Производство тяжёлых седельных тягачей (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':9.1 * 2.9 * 3.1,
        '-Допустимая масса техники (тонн)':30,
        '-Допустимая стоимость техники ($)':1000000,
        }

metadict_detail['Платформа гусеничного трактора'] = {
        # https://ru.wikipedia.org/wiki/ДТ-75
        'Шасси гусеничного трактора':1,
        'Кабина гусеничного трактора':1,
        '|-Проект гусеничного трактора (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':3.5 * 1.9 * 2.7,
        '-Допустимая масса техники (тонн)':6,
        '-Допустимая стоимость техники ($)':80000,
        }

metadict_detail['Платформа колёсного трактора'] = {
        # https://ru.wikipedia.org/wiki/МТЗ-80
        'Шасси колёсного трактора':1,
        'Кабина колёсного трактора':1,
        '|-Производство колёсных тракторов (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':3.8 * 1.9 * 2.5,
        '-Допустимая масса техники (тонн)':3,
        '-Допустимая стоимость техники ($)':60000,
        }

metadict_detail['Платформа военного грузовика'] = {
        # https://ru.wikipedia.org/wiki/Урал-4320
        'Шасси военного грузовика':1,
        'Кабина военного грузовика':1,
        '|-Производство военных грузовиков (выпущено штук)':1,
        '-Допустимые габариты техники (кубометров)':7.4 * 2.5 * 3.0,
        '-Допустимая масса техники (тонн)':8,
        '-Допустимая стоимость техники ($)':100000,
        }

#----
# Авиационное оборудование:

metadict_detail['Конструкция истребителя'] = {
        'Планер истребителя':1,
        'Топливная система истребителя':1,
        'Турбореактивный двигатель истребителя':1,
        'Электрооборудование и средства связи истребителя':1,
        }

metadict_detail['Конструкция транспортного экранолёта'] = {
        'Планер транспортного экранолёта':1,
        'Ядерный реактор транспортного экранолёта':1,
        'Ядерный воздушно-реактивный двигатель':1,
        'Электрооборудование и средства связи транспортного экранолёта':1,
        }

metadict_detail['Планер истребителя'] = {
        'Гермокабина истребителя':1,
        'Внутренние системы истребителя':1,
        'Фюзеляж истребителя':1,
        'Крыло истребителя':1,
        'Хвостовой стабилизатор истребителя':1,
        'Шасси истребителя':1,
        }

metadict_detail['Топливная система истребителя'] = {
        'Топливный бак истребителя':12,
        '-Место под жидкое топливо (литры)':2880,
        }

metadict_detail['Турбореактивный двигатель истребителя'] = {
        '|-Производство турбореактивных двигателей (выпущено штук)':1,
        '--Потребление энергии (кВт)':20000,
        }

metadict_detail['Ядерный реактор транспортного экранолёта'] = {
        '|-Производство авиационных ядерных реакторов (выпущено штук)':1,
        '--Производство энергии (кВт)':100000,
        }

metadict_detail['Ядерный воздушно-реактивный двигатель'] = {
        '|-Производство воздушно-реактивных двигателей (выпущено штук)':1,
        '--Потребление энергии (кВт)':100000,
        }

metadict_detail['Грузовая кабина транспортного экранолёта'] = {
        # https://ru.wikipedia.org/wiki/Ил-76
        # Коэффициент полноты 0.2, полезный объём 0.3 (оценочно):
        '-Объём груза (кубометров)':(62.1 * 102 * 20.4) * 0.2 * 0.3,
        }

metadict_detail['Грузовая кабина тяжёлого планёра'] = {
        '-Объём груза (кубометров)':11 * 3 * 3,
        }

metadict_detail['Грузовая кабина лёгкого планёра'] = {
        '-Объём груза (кубометров)':3.14159265 * 0.25 ** 2 * 5,
        }
