#----
# Боевые модули, шасси, оборудование бронетехники:

metadict_detail['Шасси ОБТ'] = {
        'Ходовая часть ОБТ':1,
        'Трансмиссия ОБТ':1,
        'Двигатель ОБТ':1,
        }

metadict_detail['Шасси БМП'] = {
        'Ходовая часть БМП':1,
        'Трансмиссия БМП':1,
        'Двигатель БМП':1,
        }

metadict_detail['Шасси БМД'] = {
        'Ходовая часть БМД':1,
        'Трансмиссия БМД':1,
        'Двигатель БМД':1,
        }

metadict_detail['Шасси БТР'] = {
        'Ходовая часть БТР':1,
        'Трансмиссия БТР':1,
        'Двигатель военного грузовика':1,
        }

metadict_detail['Шасси военного грузовика'] = {
        'Ходовая часть военного грузовика':1,
        'Трансмиссия военного грузовика':1,
        'Двигатель военного грузовика':1,
        }

metadict_detail['Корпус ОБТ'] = {
        'Бронирование корпуса ОБТ':1,
        'Внутренние системы бронетехники':1,
        'Навесное оборудование бронетехники':1,
        '-Объём доступный (кубометров)':14,
        }

metadict_detail['Корпус БМП'] = {
        'Бронирование корпуса БМП':1,
        'Внутренние системы бронетехники':1,
        'Навесное оборудование бронетехники':1,
        '-Объём доступный (кубометров)':14,
        }

metadict_detail['Корпус БТР'] = {
        'Бронирование корпуса БТР':1,
        'Внутренние системы бронетехники':1,
        'Навесное оборудование бронетехники':1,
        '-Объём доступный (кубометров)':14,
        }

metadict_detail['Корпус военного грузовика'] = {
        'Кабина военного грузовика':1,
        'Платформа военного грузовика':1,
        }

metadict_detail['Боевой модуль ОБТ'] = {
        'Броневая башня ОБТ':1,
        'Система постановки аэрозольных завес':1,
        '120-мм гладкоствольная танковая пушка':1,
        'Туррель зенитного пулемёта':1,
        'Единый пулемёт танковый':1,
        }

metadict_detail['Боевой модуль БМП'] = {
        'Броневая башня БМП':1,
        'Система постановки аэрозольных завес':1,
        'Пусковая установка противотанковых ракет':1,
        '30-мм нарезная автоматическая пушка':1,
        'Единый пулемёт танковый':1,
        }

metadict_detail['Боевой модуль БТР'] = {
        'Броневая башня БТР':1,
        'Система постановки аэрозольных завес':1,
        'Станковый автоматический гранатомёт (возимый)':1,
        'Туррель крупнокалиберного пулемёта':1,
        }

metadict_detail['Электрооборудование и средства связи ОБТ'] = {
        'Приборы наблюдения и наведения ОБТ':1,
        'Информационно-управляющая система':1,
        'Танковая система управления огнём':1,
        'Танковое переговорное устройство':1,
        }

metadict_detail['Электрооборудование и средства связи БМП'] = {
        'Приборы наблюдения и наведения ОБТ':1,
        'Информационно-управляющая система':1,
        'Танковая система управления огнём':1,
        }

metadict_detail['Электрооборудование и средства связи БТР'] = {
        'Приборы наблюдения и наведения БТР':1,
        'Танковое переговорное устройство':1,
        'УКВ-радиостанция возимая':1,
        }

metadict_detail['Лазерная система активной защиты'] = {
        'Станция ближней разведки танковая':1,
        'Система перенаправления лазерного луча':1,
        'Электролазерная пушка танковая':1,
        }

#----
# Системы боевых машины, группировка по назначению:

metadict_detail['Внутренние системы бронетехники'] = {
        'Танковая система защиты от оружия массового поражения':1,
        'Танковая система кондиционирования':1,
        'Танковая система пожаротушения':1,
        }

metadict_detail['Навесное оборудование бронетехники'] = {
        'Маскировочный комплект танка':1,
        'Танковая система защиты от напалма':1,
        'Оборудование подводного вождения танка':1,
        'Оборудование для самоокапывания':1,
        }

metadict_detail['Оборудование инженерной разведки'] = {
        'Авиагоризонт':1,
        'Речной широкозахватный миноискатель':1,
        'Индукционный миноискатель полупроводниковый':1,
        'Переносной радиоволновый миноискатель':1,
        'Инженерный разведывательный эхолокатор':1,
        'Прибор инженерной разведки (перископ)':1,
        'Артиллерийская буссоль':1,
        'Оптический дальномер':1,
        }

metadict_detail['Бронирование корпуса ОБТ'] = {
        '--Устойчивость к подавлению (в наступлении, РБ)':300,
        '--Устойчивость к подавлению (в окопах, РБ)':200,
        '--Устойчивость к подавлению (на марше, РБ)':150,
        'Комбинированная танковая броня (тонн)':30,
        'Динамическая защита корпуса ОБТ':1,
        }

metadict_detail['Бронирование корпуса БМП'] = {
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        'Комбинированная танковая броня (тонн)':12,
        'Динамическая защита корпуса ОБТ':1,
        }

metadict_detail['Бронирование корпуса БТР'] = {
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        'Керамическая броня боевых машин (квадратные дециметры)':4000,
        }

metadict_detail['Кабина военного грузовика'] = {
        'Броневая сталь (килограмм)':1000,
        '-Объём доступный (кубометров)':4,
        }

metadict_detail['Платформа военного грузовика'] = {
        'Броневая сталь (килограмм)':1000,
        }

metadict_detail['Динамическая защита корпуса ОБТ'] = {
        'Секция динамической защиты':18,
        }

metadict_detail['Танковая система защиты от напалма'] = {
        # Должна быть частью противопожарной системы.
        }

metadict_detail['Танковая система защиты от оружия массового поражения'] = {
        'Сборка бронетехники (нормо-часов)':20,
        'Танковое электромеханическое оборудование (килограмм)':30,
        'Танковый прибор радиационной и химической разведки':1,
        'Танковая фильтровентиляционная установка':1,
        }

metadict_detail['Танковая система пожаротушения'] = {
        'Сборка бронетехники (нормо-часов)':10,
        'Танковое электромеханическое оборудование (килограмм)':2,
        'Танковые гидроприводы (метры)':20,
        'Баллон огнегасящей смеси':4,
        'Термодатчики':7,
        }

metadict_detail['Ходовая часть ОБТ'] = {
        'Гусеничная лента ОБТ':2,
        'Комплект катков ОБТ':1,
        'Подвеска ОБТ':1,
        }

metadict_detail['Ходовая часть БМП'] = {
        'Танковые детали (килограмм)':3000,
        'Танковые механические устройства (килограмм)':300,
        }

metadict_detail['Ходовая часть БМД'] = {
        'Водомётный движитель БТР':2,
        'Танковые детали (килограмм)':1700,
        'Танковые механические устройства (килограмм)':300,
        }

metadict_detail['Ходовая часть БТР'] = {
        'Водомётный движитель БТР':2,
        'Комплект колёс БТР':1,
        'Подвеска БТР':1,
        }

metadict_detail['Ходовая часть военного грузовика'] = {
        'Комплект колёс военного грузовика':1,
        'Подвеска военного грузовика':1,
        }

metadict_detail['Трансмиссия ОБТ'] = {
        'Бортовой фрикцион ОБТ':2,
        'Бортовая коробка передач ОБТ':2,
        'Бак машинного масла (20 литров)':2,
        'Входной редуктор ОБТ':2,
        'Главный фрикцион ОБТ':1,
        'Карданный вал ОБТ':1,
        '--Потребление энергии (кВт)':800,
        }

metadict_detail['Трансмиссия БМП'] = {
        'Танковые механические устройства (килограмм)':1000,
        '--Потребление энергии (кВт)':400,
        }

metadict_detail['Трансмиссия БМД'] = {
        'Танковые механические устройства (килограмм)':500,
        '--Потребление энергии (кВт)':200,
        }

metadict_detail['Трансмиссия БТР'] = {
        'Танковые механические устройства (килограмм)':500,
        '--Потребление энергии (кВт)':200,
        }

metadict_detail['Трансмиссия военного грузовика'] = {
        'Танковые механические устройства (килограмм)':500,
        '--Потребление энергии (кВт)':200,
        }

metadict_detail['Двигатель ОБТ'] = {
        'Вариатор тяжёлого маховика':1,
        'Монокристаллический маховик (килограмм)':4000,
        }

metadict_detail['Двигатель БМП'] = {
        'Вариатор среднего маховика':1,
        'Монокристаллический маховик (килограмм)':2000,
        }

metadict_detail['Двигатель БМД'] = {
        'Вариатор среднего маховика':1,
        'Монокристаллический маховик (килограмм)':1000,
        }

metadict_detail['Двигатель военного грузовика'] = {
        'Вариатор лёгкого маховика':1,
        'Монокристаллический маховик (килограмм)':1000,
        }

metadict_detail['Вариатор тяжёлого маховика'] = {
        '-Объём используемый (кубометров)':0.5,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.5,
        'wpn_cost':30000,
        }

metadict_detail['Вариатор среднего маховика'] = {
        '-Объём используемый (кубометров)':0.3,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.3,
        'wpn_cost':20000,
        }

metadict_detail['Вариатор лёгкого маховика'] = {
        '-Объём используемый (кубометров)':0.15,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.2,
        'wpn_cost':15000,
        }

metadict_detail['Броневая башня ОБТ'] = {
        'Бронирование башни ОБТ':1,
        'Механизм заряжания танковой пушки':1,
        'Система стабилизации танковой пушки':1,
        'Поворотный механизм башни':1,
        '-Объём доступный (кубометров)':2,
        }

metadict_detail['Броневая башня БМП'] = {
        'Бронирование башни БМП':1,
        'Система стабилизации танковой пушки':1,
        'Поворотный механизм башни':1,
        '-Объём доступный (кубометров)':2,
        }

metadict_detail['Броневая башня БТР'] = {
        'Бронирование башни БТР':1,
        '-Объём доступный (кубометров)':0.5,
        }

metadict_detail['Бронирование башни ОБТ'] = {
        'Комбинированная танковая броня (тонн)':4,
        'Динамическая защита башни ОБТ':1,
        }

metadict_detail['Бронирование башни БМП'] = {
        'Комбинированная танковая броня (тонн)':2,
        'Динамическая защита башни ОБТ':1,
        }

metadict_detail['Бронирование башни БТР'] = {
        'Керамическая броня боевых машин (квадратные дециметры)':150,
        }

metadict_detail['Динамическая защита башни ОБТ'] = {
        'Секция динамической защиты':8,
        }

metadict_detail['Система стабилизации танковой пушки'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.5,
        'wpn_cost':200000,
        }

metadict_detail['Механизм заряжания танковой пушки'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.5,
        'wpn_cost':100000,
        }

metadict_detail['Поворотный механизм башни'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.5,
        'wpn_cost':50000,
        }

metadict_detail['Танковая система активной защиты'] = {
        'Комплекс оптико-электронного подавления':1,
        'Система постановки аэрозольных завес':1,
        }

metadict_detail['Туррель зенитного пулемёта'] = {
        'Зенитный пулемёт танковый':1,
        'Приводы управления туррелью':1,
        }

metadict_detail['Туррель крупнокалиберного пулемёта'] = {
        'Крупнокалиберный пулемёт танковый':1,
        'Единый пулемёт танковый':1,
        'Приводы управления туррелью':1,
        }

metadict_detail['Приводы управления туррелью'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.05,
        'wpn_cost':5000,
        }

metadict_detail['Комплекс оптико-электронного подавления'] = {
        'Датчики обнаружения лазерного излучения':4,
        'Инфракрасные прожекторы':2,
        }

metadict_detail['Система постановки аэрозольных завес'] = {
        '90-мм мортира системы аэрозольных завес':12,
        }

metadict_detail['Датчики обнаружения лазерного излучения'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.001,
        'wpn_cost':1000,
        }

metadict_detail['Инфракрасные прожекторы'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.05,
        'wpn_cost':3000,
        }

metadict_detail['Система перенаправления лазерного луча'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.05,
        'wpn_cost':50000,
        }

metadict_detail['Информационно-управляющая система'] = {
        'Оптические компьютеры (терминалы)':1,
        'Танковая навигационная аппаратура':1,
        'УКВ-радиостанция возимая':1,
        'КВ-радиостанция возимая':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.03,
        'wpn_cost':500000,
        }

metadict_detail['Приборы наблюдения и наведения ОБТ'] = {
        'Прицел-дальномер прибор наведения':1,
        'Прицельно-наблюдательный комплекс командира':1,
        'Приборы наблюдения механика-водителя':1,
        }

metadict_detail['Приборы наблюдения и наведения БТР'] = {
        'Перископический прицел':2,
        'Перископический прибор наблюдения':6,
        'Активно-пассивный прибор ночного видения':2,
        }

metadict_detail['Прицел-дальномер прибор наведения'] = {
        'Перископический прицел':1,
        'Танковый лазерный дальномер':1,
        'Тепловизионный перископический ночной прицел':1,
        }

metadict_detail['Перископический прицел'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.01,
        'wpn_cost':5000,
        }

metadict_detail['Танковый лазерный дальномер'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.01,
        '--Потребление энергии (кВт)':0.1,
        'wpn_cost':20000,
        }

metadict_detail['Тепловизионный перископический ночной прицел'] = {
        'Охлаждаемая тепловизионная матрица':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.06,
        '--Потребление энергии (кВт)':1,
        'wpn_cost':100000,
        }

metadict_detail['Прицельно-наблюдательный комплекс командира'] = {
        'Перископический прицел':1,
        'Танковый лазерный дальномер':1,
        'Тепловизионный перископический ночной прицел':1,
        }

metadict_detail['Приборы наблюдения механика-водителя'] = {
        'Перископический прибор наблюдения':3,
        'Активно-пассивный прибор ночного видения':1,
        }

metadict_detail['Перископический прибор наблюдения'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.01,
        'wpn_cost':500,
        }

metadict_detail['Активно-пассивный прибор ночного видения'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.002,
        'wpn_cost':5000,
        }

metadict_detail['Танковая система управления огнём'] = {
        'Цифровой баллистический вычислитель':1,
        'Телевизионная система кругового обзора':1,
        'Комплект автоматических датчиков условий стрельбы':1,
        }

metadict_detail['Цифровой баллистический вычислитель'] = {
        'Оптические компьютеры (терминалы)':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.02,
        'wpn_cost':500000,
        }

metadict_detail['Телевизионная система кругового обзора'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.05,
        'wpn_cost':50000,
        }

metadict_detail['Комплект автоматических датчиков условий стрельбы'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.02,
        'wpn_cost':20000,
        }

metadict_detail['Танковая навигационная аппаратура'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.01,
        'wpn_cost':10000,
        }

metadict_detail['Авиагоризонт'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.01,
        'wpn_cost':10000,
        }

metadict_detail['Речной широкозахватный миноискатель'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.05,
        'wpn_cost':20000,
        }

metadict_detail['Танковое переговорное устройство'] = {
        'Ларингофон':4,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.03,
        'wpn_cost':1000,
        }

metadict_detail['Маскировочный комплект танка'] = {
        'Маскировочная ткань (квадратные дециметры)':4000,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.5,
        'wpn_cost':20000,
        }

metadict_detail['Танковая система кондиционирования'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.03,
        '--Потребление энергии (кВт)':3,
        'wpn_cost':30000,
        }

metadict_detail['Станция ближней разведки танковая'] = {
        'Оптические компьютеры (терминалы)':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.2,
        '--Потребление энергии (кВт)':1,
        'wpn_cost':500000,
        }
