#----
# Элементы СИБЗ боевой экипировки:

metadict_detail['Шлем второго класса защиты'] = {
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':15,
        'Конвекционно-амортизационный подпор (квадратные дециметры)':5,
        '|-Производство шлемов второго класса защиты (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0015,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

metadict_detail['Баллистические очки'] = {
        '|-Производство баллистических очков (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0003,
        '-Допустимая стоимость элементов экипировки ($)':50,
        }

metadict_detail['Противоосколочный комбинезон'] = {
        # Площадь тела средней пони -- 1.71 кв. метра
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':100,
        '|-Производство противоосколочных комбинезонов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.003,
        '-Допустимая стоимость элементов экипировки ($)':600,
        }

metadict_detail['Противоосколочный воротник'] = {
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':20,
        '|-Производство противоосколочных воротников (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0006,
        '-Допустимая стоимость элементов экипировки ($)':100,
        }

metadict_detail['Резиновые наколенники'] = {
        '|-Производство резиновых наколенников (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0001,
        '-Допустимая стоимость элементов экипировки ($)':30,
        }

metadict_detail['Прорезиненные накопытники'] = {
        '|-Производство прорезиненых накопытников (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0003,
        '-Допустимая стоимость элементов экипировки ($)':50,
        }

metadict_detail['Боковые 100x100-мм керамические бронепластины'] = {
        'Бронекерамика шестого класса защиты (квадратные дециметры)':1,
        'Конвекционно-амортизационный подпор (квадратные дециметры)':1,
        '|-Производство боковых 100x100-мм керамических бронепластин (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':50,
        }

metadict_detail['Нагрудная 200x200-мм керамическая бронепластина'] = {
        'Бронекерамика шестого класса защиты (квадратные дециметры)':4,
        'Конвекционно-амортизационный подпор (квадратные дециметры)':4,
        '|-Производство нагрудных 200x200-мм керамических бронепластин (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.002,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

#----
# Элементы СИБЗ силовой брони:

metadict_detail['Бронекостюм шестого класса защиты'] = {
        # На самом деле наружное бронирование экзоскелета:
        # Площадь тела средней пони -- 1.71 кв. метра
        'Бронекерамика шестого класса защиты (квадратные дециметры)':60,
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':60,
        '|-Производство бронекостюмов шестого класса защиты (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.025,
        '-Допустимая стоимость элементов экипировки ($)':2000,
        }

metadict_detail['Шлем шестого класса защиты'] = {
        # Жёстко закрпелённый шлем.
        # Ширина головы пони -- 36 см (от скулы до скулы); Коэффициент полноты 0.6
        # Площадь поверхности шлема: 0.47 кв. метра
        'Бронекерамика шестого класса защиты (квадратные дециметры)':30,
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':20,
        '|-Производство шлемов шестого класса защиты (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.013,
        '-Допустимая стоимость элементов экипировки ($)':1000,
        }

metadict_detail['Амортизирующий комбинезон'] = {
        'Конвекционно-амортизационный подпор (квадратные дециметры)':100,
        '|-Производство амортизирующих комбинезонов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.010,
        '-Допустимая стоимость элементов экипировки ($)':2500,
        }

metadict_detail['Противохимический комбинезон'] = {
        # Гермитичный комбинезон с противохимической пропиткой:
        '|-Производство противохимических комбинезонов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.003,
        '-Допустимая стоимость элементов экипировки ($)':3000,
        }

#----
# Системы силовой брони:

metadict_detail['Пехотная система управления огнём'] = {
        'Оптические компьютеры (терминалы)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.002,
        '-Допустимая стоимость элементов экипировки ($)':50000,
        }

metadict_detail['Коллиматорная оптическая проекционная система'] = {
        'Оптические компьютеры (терминалы)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.002,
        '-Допустимая стоимость элементов экипировки ($)':5000,
        }

metadict_detail['Система кондиционирования'] = {
        '--Потребление энергии (кВт)':0.2,
        '-Допустимая масса элементов экипировки (тонн)':0.001,
        '-Допустимая стоимость элементов экипировки ($)':5000,
        }

metadict_detail['Система фильтрации воздуха'] = {
        '--Потребление энергии (кВт)':0.2,
        '-Допустимая масса элементов экипировки (тонн)':0.001,
        '-Допустимая стоимость элементов экипировки ($)':5000,
        }

#----
# Элементы экзоскелета силовой брони:

metadict_detail['Каркас экзоскелета'] = {
        '-Допустимая масса элементов экипировки (тонн)':0.01,
        '-Допустимая стоимость элементов экипировки ($)':2000,
        }

metadict_detail['Лёгкий электрогенератор'] = {
        '--Потребление энергии (кВт)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':1000,
        }

metadict_detail['Вариатор переносного маховика'] = {
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':5000,
        }

metadict_detail['Насос гидравлической системы'] = {
        # НШ 6-3, мощность 7 кВт, масса 1.5 кг, подача 16.2 л/мин (0.00027 кубометра в секунду)
        # Масляные насосы с потребляемой мощностью в 7 кВт и массой в 1.5 кг.
        # http://www.artr.ru/Gidravlik/Gidravlik_pumps/nsh/gear_sh_nsh_oil.htm
        '--Потребление энергии (кВт)':7,
        '-Допустимая масса элементов экипировки (тонн)':0.0015,
        '-Допустимая стоимость элементов экипировки ($)':1000,
        }

metadict_detail['Вентилятор системы охлаждения'] = {
        '--Потребление энергии (кВт)':0.5,
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

metadict_detail['Гидравлический распределитель'] = {
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':500,
        }

metadict_detail['Гидравлический привод'] = {
        # РВД Ду5 Тип II 0,34 кг/метр, рабочее давление 35 МПа
        # http://ladspb.ru/hydro_hose/gost_6286-73/
        # Допустимая мощность (Объёмный гидроприовод): 0.00027*35000000=9450 Ватт
        # Длина тела (от хвоста до груди) -- 45 см
        # Длина задних ног до сустава -- 35 см
        'Рукав высокого давления (метры)':2,
        '-Допустимая масса элементов экипировки (тонн)':0.0001,
        '-Допустимая стоимость элементов экипировки ($)':20,
        }

metadict_detail['Гидравлический цилиндр'] = {
        '-Допустимая масса элементов экипировки (тонн)':0.0002,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

metadict_detail['Силовой привод экзоскелета'] = {
        # Даёт мощность до 300 Ватт. 
        '-Допустимая масса элементов экипировки (тонн)':0.0002,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

metadict_detail['Миодатчик'] = {
        '-Допустимая масса элементов экипировки (тонн)':0.00002,
        '-Допустимая стоимость элементов экипировки ($)':1000,
        }

#----
# Средства связи и обработки данных:

metadict_detail['УКВ-радиостанция малогабаритная'] = {
        # https://ru.wikipedia.org/wiki/Р-147
        # Дальность связи с однотипной станцией — до 1 км.
        'Ларингофон':1,
        'Наушники радиостанции':1,
        'Компоненты малогабаритной радиостанции':1,
        '--Потребление энергии (кВт)':0.001,
        '|-Производство малогабаритных УКВ-радиостанций (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.001,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

metadict_detail['Носимый терминал с дисплеем'] = {
        'Оптические компьютеры (терминалы)':1,
        '--Потребление энергии (кВт)':0.02,
        '|-Производство носимых терминалов с дисплеем (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.002,
        '-Допустимая стоимость элементов экипировки ($)':10000,
        }

metadict_detail['Носимый терминал упрощённый'] = {
        'Оптические компьютеры (терминалы)':1,
        '--Потребление энергии (кВт)':0.02,
        '|-Производство носимых терминалов упрощённых (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.002,
        '-Допустимая стоимость элементов экипировки ($)':5000,
        }

#----
# Электрооборудование, приборы:

metadict_detail['Наушная система управления боевой экипировкой'] = {
        # Система тросов под шлемом, закреплённая на многострадальных понячьих ушах.
        '-Допустимая масса элементов экипировки (тонн)':0.0003,
        '-Допустимая стоимость элементов экипировки ($)':500,
        }

metadict_detail['Монокуляр ночного видения'] = {
        # https://ru.wikipedia.org/wiki/НСПУ_(прицел)
        # Инфракрасный прибор ночного видения (бесподсветный)
        # Дальность видимости: 400 метров -- пехотинец; 600 метров -- танк.
        '--Потребление энергии (кВт)':0.001,
        '|-Производство монокуляров ночного видения (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0022,
        '-Допустимая стоимость элементов экипировки ($)':3000,
        }

metadict_detail['Бинокль переменной кратности'] = {
        '|-Производство биноклей переменной кратности (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.001,
        '-Допустимая стоимость элементов экипировки ($)':800,
        }

metadict_detail['Активные наушники'] = {
        '--Потребление энергии (кВт)':0.001,
        '|-Производство активных наушников (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':1000,
        }

metadict_detail['Портативная телекамера'] = {
        # Очень активно используются единорогами-гренадерами.
        '|-Производство портативных телекамер (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0003,
        '-Допустимая стоимость элементов экипировки ($)':500,
        }

metadict_detail['Телевизионный прицел'] = {
        '|-Производство телевизионных прицелов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0006,
        '-Допустимая стоимость элементов экипировки ($)':600,
        }

metadict_detail['Лидар'] = {
        # Лазеры в Эквестрии дёшевы и очень распространены (нужно пересчитать стоимость):
        '--Потребление энергии (кВт)':0.1,
        '|-Производство лидаров (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.001,
        '-Допустимая стоимость элементов экипировки ($)':10000,
        }

metadict_detail['Универсальный источник питания'] = {
        # Источник механической/электрической энергии, 5 МДж -- 0.5 кг маховик.
        'Компоненты универсального источника питания':1,
        '|-Производство универсальных источников питания (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.001,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

#----
# Элементы СИЗ повседневной экипировки:

metadict_detail['Общевойсковой защитный комплект'] = {
        '|-Производство общевойсковых защитных комплектов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.003,
        '-Допустимая стоимость элементов экипировки ($)':50,
        }

metadict_detail['Фильтрующий противогаз'] = {
        '|-Производство фильтрующих противогазов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.001,
        '-Допустимая стоимость элементов экипировки ($)':50,
        }

#----
# Униформа, одежда:

metadict_detail['Комплект парадной униформы'] = {
        '|-Производство комплектов парадной униформы (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0015,
        '-Допустимая стоимость элементов экипировки ($)':300,
        }

metadict_detail['Комплект летней повседневной униформы'] = {
        '|-Производство комплектов летней повседневной униформы (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0015,
        '-Допустимая стоимость элементов экипировки ($)':300,
        }

metadict_detail['Комплект зимней повседневной униформы'] = {
        '|-Производство комплектов зимней повседневной униформы (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.003,
        '-Допустимая стоимость элементов экипировки ($)':500,
        }

#----
# Сумки, разгрузки, грузовые модули:

metadict_detail['Наспинное крепление для оружия'] = {
        '|-Производство наспинных креплений для оружия (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0004,
        '-Допустимая стоимость элементов экипировки ($)':100,
        }

metadict_detail['Разгрузочный жилет'] = {
        '|-Производство разгрузочных жилетов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0008,
        '-Допустимая стоимость элементов экипировки ($)':100,
        }

metadict_detail['5-литровые патронные сумки'] = {
        '|-Производство 5-литровых патронных сумок (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':50,
        }

metadict_detail['60-литровый рюкзак'] = {
        '|-Производство 60-литровых рюкзаков (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0015,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

metadict_detail['10-литровые перемётные сумки'] = {
        '|-Производство 10-литровых перемётных сумок (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0008,
        '-Допустимая стоимость элементов экипировки ($)':40,
        }

#----
# Снаряжение:

metadict_detail['Пассивные наушники'] = {
        '|-Производство пассивных наушников (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':50,
        }

metadict_detail['Индивидуальный водяной фильтр'] = {
        '|-Производство индивидуальных водяных фильтров (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0002,
        '-Допустимая стоимость элементов экипировки ($)':30,
        }

metadict_detail['Маскировочный комплект пехотинца'] = {
        # Весьма дорогая ткань с маскировкой в радио- и тепловом диапазоне.
        'Маскировочная ткань (квадратные дециметры)':400,
        '|-Производство маскировочных комплектов пехотинца (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0002,
        '-Допустимая стоимость элементов экипировки ($)':500,
        }

metadict_detail['Стробоскопический фонарь'] = {
        '|-Производство стробоскопических фонарей (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0007,
        '-Допустимая стоимость элементов экипировки ($)':30,
        }

metadict_detail['Бинокль'] = {
        '|-Производство биноклей (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0002,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

metadict_detail['Компас'] = {
        '|-Производство компасов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0002,
        '-Допустимая стоимость элементов экипировки ($)':30,
        }

metadict_detail['Часы'] = {
        '|-Производство часов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0001,
        '-Допустимая стоимость элементов экипировки ($)':40,
        }

metadict_detail['Упаковка влажных салфеток'] = {
        '|-Производство упаковок влажных салфеток (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0003,
        '-Допустимая стоимость элементов экипировки ($)':1,
        }

metadict_detail['Малая пехотная лопатка'] = {
        '|-Производство малых пехотных лопаток (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0006,
        '-Допустимая стоимость элементов экипировки ($)':30,
        }

metadict_detail['Комплект выживания'] = {
        # Нитки, спички, перочинный нож, таблетки для обеззараживания воды:
        '|-Производство комплектов выживания (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':40,
        }

metadict_detail['Армейский котелок'] = {
        '|-Производство армейских котелков (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.00064,
        '-Допустимая стоимость элементов экипировки ($)':30,
        }

metadict_detail['Питьевая система'] = {
        # Гидратор на два литра воды.
        '|-Производство питьевых систем (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0002,
        '-Допустимая стоимость элементов экипировки ($)':30,
        }

metadict_detail['Многофункциональный нож'] = {
        # Швейцарский нож в понячьем стиле.
        '|-Производство многофункциональных ножей (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0003,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

metadict_detail['Палатка одноместная'] = {
        '|-Производство одноместных палаток (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0015,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

metadict_detail['Непромокаемый плащ'] = {
        # Пластиковый пончо с капюшоном.
        '|-Производство непромокаемых плащей (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':50,
        }

metadict_detail['Спальник'] = {
        # Спальный мешок.
        '|-Производство спальников (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0015,
        '-Допустимая стоимость элементов экипировки ($)':100,
        }

metadict_detail['Теплоизолирующий коврик'] = {
        '|-Производство теплоизолирующих ковриков (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0005,
        '-Допустимая стоимость элементов экипировки ($)':20,
        }

#----
# Лекарственные средства, медикаменты:

metadict_detail['Управляемый инжектор лекарственных средств'] = {
        # Бедные безрукие пони не могут использовать шприц без инжектора (коробочки с кнопкой).
        '|-Производство управляемых инжекторов лекарственных средств (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0003,
        '-Допустимая стоимость элементов экипировки ($)':200,
        }

metadict_detail['Шприц-тюбик психостимулирющего средства'] = {
        '|-Производство шприц-тюбиков психостимулирющего средства (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.00001,
        '-Допустимая стоимость элементов экипировки ($)':10,
        }

metadict_detail['Шприц-тюбик антирадиационного средства'] = {
        # Фолачевский антирадин, не лечит от рака, но восстанавливает повреждённые клетки.
        'Структурный гель (граммы)':10,
        '|-Производство шприц-тюбиков антирадиационного средства (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0001,
        '-Допустимая стоимость элементов экипировки ($)':30,
        }

metadict_detail['Шприц-тюбик заживляющего средства'] = {
        # Фолачевский стимпак, восстанавливает цельность тела, если после ранения прошло меньше часа.
        'Структурный гель (граммы)':50,
        '|-Производство шприц-тюбиков заживляющего средства (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0001,
        '-Допустимая стоимость элементов экипировки ($)':50,
        }

metadict_detail['Шприц-тюбик обезболивающего средства'] = {
        # https://ru.wikipedia.org/wiki/Трамадол
        # https://ru.wikipedia.org/wiki/Оксикодон
        '|-Производство шприц-тюбиков обезболивающего средства (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.00001,
        '-Допустимая стоимость элементов экипировки ($)':1,
        }

metadict_detail['Шприц-тюбик антидота ФОВ'] = {
        # https://ru.wikipedia.org/wiki/Афин
        '|-Производство шприц-тюбиков антидота ФОВ (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.00001,
        '-Допустимая стоимость элементов экипировки ($)':1,
        }

metadict_detail['Таблетки радиозащитного средства'] = {
        '|-Производство таблеток радиозащитного средства (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.00001,
        '-Допустимая стоимость элементов экипировки ($)':1,
        }

metadict_detail['Таблетки противорвотного средства'] = {
        '|-Производство таблеток противорвотного средства (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.00001,
        '-Допустимая стоимость элементов экипировки ($)':1,
        }

metadict_detail['Таблетки антибактериального средства'] = {
        '|-Производство таблеток антибактериального средства (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.00001,
        '-Допустимая стоимость элементов экипировки ($)':1,
        }

metadict_detail['Таблетки психостимулирющего средства'] = {
        # https://ru.wikipedia.org/wiki/Амфетамин
        '|-Производство таблеток психостимулирющего средства (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.00001,
        '-Допустимая стоимость элементов экипировки ($)':1,
        }

metadict_detail['Индивидуальный противохимический пакет'] = {
        '|-Производство индивидуальных противохимических пакетов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.000035,
        '-Допустимая стоимость элементов экипировки ($)':1,
        }

metadict_detail['Индивидуальный перевязочный пакет'] = {
        '|-Производство индивидуальных перевязочных пакетов (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.00005,
        '-Допустимая стоимость элементов экипировки ($)':3,
        }

metadict_detail['Жгут кровоостанавливающий'] = {
        # Вернее жгут-турникет (поням сложно использовать обычные резиновые жгуты)
        '|-Производство жгутов кровоостанавливающих (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0001,
        '-Допустимая стоимость элементов экипировки ($)':20,
        }

metadict_detail['Назофарингеальная трубка'] = {
        # https://secretsquirrel.com.ua/snaryazhenie/nazofaringealnyj-vozduhovod/
        '|-Производство назофарингеальных трубок (выпущено штук)':1,
        '-Допустимая масса элементов экипировки (тонн)':0.0001,
        '-Допустимая стоимость элементов экипировки ($)':20,
        }
