# ----
# Подавляем вывод:

metadict_model['-КУНГи, прицепы, расходники, инструменты (тонн)'] = {
        '-Допустимая масса грузов (тонн)':1,
        }

# ----
# Подавляем вывод:

metadict_model['---Расовый состав (единороги)'] = {
        }

metadict_model['---Расовый состав (пегасы)'] = {
        }

metadict_model['---Стоимость отряда (расчётная)'] = {
        }

metadict_model['--Боекомплект (тонн)'] = {
        }

metadict_model['--Запас условного топлива (тонн)'] = {
        }

metadict_model['--Запас энергии (тонн дизеля)'] = {
        }

metadict_model['--Запас энергии (тонно-маховики)'] = {
        }

metadict_model['--Производство энергии (тонно-маховиков/сутки)'] = {
        }

metadict_model['--Боеприпасов (тонн)'] = {
        }

metadict_model['--Длина колонны на марше (километров)'] = {
        }

metadict_model['--Устойчивость к подавлению (в наступлении, РБ)'] = {
        }

metadict_model['--Устойчивость к подавлению (в окопах, РБ)'] = {
        }

metadict_model['--Устойчивость к подавлению (на марше, РБ)'] = {
        }

metadict_model['-Внутренний объём (кубометров)'] = {
        }

metadict_model['-Допустимая масса деталей (килограмм)'] = {
        }

metadict_model['-Допустимая масса компонентов (килограмм)'] = {
        }

metadict_model['-Допустимая масса элементов экипировки (тонн)'] = {
        }

metadict_model['-Допустимая стоимость деталей ($)'] = {
        }

metadict_model['-Допустимая стоимость компонентов'] = {
        }

metadict_model['-Допустимая стоимость элементов экипировки ($)'] = {
        }

metadict_model['-Допустимые габариты тары (кубометров)'] = {
        }

metadict_model['-Допустимые габариты техники (кубометров)'] = {
        }

metadict_model['-Допустимый объём тары (кубометров)'] = {
        }

metadict_model['-Нагрузка командира отделения (часов/день)'] = {
        }

metadict_model['-Нагрузка командования взвода (часов/день)'] = {
        }

metadict_model['-Нагрузка командования роты (часов/день)'] = {
        }

metadict_model['-Нагрузка связистов (часов/день)'] = {
        }

metadict_model['-Нагрузка штаба батальона (часов/день)'] = {
        }

metadict_model['-Объём используемый (кубометров)'] = {
        }

metadict_model['-Потребление электроэнергии (мегаватт*час)'] = {
        }

metadict_model['-Производство электроэнергии (мегаватт*час)'] = {
        }

metadict_model['-Расход дизельного топлива (тонн/сутки)'] = {
        }

metadict_model['-Расход угля (тонн/сутки)'] = {
        }

metadict_model['-Расход питьевой воды (тонн/сутки)'] = {
        }

metadict_model['-Расход продовольствия (тонн/сутки)'] = {
        }

metadict_model['-Тротиловый эквивалент (тонн)'] = {
        }

metadict_model['--Трудовая стоимость (нормо-часов)'] = {
        }

# ----
# Подавляем вывод:

metadict_model['_-Лесозаготовительные работы (часов/смену)'] = {
        }

metadict_model['_-Работа тяжёлого грузовика снабжения (часов/смену)'] = {
        }

metadict_model['_-Работа плавающего самоходного копера (часов/смену)'] = {
        }

metadict_model['_-Работа автогрейдера (часов/смену)'] = {
        }

metadict_model['_-Работа автокрана (часов/смену)'] = {
        }

metadict_model['_-Работа быстроходной траншейной машины (часов/смену)'] = {
        }

metadict_model['_-Работа грузовика снабжения (часов/смену)'] = {
        }

metadict_model['_-Работа грузовика снабжения с прицепом (часов/смену)'] = {
        }

metadict_model['_-Работа группы автономных землеройных машин (часов/смену)'] = {
        }

metadict_model['_-Работа гусеничного бульдозера (часов/смену)'] = {
        }

metadict_model['_-Работа гусеничного путепрокладчика (часов/смену)'] = {
        }

metadict_model['_-Работа гусеничного самоходного парома (часов/смену)'] = {
        }

metadict_model['_-Работа гусеничного экскаватора (часов/смену)'] = {
        }

metadict_model['_-Работа дорожного катка (часов/смену)'] = {
        }

metadict_model['_-Работа инженерной машины разграждения (часов/смену)'] = {
        }

metadict_model['_-Работа колёсного бульдозера (часов/смену)'] = {
        }

metadict_model['_-Работа колёсного трелёвщика (часов/смену)'] = {
        }

metadict_model['_-Работа колёсного экскаватора (часов/смену)'] = {
        }

metadict_model['_-Работа полковой землеройной машины (часов/смену)'] = {
        }

metadict_model['_-Работа скрепера (часов/смену)'] = {
        }

metadict_model['_-Работа тяглового лёгкого планёра (часов/смену)'] = {
        }

metadict_model['_-Работа тяглового тяжёлого планёра (часов/смену)'] = {
        }

metadict_model['_-Работа тяжёлой котлованной машины (часов/смену)'] = {
        }

metadict_model['_-Ремонт и обслуживание машин/оружия (часов/смену)'] = {
        }

metadict_model['_-Столярные работы (часов/смену)'] = {
        }

metadict_model['_-Строительные работы минно-взрывные (часов/смену)'] = {
        }

metadict_model['_-Строительные работы минно-взрывные пегасные (часов/смену)'] = {
        }

metadict_model['_-Строительные работы немеханизированные (часов/смену)'] = {
        }

metadict_model['_-Строительные работы пегасные (часов/смену)'] = {
        }

metadict_model['_-Строительные работы понтонно-пегасные (часов/смену)'] = {
        }

metadict_model['_-Строительные работы понтонные (часов/смену)'] = {
        }

metadict_model['_-Управление батальонами (часов/смену)'] = {
        }

metadict_model['_-Управление взводами (часов/смену)'] = {
        }

metadict_model['_-Управление отделениями (часов/смену)'] = {
        }

metadict_model['_-Управление ротами (часов/смену)'] = {
        }

metadict_model['_-Эвакуация раненых (часов/смену)'] = {
        }

# ----
# Подавляем вывод:

metadict_model['|-Производство 10-литровых перемётных сумок (выпущено штук)'] = {
        }

metadict_model['|-Производство 120-квт дизельных двигателей (выпущено штук)'] = {
        }

metadict_model['|-Производство 200-квт газогенераторов (выпущено штук)'] = {
        }

metadict_model['|-Производство 200-квт дизель-электрических станций (выпущено штук)'] = {
        }

metadict_model['|-Производство 5-литровых патронных сумок (выпущено штук)'] = {
        }

metadict_model['|-Производство 60-квт электрогенераторов (выпущено штук)'] = {
        }

metadict_model['|-Производство 60-литровых рюкзаков (выпущено штук)'] = {
        }

metadict_model['|-Производство РЛС ближнего действия (выпущено штук)'] = {
        }

metadict_model['|-Производство РЛС малой дальности (выпущено штук)'] = {
        }

metadict_model['|-Производство РЛС наведения (выпущено штук)'] = {
        }

metadict_model['|-Производство РЛС обнаружения (выпущено штук)'] = {
        }

metadict_model['|-Производство РЛС средней дальности (выпущено штук)'] = {
        }

metadict_model['|-Производство автогрейдеров (выпущено штук)'] = {
        }

metadict_model['|-Производство автомастерских (выпущено штук)'] = {
        }

metadict_model['|-Производство автомобильных полевых кухонь (выпущено штук)'] = {
        }

metadict_model['|-Производство автомобильных фильтровальных станций (выпущено штук)'] = {
        }

metadict_model['|-Производство авторазливочных станций (выпущено штук)'] = {
        }

metadict_model['|-Производство активных наушников (выпущено штук)'] = {
        }

metadict_model['|-Производство амортизирующих комбинезонов (выпущено штук)'] = {
        }

metadict_model['|-Производство армейских котелков (выпущено штук)'] = {
        }

metadict_model['|-Производство баллистических очков (выпущено штук)'] = {
        }

metadict_model['|-Производство биноклей (выпущено штук)'] = {
        }

metadict_model['|-Производство биноклей переменной кратности (выпущено штук)'] = {
        }

metadict_model['|-Производство боевых разведывательных машин (выпущено штук)'] = {
        }

metadict_model['|-Производство боковых 100x100-мм керамических бронепластин (выпущено штук)'] = {
        }

metadict_model['|-Производство бронекостюмов шестого класса защиты (выпущено штук)'] = {
        }

metadict_model['|-Производство бронированных ремонтно-эвакуационных машин (выпущено штук)'] = {
        }

metadict_model['|-Производство бурильных машин (выпущено штук)'] = {
        }

metadict_model['|-Производство быстроходных траншейных машин (выпущено штук)'] = {
        }

metadict_model['|-Производство водолазных костюмов (выпущено штук)'] = {
        }

metadict_model['|-Производство возимых КВ-радиостанций (выпущено штук)'] = {
        }

metadict_model['|-Производство возимых УКВ-радиостанций (выпущено штук)'] = {
        }

metadict_model['|-Производство дезинфекционно-душевых комплексов (выпущено штук)'] = {
        }

metadict_model['|-Производство жгутов кровоостанавливающих (выпущено штук)'] = {
        }

metadict_model['|-Производство индивидуальных водяных фильтров (выпущено штук)'] = {
        }

metadict_model['|-Производство индивидуальных перевязочных пакетов (выпущено штук)'] = {
        }

metadict_model['|-Производство индивидуальных противохимических пакетов (выпущено штук)'] = {
        }

metadict_model['|-Производство индукционных миноискателей (выпущено штук)'] = {
        }

metadict_model['|-Производство инженерных разведывательных машин (выпущено штук)'] = {
        }

metadict_model['|-Производство инженерных разведывательных эхолокаторов (выпущено штук)'] = {
        }

metadict_model['|-Производство компасов (выпущено штук)'] = {
        }

metadict_model['|-Производство комплектов боевой экипировки (выпущено штук)'] = {
        }

metadict_model['|-Производство комплектов выживания (выпущено штук)'] = {
        }

metadict_model['|-Производство комплектов зимней повседневной униформы (выпущено штук)'] = {
        }

metadict_model['|-Производство комплектов летней повседневной униформы (выпущено штук)'] = {
        }

metadict_model['|-Производство комплектов парадной униформы (выпущено штук)'] = {
        }

metadict_model['|-Производство комплектов повседневной экипировки (выпущено штук)'] = {
        }

metadict_model['|-Производство комплектов силовой брони (выпущено штук)'] = {
        }

metadict_model['|-Производство лазерных приборов разведки (выпущено штук)'] = {
        }

metadict_model['|-Производство лесопильных рам (выпущено штук)'] = {
        }

metadict_model['|-Производство лидаров (выпущено штук)'] = {
        }

metadict_model['|-Производство малогабаритных УКВ-радиостанций (выпущено штук)'] = {
        }

metadict_model['|-Производство малых пехотных лопаток (выпущено штук)'] = {
        }

metadict_model['|-Производство маскировочных комплектов пехотинца (выпущено штук)'] = {
        }

metadict_model['|-Производство машин химической разведки (выпущено штук)'] = {
        }

metadict_model['|-Производство мини-буксировщиков (выпущено штук)'] = {
        }

metadict_model['|-Производство мини-погрузчиков (выпущено штук)'] = {
        }

metadict_model['|-Производство мини-экскаваторов (выпущено штук)'] = {
        }

metadict_model['|-Производство многофункциональных ножей (выпущено штук)'] = {
        }

metadict_model['|-Производство мобильных атомных электростанций (выпущено штук)'] = {
        }

metadict_model['|-Производство монокуляров ночного видения (выпущено штук)'] = {
        }

metadict_model['|-Производство нагрудных 200x200-мм керамических бронепластин (выпущено штук)'] = {
        }

metadict_model['|-Производство назофарингеальных трубок (выпущено штук)'] = {
        }

metadict_model['|-Производство наспинных креплений для оружия (выпущено штук)'] = {
        }

metadict_model['|-Производство непромокаемых плащей (выпущено штук)'] = {
        }

metadict_model['|-Производство носимых терминалов с дисплеем (выпущено штук)'] = {
        }

metadict_model['|-Производство носимых терминалов упрощённых (выпущено штук)'] = {
        }

metadict_model['|-Производство общевойсковых защитных комплектов (выпущено штук)'] = {
        }

metadict_model['|-Производство одноковшовых экскаваторов (выпущено штук)'] = {
        }

metadict_model['|-Производство одноместных палаток (выпущено штук)'] = {
        }

metadict_model['|-Производство паровых турбин мобильных АЭС (выпущено штук)'] = {
        }

metadict_model['|-Производство пассивных наушников (выпущено штук)'] = {
        }

metadict_model['|-Производство пегасо-переносимых радирелейных станций (выпущено штук)'] = {
        }

metadict_model['|-Производство пегасо-переносимых станций звукометрической разведки (выпущено штук)'] = {
        }

metadict_model['|-Производство пегасо-переносимых устройств радиоподавления (выпущено штук)'] = {
        }

metadict_model['|-Производство пегасо-переносимых устройств радиоразведки (выпущено штук)'] = {
        }

metadict_model['|-Производство переносных УКВ-радиостанций (выпущено штук)'] = {
        }

metadict_model['|-Производство персональных электронно-вычислительных машин (выпущено штук)'] = {
        }

metadict_model['|-Производство питьевых систем (выпущено штук)'] = {
        }

metadict_model['|-Производство полевых бань (выпущено штук)'] = {
        }

metadict_model['|-Производство полковых землеройных машин (выпущено штук)'] = {
        }

metadict_model['|-Производство портативных телекамер (выпущено штук)'] = {
        }

metadict_model['|-Производство приборов инженерной разведки (выпущено штук)'] = {
        }

metadict_model['|-Производство прицепных полевых кухонь (выпущено штук)'] = {
        }

metadict_model['|-Производство прицепных полевых прачечных (выпущено штук)'] = {
        }

metadict_model['|-Производство прицепных сушильно-гладильных установок (выпущено штук)'] = {
        }

metadict_model['|-Производство прорезиненых накопытников (выпущено штук)'] = {
        }

metadict_model['|-Производство противоосколочных воротников (выпущено штук)'] = {
        }

metadict_model['|-Производство противоосколочных комбинезонов (выпущено штук)'] = {
        }

metadict_model['|-Производство противохимических комбинезонов (выпущено штук)'] = {
        }

metadict_model['|-Производство радиационно-защитных костюмов (выпущено штук)'] = {
        }

metadict_model['|-Производство радиоволновых миноискателей (выпущено штук)'] = {
        }

metadict_model['|-Производство радиолокационных высотомеров (выпущено штук)'] = {
        }

metadict_model['|-Производство радиолокационных дальномеров (выпущено штук)'] = {
        }

metadict_model['|-Производство разгрузочных жилетов (выпущено штук)'] = {
        }

metadict_model['|-Производство резиновых наколенников (выпущено штук)'] = {
        }

metadict_model['|-Производство спальников (выпущено штук)'] = {
        }

metadict_model['|-Производство станков заготовки свай (выпущено штук)'] = {
        }

metadict_model['|-Производство станций ближней разведки (выпущено штук)'] = {
        }

metadict_model['|-Производство стробоскопических фонарей (выпущено штук)'] = {
        }

metadict_model['|-Производство таблеток антибактериального средства (выпущено штук)'] = {
        }

metadict_model['|-Производство таблеток противорвотного средства (выпущено штук)'] = {
        }

metadict_model['|-Производство таблеток психостимулирющего средства (выпущено штук)'] = {
        }

metadict_model['|-Производство таблеток радиозащитного средства (выпущено штук)'] = {
        }

metadict_model['|-Производство телевизионных прицелов (выпущено штук)'] = {
        }

metadict_model['|-Производство тепловизионных приборов разведки (выпущено штук)'] = {
        }

metadict_model['|-Производство теплоизолирующих ковриков (выпущено штук)'] = {
        }

metadict_model['|-Производство турбогенераторов мобильных АЭС (выпущено штук)'] = {
        }

metadict_model['|-Производство тяжёлых одноковшовых экскаваторов (выпущено штук)'] = {
        }

metadict_model['|-Производство универсальных источников питания (выпущено штук)'] = {
        }

metadict_model['|-Производство универсальных мастерских (выпущено штук)'] = {
        }

metadict_model['|-Производство упаковок влажных салфеток (выпущено штук)'] = {
        }

metadict_model['|-Производство управляемых инжекторов лекарственных средств (выпущено штук)'] = {
        }

metadict_model['|-Производство установок строительства мостов (выпущено штук)'] = {
        }

metadict_model['|-Производство фильтрующих противогазов (выпущено штук)'] = {
        }

metadict_model['|-Производство часов (выпущено штук)'] = {
        }

metadict_model['|-Производство шлемов второго класса защиты (выпущено штук)'] = {
        }

metadict_model['|-Производство шлемов шестого класса защиты (выпущено штук)'] = {
        }

metadict_model['|-Производство шприц-тюбиков антидота ФОВ (выпущено штук)'] = {
        }

metadict_model['|-Производство шприц-тюбиков антирадиационного средства (выпущено штук)'] = {
        }

metadict_model['|-Производство шприц-тюбиков заживляющего средства (выпущено штук)'] = {
        }

metadict_model['|-Производство шприц-тюбиков обезболивающего средства (выпущено штук)'] = {
        }

metadict_model['|-Производство шприц-тюбиков психостимулирющего средства (выпущено штук)'] = {
        }

# ----
# Подавляем вывод:

metadict_model['Аммиачная селитра (килограмм)'] = {
        }

metadict_model['Антенно-волноводное устройство'] = {
        }

metadict_model['Аппаратура засекречивания'] = {
        }

metadict_model['Аппаратура определения свой-чужой'] = {
        }

metadict_model['Армейская ремонтно-восстановительная база'] = {
        }

metadict_model['Артиллерийская буссоль'] = {
        }

metadict_model['Барометрический высотомер'] = {
        }

metadict_model['Батальон радиопомех наземным средствам'] = {
        }

metadict_model['Батальон тропосферной связи'] = {
        }

metadict_model['Башня оператора стрелового оборудования'] = {
        }

metadict_model['Боевой щит гаубицы'] = {
        }

metadict_model['Бортовая деталь башни 120-мм САУ'] = {
        }

metadict_model['Бортовой бронелист башни 120-мм САУ'] = {
        }

metadict_model['Бульдозер-сошник (3x0.5 метра)'] = {
        }

metadict_model['Бульдозерное оборудование машины для отрывки котлованов'] = {
        }

metadict_model['Бульдозерное оборудование путепрокладчика'] = {
        }

metadict_model['Вариометр'] = {
        }

metadict_model['Вентиляционно-отопительная установка'] = {
        }

metadict_model['Верхний станок гаубицы'] = {
        }

metadict_model['Внутренние системы военного грузовика'] = {
        }

metadict_model['Водитель лёгкого самосвала'] = {
        }

metadict_model['Водомётная пушка пожарной машины'] = {
        }

metadict_model['Водонагреватель-паровой котёл (7 кубометров 40+ град. воды/час)'] = {
        }

metadict_model['Военный госпиталь'] = {
        }

metadict_model['Воск (тонн)'] = {
        }

metadict_model['Выстилка понтонно-мостового парка'] = {
        }

metadict_model['Газосигнализатор'] = {
        }

metadict_model['Гексоген (тонн)'] = {
        }

metadict_model['Гидравлический тормоз откатных частей'] = {
        }

metadict_model['Гидропневматический накатник'] = {
        }

metadict_model['Гидропривод бульдозера'] = {
        }

metadict_model['Гидропривод мини-погрузчика'] = {
        }

metadict_model['Гидропривод навесного танкового бульдозера'] = {
        }

metadict_model['Гидропривод скрепера'] = {
        }

metadict_model['Гидропривод траншейной машины'] = {
        }

metadict_model['Гидропривод тяжёлого бульдозера'] = {
        }

metadict_model['Гидроцилиндр подъёма стрелы'] = {
        }

metadict_model['Гирокомпас'] = {
        }

metadict_model['Громкоговоритель'] = {
        }

metadict_model['Гусеничная лента БМД'] = {
        }

metadict_model['Двигатель буксируемого катера'] = {
        }

metadict_model['Двигатель лёгкого БПЛА'] = {
        }

metadict_model['Двигатель мультикоптера'] = {
        }

metadict_model['Двигатель тяжёлого колёсного тягача'] = {
        }

metadict_model['Дезинфекционная камера (3.5 кубометра)'] = {
        }

metadict_model['Динитротолуол (килограмм)'] = {
        }

metadict_model['Душевая сетка (5 литров/минуту)'] = {
        }

metadict_model['Железнодорожная станция снабжения'] = {
        }

metadict_model['Зажимная тележка лесопильной рамы'] = {
        }

metadict_model['Запасные части, инструменты и принадлежности ОБТ'] = {
        }

metadict_model['Захват-манипулятор'] = {
        }

metadict_model['Измеритель мощности дозы'] = {
        }

metadict_model['Имущество батареи'] = {
        }

metadict_model['Имущество батареи (аэромобильной)'] = {
        }

metadict_model['Имущество роты'] = {
        }

metadict_model['Имущество роты (аэромобильной)'] = {
        }

metadict_model['Имущество роты (мотострелковой)'] = {
        }

metadict_model['Имущество роты (специального назначения)'] = {
        }

metadict_model['Имущество роты (танковой)'] = {
        }

metadict_model['Индикаторное устройство'] = {
        }

metadict_model['Инженерно-аэродромный батальон'] = {
        }

metadict_model['Инженерно-дорожный мостовой батальон'] = {
        }

metadict_model['Инженерно-маскировочный батальон'] = {
        }

metadict_model['Инженерно-позиционный батальон'] = {
        }

metadict_model['КВ-радиостанция'] = {
        }

metadict_model['Кабина колёсного трактора'] = {
        }

metadict_model['Кабина лёгкого колёсного трактора'] = {
        }

metadict_model['Кабина одноковшового экскаватора'] = {
        }

metadict_model['Кабина тяжёлого гусеничного трактора'] = {
        }

metadict_model['Кабина тяжёлого гусеничного тягача'] = {
        }

metadict_model['Кабина тяжёлого колёсного тягача'] = {
        }

metadict_model['Карбамид (килограмм)'] = {
        }

metadict_model['Ковш экскаватора (0.2 кубометра)'] = {
        }

metadict_model['Ковш экскаватора (0.65 кубометра)'] = {
        }

metadict_model['Ковш экскаватора (1 кубометр)'] = {
        }

metadict_model['Колейный минный трал'] = {
        }

metadict_model['Колёсный ход гаубицы'] = {
        }

metadict_model['Командование переправочно-десантного батальона'] = {
        }

metadict_model['Комплект знаков огражения'] = {
        }

metadict_model['Комплект катков БМД'] = {
        }

metadict_model['Компоненты РЛС ЗРК ближнего действия'] = {
        }

metadict_model['Компоненты РЛС ЗРК малой дальности'] = {
        }

metadict_model['Компоненты РЛС ЗРК средней дальности'] = {
        }

metadict_model['Компоненты РЛС наведения'] = {
        }

metadict_model['Компоненты РЛС обнаружения'] = {
        }

metadict_model['Компоненты автомобильной полевой кухни'] = {
        }

metadict_model['Компоненты автомобильной фильтровальной станции'] = {
        }

metadict_model['Компоненты бурильной машины'] = {
        }

metadict_model['Компоненты индукционного миноискателя'] = {
        }

metadict_model['Компоненты инженерного разведывательного эхолокатора'] = {
        }

metadict_model['Компоненты лазерного прибора разведки'] = {
        }

metadict_model['Компоненты паровой турбины мобильной АЭС'] = {
        }

metadict_model['Компоненты пегасо-переносимого станции звукометрической разведки'] = {
        }

metadict_model['Компоненты пегасо-переносимого устройства радиоподавления'] = {
        }

metadict_model['Компоненты пегасо-переносимого устройства радиоразведки'] = {
        }

metadict_model['Компоненты пегасо-переносимой радиорелейной станции'] = {
        }

metadict_model['Компоненты переносной КВ-радиостанции'] = {
        }

metadict_model['Компоненты переносной РЛС'] = {
        }

metadict_model['Компоненты переносной УКВ-радиостанции'] = {
        }

metadict_model['Компоненты прибора инженерной разведки (перископа)'] = {
        }

metadict_model['Компоненты прицепной полевой кухни'] = {
        }

metadict_model['Компоненты радиоволнового миноискателя'] = {
        }

metadict_model['Компоненты радиолокационного высотомера'] = {
        }

metadict_model['Компоненты реактора мобильной АЭС'] = {
        }

metadict_model['Компоненты тепловизионного прибора разведки'] = {
        }

metadict_model['Компоненты турбогенератора мобильной АЭС'] = {
        }

metadict_model['Конструкция лёгкого БПЛА'] = {
        }

metadict_model['Конструкция лёгкого планёра'] = {
        }

metadict_model['Конструкция мультикоптера'] = {
        }

metadict_model['Контрольная и измерительная аппаратура'] = {
        }

metadict_model['Кормовая деталь башни 120-мм САУ'] = {
        }

metadict_model['Корпус буксируемого катера'] = {
        }

metadict_model['Корпус плавающего гусеничного транспортёра'] = {
        }

metadict_model['Крайний понтон'] = {
        }

metadict_model['Крановое оборудование путепрокладчика'] = {
        }

metadict_model['Крылья центрального отвала инженерной машины разграждения'] = {
        }

metadict_model['Крыша башни 120-мм САУ'] = {
        }

metadict_model['Крыша башни САУ 120-мм'] = {
        }

metadict_model['Ксилидин (килограмм)'] = {
        }

metadict_model['Кузов самосвала (8 кубометров)'] = {
        }

metadict_model['Лебёдка мини-буксировщика'] = {
        }

metadict_model['Лебёдка путепрокладчика'] = {
        }

metadict_model['Лебёдка тяговая вспомогательная (0.6 тонно-сил)'] = {
        }

metadict_model['Лебёдка тяговая главная (25 тонно-сил)'] = {
        }

metadict_model['Левый полупаром'] = {
        }

metadict_model['Линейно-кабельный батальон связи'] = {
        }

metadict_model['Лобовая деталь башни 120-мм САУ'] = {
        }

metadict_model['Люлька гаубицы'] = {
        }

metadict_model['Лёгкий планёр (перевозка снаряжение)'] = {
        }

metadict_model['Метроном'] = {
        }

metadict_model['Механизм выдвижения стрелы'] = {
        }

metadict_model['Механизм заряжания танковой пушки'] = {
        }

metadict_model['Механизм крепления орудия по-походному'] = {
        }

metadict_model['Механизм поворота платформы'] = {
        }

metadict_model['Механизм подрессоривания гаубицы'] = {
        }

metadict_model['Механизм подъема, поворота и раскрытия захвата-манипулятора'] = {
        }

metadict_model['Механизмы перекоса и крепления бульдозерного оборудования'] = {
        }

metadict_model['Механизмы подъёма и опускания бульдозерного оборудования'] = {
        }

metadict_model['Насосная станция пожарной машины'] = {
        }

metadict_model['Нижний станок гаубицы'] = {
        }

metadict_model['Нитрат аммония (килограмм)'] = {
        }

metadict_model['Нитроглицерин (тонн)'] = {
        }

metadict_model['Оборудование дорожного катка'] = {
        }

metadict_model['Оборудование прицепного минного заградителя'] = {
        }

metadict_model['Оборудование сапёрного робота'] = {
        }

metadict_model['Оборудование стрелового крана (25 тонн)'] = {
        }

metadict_model['Оборудование стрелового крана (6 тонн)'] = {
        }

metadict_model['Оборудование танкового мостоукладчика'] = {
        }

metadict_model['Оборудование трелёвшика'] = {
        }

metadict_model['Оборудование углевыжигательной печи'] = {
        }

metadict_model['Оборудование универсального минного заградителя'] = {
        }

metadict_model['Оптический дальномер'] = {
        }

metadict_model['Осветительная мачта пожарной машины'] = {
        }

metadict_model['Отопительно-вентиляционная установка (7.5 киловатт)'] = {
        }

metadict_model['Палатка-санпропускник'] = {
        }

metadict_model['Панорамный прицел гаубицы'] = {
        }

metadict_model['Пеногенератор пожарной машины'] = {
        }

metadict_model['Передающее устройство'] = {
        }

metadict_model['Перекачивающая станция'] = {
        }

metadict_model['Переносная просеивательная машина'] = {
        }

metadict_model['Переносная тестоотделительная машина'] = {
        }

metadict_model['Переносная тестоформовочная машина'] = {
        }

metadict_model['Пила лесопильной рамы'] = {
        }

metadict_model['Пироксилин (тонн)'] = {
        }

metadict_model['Платформа тяжёлого колёсного трактора'] = {
        }

metadict_model['Поворотная платформа'] = {
        }

metadict_model['Поворотный механизм танковой башни'] = {
        }

metadict_model['Подвеска БМД'] = {
        }

metadict_model['Подвижная ремонтно-техническая база'] = {
        }

metadict_model['Поддерживающая тележка лесопильной рамы'] = {
        }

metadict_model['Полевая хлебопекарная печь'] = {
        }

metadict_model['Полевой тестоприготовительный агрегат'] = {
        }

metadict_model['Полноповоротный грейдерный отвал'] = {
        }

metadict_model['Полуавтоматический газоопределитель'] = {
        }

metadict_model['Правый полупаром'] = {
        }

metadict_model['Прибор химической разведки'] = {
        }

metadict_model['Приводные устрйоства'] = {
        }

metadict_model['Приводы вертикальной наводки'] = {
        }

metadict_model['Приводы горизонтальной наводки'] = {
        }

metadict_model['Приспособление отбора проб'] = {
        }

metadict_model['Приёмное устройство'] = {
        }

metadict_model['Рабочий орган бульдозера'] = {
        }

metadict_model['Рабочий орган машины для отрывки котлованов'] = {
        }

metadict_model['Рабочий орган мини-погрузчика'] = {
        }

metadict_model['Рабочий орган навесного танкового бульдозера'] = {
        }

metadict_model['Рабочий орган скрепера'] = {
        }

metadict_model['Рабочий орган тяжёлого бульдозера'] = {
        }

metadict_model['Радиорелейный батальон связи'] = {
        }

metadict_model['Разведывательная аппаратура БПЛА'] = {
        }

metadict_model['Рама военного грузовика'] = {
        }

metadict_model['Рама колёсного трактора'] = {
        }

metadict_model['Рама лёгкого колёсного трактора'] = {
        }

metadict_model['Рама тяжёлого гусеничного трактора'] = {
        }

metadict_model['Рама тяжёлого гусеничного тягача'] = {
        }

metadict_model['Рама тяжёлого колёсного тягача'] = {
        }

metadict_model['Рама центрального отвала инженерной машины разграждения'] = {
        }

metadict_model['Распылитель авторазливочной станции'] = {
        }

metadict_model['Резервуар резинно-тканевый (5 кубометров)'] = {
        }

metadict_model['Рота специального минирования (аэромобильная)'] = {
        }

metadict_model['Ротор траншейного экскаватора'] = {
        }

metadict_model['Сборочная бригада головных частей оперативно-тактических ракет'] = {
        }

metadict_model['Сваебойно-обстроечная площадка (4 молота 0.25 тонны)'] = {
        }

metadict_model['Силовой полиспаст (усиление до 100 тонно-сил)'] = {
        }

metadict_model['Силовые приводы экзоскелета'] = {
        }

metadict_model['Система стабилизации танковой пушки'] = {
        }

metadict_model['Слесарный верстак'] = {
        }

metadict_model['Средний понтон'] = {
        }

metadict_model['Станок настольно-сверлильный'] = {
        }

metadict_model['Станок точильно-шлифовальный'] = {
        }

metadict_model['Старший механик (гидравлические приводы)'] = {
        }

metadict_model['Стиральная машина (35 кг белья/час)'] = {
        }

metadict_model['Стрела экскаватора (1.5 метра)'] = {
        }

metadict_model['Стрела экскаватора (3 метра)'] = {
        }

metadict_model['Стреловой кран (1.5 тонны)'] = {
        }

metadict_model['Стреловой кран (12 тонн)'] = {
        }

metadict_model['Стреловой кран инженерной машины разграждения'] = {
        }

metadict_model['Стреловой кран мини-буксировщика'] = {
        }

metadict_model['Сушильно-гладильный станок (35 кг белья/час)'] = {
        }

metadict_model['Танковая система защиты от оружия массового поражения'] = {
        }

metadict_model['Танковая система пожаротушения'] = {
        }

metadict_model['Танковые гидроприводы (метры)'] = {
        }

metadict_model['Танковые детали (килограмм)'] = {
        }

metadict_model['Танковые литые детали (килограмм)'] = {
        }

metadict_model['Танковые механические устройства (килограмм)'] = {
        }

metadict_model['Телескопический прицел гаубицы'] = {
        }

metadict_model['Тентованный кузов'] = {
        }

metadict_model['Терминал автоматической системы управления'] = {
        }

metadict_model['Техническая батарея оперативно-тактических ракет'] = {
        }

metadict_model['Транспортер лесопильной рамы'] = {
        }

metadict_model['Тринитротолуол (килограмм)'] = {
        }

metadict_model['Тяжёлый колёсный тягач (перевозка стратегических ракет)'] = {
        }

metadict_model['Тяжёлый стреловой кран'] = {
        }

metadict_model['Узловой батальон связи'] = {
        }

metadict_model['Указатель поворота и скольжения'] = {
        }

metadict_model['Указатель скорости'] = {
        }

metadict_model['Унифицированный герметичный кузов'] = {
        }

metadict_model['Уравновешивающий механизм гаубицы'] = {
        }

metadict_model['Урановый сплав БПС (килограмм)'] = {
        }

metadict_model['Установка запуска сигналов химической тревоги'] = {
        }

metadict_model['Устройства обогрева и вентиляции'] = {
        }

metadict_model['Устройство защиты от радиопомех'] = {
        }

metadict_model['Устройство защиты от самонаводящихся снарядов'] = {
        }

metadict_model['Устройство преобразования координат'] = {
        }

metadict_model['Устройство управления и защиты от перегрузок'] = {
        }

metadict_model['Флегматизатор (килограмм)'] = {
        }

metadict_model['Фосфор красный (килограмм)'] = {
        }

metadict_model['Хлорпарафин жидкий (килограмм)'] = {
        }

metadict_model['Ходовая часть тяжёлого колёсного тягача'] = {
        }

metadict_model['Централит (килограмм)'] = {
        }

metadict_model['Центральный отвал инженерной машины разграждения'] = {
        }

metadict_model['Шасси автомобильного прицепа'] = {
        }

metadict_model['Шасси колёсного трактора'] = {
        }

metadict_model['Шасси лёгкого колёсного трактора'] = {
        }

metadict_model['Шасси тяжёлого гусеничного трактора'] = {
        }

metadict_model['Шасси тяжёлого планёра'] = {
        }

metadict_model['Электрооборудование и средства связи сапёрного робота'] = {
        }

metadict_model['Электрооборудование и средства связи строительного робота'] = {
        }

metadict_model['Эстакада лесопильной рамы'] = {
        }

metadict_model['Ядерные заряды (25 килотонн)'] = {
        }

metadict_model['Сваебойный молот (0.5 тонны)'] = {
        }

metadict_model['Стреловой кран (6 тонн)'] = {
        }
