#----
# Комплекты снаряжения:
    # Размеры пони:
    # Рост в холке -- 60 сантиметров
    # Длина передних ног -- 37.5 см (до перехода в грудь, если смотреть спереди)
    # Длина задних ног до сустава -- 35 см
    # Диаметр копытца -- 12.5 см
    # Длина тела (от хвоста до груди) -- 45 см
    # Ширина головы -- 36 см (от скулы до скулы)
    # Площадь тела средней пони -- 1.71 кв. метра
    # Объём тела средней пони -- 0.0623 куб. метра

metadict_detail['Комплект силовой брони'] = {
        'Экзоскелет силовой брони':1,
        'Средства индивидуальной защиты силовой брони':1,
        'Средства связи, разведки и навигации силовой брони':1,
        'Модульное грузовое снаряжение боевой экипировки':1,
        'Средства жизнеобеспечения боевой экипировки':1,
        'Силовая броня':1,
        'wpn_cost':100000,
        }

metadict_detail['Комплект боевой экипировки базовый'] = {
        'Средства индивидуальной защиты боевой экипировки':1,
        'Средства связи, разведки и навигации боевой экипировки':1,
        'Модульное грузовое снаряжение боевой экипировки':1,
        'Средства жизнеобеспечения боевой экипировки':1,
        'Боевая экипировка':1,
        }

metadict_detail['Комплект боевой экипировки гренадера'] = {
        'Средства индивидуальной защиты боевой экипировки':1,
        'Средства связи, разведки и навигации боевой экипировки':1,
        'Модульное грузовое снаряжение боевой экипировки':1,
        'Средства жизнеобеспечения боевой экипировки':1,
        'Носимый терминал упрощённый':1,
        'Портативная телекамера':2,
        'Телевизионный прицел':1,
        'Боевая экипировка':1,
        }

metadict_detail['Комплект боевой экипировки сержанта'] = {
        'Средства индивидуальной защиты боевой экипировки':1,
        'Средства связи, разведки и навигации боевой экипировки':1,
        'Модульное грузовое снаряжение боевой экипировки':1,
        'Средства жизнеобеспечения боевой экипировки':1,
        'Носимый терминал упрощённый':1,
        'Боевая экипировка':1,
        }

metadict_detail['Комплект боевой экипировки командира'] = {
        'Средства индивидуальной защиты боевой экипировки':1,
        'Средства связи, разведки и навигации боевой экипировки':1,
        'Модульное грузовое снаряжение боевой экипировки':1,
        'Средства жизнеобеспечения боевой экипировки':1,
        'Носимый терминал с дисплеем':1,
        'Боевая экипировка':1,
        }

metadict_detail['Водолазный костюм'] = {
        'Радиационно-защитные костюмы':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.03,
        'wpn_cost':100000,
        }

metadict_detail['Радиационно-защитный костюм'] = {
        'Радиационно-защитные костюмы':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.03,
        'wpn_cost':100000,
        }

metadict_detail['Станция ближней разведки'] = {
        'Переносные радиолокаторы':1,
        'Оптические компьютеры (терминалы)':1,
        'Монокристаллический маховик малогабаритный (килограмм)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.02,
        '--Потребление энергии (кВт)':0.1,
        'wpn_cost':200000,
        }

metadict_detail['Лазерный прибор разведки'] = {
        'Лидар':1,
        'Оптические компьютеры (терминалы)':1,
        'Монокристаллический маховик малогабаритный (килограмм)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.005,
        'wpn_cost':10000,
        }

metadict_detail['Лидар'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.001,
        '--Потребление энергии (кВт)':0.1,
        'wpn_cost':10000,
        }

metadict_detail['Тепловизионный прибор разведки'] = {
        'Охлаждаемая тепловизионная матрица':1,
        'Оптические компьютеры (терминалы)':1,
        'Монокристаллический маховик малогабаритный (килограмм)':10,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.1,
        '--Потребление энергии (кВт)':1,
        'wpn_cost':100000,
        }

metadict_detail['Индукционный миноискатель полупроводниковый'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.002,
        'wpn_cost':100,
        }

metadict_detail['Переносной радиоволновый миноискатель'] = {
        # http://the-mostly.ru/misc/perenosnoy_radiovolnovyy_minoiskatel_rvm_2m.html
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.003,
        'wpn_cost':100,
        }

metadict_detail['Инженерный разведывательный эхолокатор'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.003,
        'wpn_cost':200,
        }

metadict_detail['Прибор инженерной разведки (перископ)'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.003,
        'wpn_cost':200,
        }

metadict_detail['Пегасо-переносимая радиорелейная станция'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.2,
        'wpn_cost':10000,
        }

metadict_detail['Пегасо-переносимое устройство радиоподавления'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.2,
        '--Потребление энергии (кВт)':5,
        '--Запас энергии (МДж)':500,
        'wpn_cost':200000,
        }

metadict_detail['Пегасо-переносимое устройство радиоразведки'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.2,
        '--Потребление энергии (кВт)':0.1,
        '--Запас энергии (МДж)':10,
        'wpn_cost':200000,
        }

metadict_detail['Пегасо-переносимая станция звукометрической разведки'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.2,
        'wpn_cost':20000,
        }

#----
# Компоненты снаряжения:

metadict_detail['Средства индивидуальной защиты боевой экипировки'] = {
        'Бронежилет шестого класса защиты':1,
        'Противоосколочный комбинезон':1,
        'Шлем второго класса защиты':1,
        '--Устойчивость к подавлению (в наступлении, РБ)':15,
        '--Устойчивость к подавлению (в окопах, РБ)':10,
        '--Устойчивость к подавлению (на марше, РБ)':1,
        }

metadict_detail['Средства индивидуальной защиты силовой брони'] = {
        'Бронекостюм шестого класса защиты':1,
        'Система фильтрации воздуха':1,
        'Система кондиционирования':1,
        'Противохимическая защита':1,
        'Амортизирующий комбинезон':1,
        'Шлем шестого класса защиты':1,
        '--Устойчивость к подавлению (в наступлении, РБ)':100,
        '--Устойчивость к подавлению (в окопах, РБ)':50,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        }

metadict_detail['Бронежилет шестого класса защиты'] = {
        'Противоосколочный воротник':1,
        'Резиновые наколенники':4,
        'Прорезиненные накопытники':4,
        'Нагрудная 200x200-мм керамическая бронепластина':1,
        'Боковые 100x100-мм керамические бронепластины':6,
        }

metadict_detail['Противоосколочный комбинезон'] = {
        # Площадь тела средней пони -- 1.71 кв. метра
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':100,
        }

metadict_detail['Противоосколочный воротник'] = {
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':20,
        }

metadict_detail['Резиновые наколенники'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0001,
        'wpn_cost':30,
        }

metadict_detail['Прорезиненные накопытники'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0003,
        'wpn_cost':50,
        }

metadict_detail['Боковые 100x100-мм керамические бронепластины'] = {
        'Бронекерамика шестого класса защиты (квадратные дециметры)':1,
        'Конвекционно-амортизационный подпор (квадратные дециметры)':1,
        }

metadict_detail['Нагрудная 200x200-мм керамическая бронепластина'] = {
        'Бронекерамика шестого класса защиты (квадратные дециметры)':4,
        'Конвекционно-амортизационный подпор (квадратные дециметры)':4,
        }

metadict_detail['Шлем второго класса защиты'] = {
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':15,
        'Конвекционно-амортизационный подпор (квадратные дециметры)':5,
        'Баллистические очки':1,
        }

metadict_detail['Баллистические очки'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0003,
        'wpn_cost':50,
        }

metadict_detail['Бронекостюм шестого класса защиты'] = {
        # Площадь тела средней пони -- 1.71 кв. метра
        'Бронекерамика шестого класса защиты (квадратные дециметры)':60,
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':60,
        }

metadict_detail['Амортизирующий комбинезон'] = {
        'Конвекционно-амортизационный подпор (квадратные дециметры)':100,
        }

metadict_detail['Шлем шестого класса защиты'] = {
        # Ширина головы пони -- 36 см (от скулы до скулы)
        # Коэффициент полноты 0.6
        # Площадь поверхности шлема: 0.47 кв. метра
        'Бронекерамика шестого класса защиты (квадратные дециметры)':30,
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':20,
        }

metadict_detail['Противохимическая защита'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.003,
        'wpn_cost':3000,
        }

metadict_detail['Система кондиционирования'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.001,
        '--Потребление энергии (кВт)':0.2,
        'wpn_cost':5000,
        }

metadict_detail['Система фильтрации воздуха'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.001,
        '--Потребление энергии (кВт)':0.2,
        'wpn_cost':5000,
        }

metadict_detail['Экзоскелет силовой брони'] = {
        # Экзоскелет даёт около 5 киловатт (если вес бойца 300 кг, это 16.7 Ватт/кг)
        # (6 Ватт/килограмм -- мощность лошади-тяжеловоза, 13 Ватт/кг мощность танка)
        # Скорость галопа на пересечённой местности до 60 км/час.
        'Каркас экзоскелета':1,
        'Двигатель экзоскелета':1,
        'Гидравлическая система экзоскелета':1,
        'Система сервоприводов экзоскелета':1,
        'Наспинный боевой модуль силовой брони':1,
        'Система обратной связи экзоскелета':1,
        }

metadict_detail['Каркас экзоскелета'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.01,
        'wpn_cost':2000,
        }

metadict_detail['Двигатель экзоскелета'] = {
        # Почти аналог в мире ДВС "Iron Angel Е200Z":
        # https://samsad.kiev.ua/dvigatel-iron-angel-e200z.html
        'Лёгкий электрогенератор':1,
        'Вариатор переносного маховика':1,
        'Монокристаллический маховик малогабаритный (килограмм)':20,
        }

metadict_detail['Лёгкий электрогенератор'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0005,
        '--Потребление энергии (кВт)':1,
        'wpn_cost':1000,
        }

metadict_detail['Вариатор переносного маховика'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0005,
        'wpn_cost':5000,
        }

metadict_detail['Гидравлическая система экзоскелета'] = {
        # КПД: 0.95*0.9*0.95*0.9=0.73
        'Насосы гидравлической системы':2,
        'Вентиляторы системы охлаждения':2,
        'Гидравлический распределитель':1,
        'Гидравлические приводы':4,
        'Гидравлические цилиндры':16,
        }

metadict_detail['Насосы гидравлической системы'] = {
        # НШ 6-3, мощность 7 кВт, масса 1.5 кг, подача 16.2 л/мин (0.00027 кубометра в секунду)
        # Масляные насосы с потребляемой мощностью в 7 кВт и массой в 1.5 кг.
        # http://www.artr.ru/Gidravlik/Gidravlik_pumps/nsh/gear_sh_nsh_oil.htm
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0015,
        '--Потребление энергии (кВт)':7,
        'wpn_cost':1000,
        }

metadict_detail['Вентиляторы системы охлаждения'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0005,
        '--Потребление энергии (кВт)':0.5,
        'wpn_cost':200,
        }

metadict_detail['Гидравлический распределитель'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0005,
        'wpn_cost':500,
        }

metadict_detail['Гидравлические приводы'] = {
        # РВД Ду5 Тип II 0,34 кг/метр, рабочее давление 35 МПа
        # http://ladspb.ru/hydro_hose/gost_6286-73/
        # Допустимая мощность (Объёмный гидроприовод): 0.00027*35000000=9450 Ватт
        # Длина тела (от хвоста до груди) -- 45 см
        # Длина задних ног до сустава -- 35 см
        'Рукав высокого давления (метры)':2,
        }

metadict_detail['Гидравлические цилиндры'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0002,
        'wpn_cost':200,
        }

metadict_detail['Система сервоприводов экзоскелета'] = {
        'Силовые приводы экзоскелета':16,
        }

metadict_detail['Силовые приводы экзоскелета'] = {
        # Дают мощность до 300 Ватт. 
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0002,
        'wpn_cost':200,
        }

metadict_detail['Наспинный боевой модуль силовой брони'] = {
        'Силовые приводы экзоскелета':4,
        }

metadict_detail['Система обратной связи экзоскелета'] = {
        'Миодатчики':16,
        'Оптические компьютеры (терминалы)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.002,
        'wpn_cost':10000,
        }

metadict_detail['Миодатчики'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.00002,
        'wpn_cost':1000,
        }

metadict_detail['Средства связи, разведки и навигации боевой экипировки'] = {
        'Наушная система управления боевой экипировкой':1,
        'УКВ-радиостанция малогабаритная':1,
        'Универсальный источник питания':1,
        'Бинокль переменной кратности':1,
        'Монокуляр ночного видения':1,
        }

metadict_detail['Средства связи, разведки и навигации силовой брони'] = {
        'Наушная система управления боевой экипировкой':1,
        'Коллиматорная оптическая проекционная система':1,
        'Пехотная система управления огнём':1,
        'Индивидуальный комплекс разведки':1,
        'УКВ-радиостанция малогабаритная':1,
        'Активные наушники':1,
        }

metadict_detail['Индивидуальный комплекс разведки'] = {
        'Монокуляр ночного видения':2,
        'Портативная телекамера':2,
        'Телевизионный прицел':1,
        'Бинокль переменной кратности':1,
        'Лидар':1,
        }

metadict_detail['Пехотная система управления огнём'] = {
        'Оптические компьютеры (терминалы)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.002,
        'wpn_cost':50000,
        }

metadict_detail['Коллиматорная оптическая проекционная система'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.002,
        'wpn_cost':5000,
        }

metadict_detail['Наушная система управления боевой экипировкой'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0003,
        'wpn_cost':500,
        }

metadict_detail['Монокуляр ночного видения'] = {
        # https://ru.wikipedia.org/wiki/НСПУ_(прицел)
        # Инфракрасный прибор ночного видения (бесподсветный)
        # Дальность видимости: 400 метров -- пехотинец; 600 метров -- танк.
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0022,
        '--Потребление энергии (кВт)':0.001,
        'wpn_cost':3000,
        }

metadict_detail['Бинокль переменной кратности'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.001,
        'wpn_cost':800,
        }

metadict_detail['Активные наушники'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0005,
        '--Потребление энергии (кВт)':0.001,
        'wpn_cost':1000,
        }

metadict_detail['Пассивные наушники'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0005,
        'wpn_cost':50,
        }

metadict_detail['Универсальный источник питания'] = {
        # Источник механической/электрической энергии, 5 МДж -- 0.5 кг маховик.
        'Компоненты универсального источника питания':1,
        }

metadict_detail['УКВ-радиостанция малогабаритная'] = {
        # https://ru.wikipedia.org/wiki/Р-147
        # Дальность связи с однотипной станцией — до 1 км.
        'Ларингофон':1,
        'Наушники радиостанции':1,
        'Компоненты малогабаритной радиостанции':1,
        '--Потребление энергии (кВт)':0.001,
        }

metadict_detail['УКВ-радиостанция переносная'] = {
        # https://ru.wikipedia.org/wiki/Р-159
        # Дальность связи:
        # На штыревую антенну 1,5 м в режиме ТлФ до 12 км, в режиме ТлГ до 18 км;
        # На штыревую антенну 2,7 м в режиме ТлФ до 18 км, в режиме ТлГ до 27 км;
        # На антенну бегущей волны в режиме ТлФ до 35 км, в режиме ТлГ до 50 км;
        # При установке на автомобиле и антенне 1,5 м при скорости до 60 км/ч — до 8 км.
        'Ларингофон':1,
        'Наушники радиостанции':1,
        'Штыревая антенна 2.7 метров':1,
        'Штыревая антенна 1.5 метров':1,
        'Универсальный источник питания':1,
        'Компоненты переносной радиостанции':1,
        '--Потребление энергии (кВт)':0.05,
        }

metadict_detail['УКВ-радиостанция возимая'] = {
        # https://ru.wikipedia.org/wiki/Р-159
        # Дальность связи:
        # На штыревую антенну 1,5 м в режиме ТлФ до 12 км, в режиме ТлГ до 18 км;
        # На штыревую антенну 2,7 м в режиме ТлФ до 18 км, в режиме ТлГ до 27 км;
        # На антенну бегущей волны в режиме ТлФ до 35 км, в режиме ТлГ до 50 км;
        # При установке на автомобиле и антенне 1,5 м при скорости до 60 км/ч — до 8 км.
        'Ларингофон':1,
        'Наушники радиостанции':1,
        'Антенна бегущей волны':1,
        'Штыревая антенна 2.7 метров':1,
        'Штыревая антенна 1.5 метров':1,
        'Универсальный источник питания':1,
        'Компоненты возимой радиостанции':1,
        '--Потребление энергии (кВт)':0.05,
        }

metadict_detail['КВ-радиостанция переносная'] = {
        'Ларингофон':1,
        'Наушники радиостанции':1,
        'Штыревая антенна 2.7 метров':1,
        'Штыревая антенна 1.5 метров':1,
        'Универсальный источник питания':2,
        'Компоненты переносной радиостанции':2,
        '--Потребление энергии (кВт)':0.1,
        }

metadict_detail['КВ-радиостанция возимая'] = {
        'Ларингофон':1,
        'Наушники радиостанции':1,
        'Антенна бегущей волны':1,
        'Штыревая антенна 2.7 метров':1,
        'Штыревая антенна 1.5 метров':1,
        'Универсальный источник питания':2,
        'Компоненты возимой радиостанции':2,
        '--Потребление энергии (кВт)':0.1,
        }

metadict_detail['Персональная электронно-вычислительная машина'] = {
        # https://en.wikipedia.org/wiki/Grid_Compass
        'Универсальный источник питания':1,
        'Компоненты персональной электронно-вычислительной машины':1,


        'Оптические компьютеры (терминалы)':1,
        'Сборка электромеханических устройств (нормо-часов)':40,
        'Монокристаллический маховик малогабаритный (килограмм)':0.5,
        'Электронно-лучевые приборы (килограмм)':2,
        'Высокопрочные пластмассы (килограмм)':7,
        'Интегральные схемы (килограмм)':6,

        'Универсальный источник питания':1,
        'Компоненты персональной электронно-вычислительной машины':1,
        '--Потребление энергии (кВт)':0.05,
        }

metadict_detail['Носимый терминал упрощённый'] = {
        'Оптические компьютеры (терминалы)':1,
        'Монокристаллический маховик малогабаритный (килограмм)':0.2,
        '--Потребление энергии (кВт)':0.02,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.002,
        'wpn_cost':5000,
        }

metadict_detail['Носимый терминал с дисплеем'] = {
        'Оптические компьютеры (терминалы)':1,
        'Монокристаллический маховик малогабаритный (килограмм)':0.2,
        '--Потребление энергии (кВт)':0.02,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.002,
        'wpn_cost':10000,
        }

metadict_detail['Модульное грузовое снаряжение боевой экипировки'] = {
        'Наспинное крепление для оружия':1,
        'Разгрузочный жилет':1,
        '5-литровые патронные сумки':2,
        }

metadict_detail['Наспинное крепление для оружия'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0004,
        'wpn_cost':100,
        }

metadict_detail['Разгрузочный жилет'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0008,
        'wpn_cost':100,
        }

metadict_detail['5-литровые патронные сумки'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0005,
        'wpn_cost':50,
        }

metadict_detail['Средства жизнеобеспечения боевой экипировки'] = {
        'Индивидуальная аптечка боевая':1,
        'Индивидуальный водяной фильтр':1,
        'Маскировочный комплект пехотинца':1,
        'Питьевая система':1,
        }

metadict_detail['Индивидуальная аптечка боевая'] = {
        'Управляемый инжектор лекарственных средств':1,
        'Индивидуальный набор лекарственных средств':1,
        'Индивидуальный противохимический пакет':4,
        'Индивидуальный перевязочный пакет':4,
        'Жгут кровоостанавливающий':2,
        'Назофарингеальная трубка':1,
        }

metadict_detail['Управляемый инжектор лекарственных средств'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0003,
        'Шприц-тюбик антидота ФОВ':1,
        'Шприц-тюбик обезболивающего средства':1,
        'Шприц-тюбик психостимулирющего средства':1,
        'Шприц-тюбик антирадиационного средства':1,
        'Шприц-тюбик заживляющего средства':1,
        'wpn_cost':200,
        }

metadict_detail['Шприц-тюбик психостимулирющего средства'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.00001,
        'wpn_cost':10,
        }

metadict_detail['Шприц-тюбик антирадиационного средства'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0001,
        'Структурный гель (граммы)':10,
        'wpn_cost':30,
        }

metadict_detail['Шприц-тюбик заживляющего средства'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0001,
        'Структурный гель (граммы)':50,
        'wpn_cost':50,
        }

metadict_detail['Структурный гель (граммы)'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.000001,
        'wpn_cost':1,
        }

metadict_detail['Назофарингеальная трубка'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0001,
        'wpn_cost':20,
        }

metadict_detail['Индивидуальный водяной фильтр'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0002,
        'wpn_cost':30,
        }

metadict_detail['Маскировочный комплект пехотинца'] = {
        'Маскировочная ткань (квадратные дециметры)':400,
        }

metadict_detail['Портативная телекамера'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0003,
        'wpn_cost':500,
        }

metadict_detail['Телевизионный прицел'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0006,
        'wpn_cost':600,
        }

metadict_detail['Комплект повседневной экипировки'] = {
        'Униформа и средства защиты повседневной экипировки':1,
        'Средства связи, разведки и навигации повседневной экипировки':1,
        'Грузовое снаряжение повседневной экипировки':1,
        'Средства жизнеобеспечения повседневной экипировки':1,
        }

metadict_detail['Униформа и средства защиты повседневной экипировки'] = {
        'Комплект парадной униформы':1,
        'Комплект летней повседневной униформы':1,
        'Комплект зимней повседневной униформы':1,
        'Комплект защиты от ОМП':1,
        'Пассивные наушники':1,
        }

metadict_detail['Комплект парадной униформы'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0015,
        'wpn_cost':300,
        }

metadict_detail['Комплект летней повседневной униформы'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0015,
        'wpn_cost':300,
        }

metadict_detail['Комплект зимней повседневной униформы'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.003,
        'wpn_cost':500,
        }

metadict_detail['Комплект защиты от ОМП'] = {
        'Общевойсковой защитный комплект':1,
        'Фильтрующий противогаз':1,
        }

metadict_detail['Общевойсковой защитный комплект'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.003,
        'wpn_cost':50,
        }

metadict_detail['Фильтрующий противогаз'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.001,
        'wpn_cost':50,
        }

metadict_detail['Средства связи, разведки и навигации повседневной экипировки'] = {
        'Стробоскопический фонарь':1,
        'Бинокль':1,
        'Компас':1,
        'Часы':1,
        }

metadict_detail['Стробоскопический фонарь'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0007,
        'wpn_cost':30,
        }

metadict_detail['Бинокль'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0002,
        'wpn_cost':200,
        }

metadict_detail['Компас'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0002,
        'wpn_cost':30,
        }

metadict_detail['Часы'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0001,
        'wpn_cost':40,
        }

metadict_detail['Грузовое снаряжение повседневной экипировки'] = {
        '60-литровый рюкзак':1,
        '10-литровые перемётные сумки':2,
        }

metadict_detail['60-литровый рюкзак'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0015,
        'wpn_cost':200,
        }

metadict_detail['10-литровые перемётные сумки'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0008,
        'wpn_cost':40,
        }

metadict_detail['Средства жизнеобеспечения повседневной экипировки'] = {
        'Индивидуальная аптечка повседневная':1,
        'Упаковка влажных салфеток':1,
        'Теплоизолирующий коврик':1,
        'Многофункциональный нож':1,
        'Малая пехотная лопатка':1,
        'Палатка одноместная':1,
        'Непромокаемый плащ':1,
        'Комплект выживания':1,
        'Армейский котелок':1,
        'Спальник':1,
        }

metadict_detail['Индивидуальная аптечка повседневная'] = {
        'Индивидуальный набор лекарственных средств':1,
        'Индивидуальный противохимический пакет':4,
        'Индивидуальный перевязочный пакет':4,
        'Жгут кровоостанавливающий':1,
        }

metadict_detail['Индивидуальный набор лекарственных средств'] = {
        'Шприц-тюбик обезболивающего средства':1,
        'Шприц-тюбик антидота ФОВ':1,
        'Таблетки радиозащитного средства':1,
        'Таблетки противорвотного средства':1,
        'Таблетки антибактериального средства':1,
        'Таблетки психостимулирющего средства':1,
        }

metadict_detail['Шприц-тюбик обезболивающего средства'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.00001,
        'wpn_cost':1,
        }

metadict_detail['Шприц-тюбик антидота ФОВ'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.00001,
        'wpn_cost':1,
        }

metadict_detail['Таблетки радиозащитного средства'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.00001,
        'wpn_cost':1,
        }

metadict_detail['Таблетки противорвотного средства'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.00001,
        'wpn_cost':1,
        }

metadict_detail['Таблетки антибактериального средства'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.00001,
        'wpn_cost':1,
        }

metadict_detail['Таблетки психостимулирющего средства'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.00001,
        'wpn_cost':1,
        }

metadict_detail['Индивидуальный противохимический пакет'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.000035,
        'wpn_cost':1,
        }

metadict_detail['Индивидуальный перевязочный пакет'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.00005,
        'wpn_cost':3,
        }

metadict_detail['Жгут кровоостанавливающий'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0001,
        'wpn_cost':20,
        }

metadict_detail['Упаковка влажных салфеток'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0003,
        'wpn_cost':1,
        }

metadict_detail['Малая пехотная лопатка'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0006,
        'wpn_cost':30,
        }

metadict_detail['Комплект выживания'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0005,
        'wpn_cost':40,
        }

metadict_detail['Армейский котелок'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.00064,
        'wpn_cost':30,
        }

metadict_detail['Питьевая система'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0002,
        'wpn_cost':30,
        }

metadict_detail['Многофункциональный нож'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0003,
        'wpn_cost':200,
        }

metadict_detail['Палатка одноместная'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0015,
        'wpn_cost':200,
        }

metadict_detail['Непромокаемый плащ'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.001,
        'wpn_cost':50,
        }

metadict_detail['Спальник'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0015,
        'wpn_cost':100,
        }

metadict_detail['Теплоизолирующий коврик'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.0005,
        'wpn_cost':20,
        }
