#----
# Тактические знаки:

metadict_model['====Тактический знак авиационной эскадрильи (истребителей-бомбардировщиков)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак авиационной эскадрильи (планёров-бомбардировщиков)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак авиационной эскадрильи (противовоздушных планёров)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак авиационной эскадрильи (противотанковых планёров)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак авиационной эскадрильи (ракетных планёров)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак авиационной эскадрильи (транспортных планёров)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак авиационной эскадрильи (тяжёлых планёров)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак авиационной эскадрильи (экранолётов)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак аэромобильного дивизиона (120-мм миномётов)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак аэромобильного дивизиона (ПЗРК)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (специального назначения)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (РХБ разведки)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (военной полиции)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (войск РХБЗ)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (глубинной разведки)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (дымовых завес)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (инженерно-дорожного)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (инженерно-сапёрного)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (инженерного)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (медицинского)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (механизированного)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (мотострелкового)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (охраны тыла)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (пегасо-десантного)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (понтонно-мостового)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (радиоподавления)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (радиотехнической разведки)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (радиоэлектронной разведки)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (разведывательного)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (ремонтного)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (связи и охраны)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (связи)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (снабжения)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (танкового)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (тылового)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак батальона (штурмового)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (ЗРК большой дальности)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (ЗРК средней дальности)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (ЗРК малой дальности)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (ЗРК ближнего действия)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (МБР)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (ОТРК)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (ТРК)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (РСЗО)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (артиллерийской разведки)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (дивизионных САУ)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (дивизионных гаубиц)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (зенитной разведки)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (полковых САУ)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['====Тактический знак дивизиона (полковых гаубиц)'] = {
        'Цикл НОРД батальона (в сутки)':3,
        '====Тактические знаки батальонов':1,
        }

metadict_model['===Тактический знак авиационной роты (РХБ разведки)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак авиационной роты (миномётов)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак авиационной роты (планёров-бомбардировщиков)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак авиационной роты (противовоздушной)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак авиационной роты (противовоздушных планёров)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак авиационной роты (противотанковой)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак авиационной роты (противотанковых планёров)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак авиационной роты (разведывательной)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак авиационной роты (ракетных планёров)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак авиационной роты (снабжения)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак авиационной роты (тяжёлого оружия)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (ОТРК)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (РСЗО)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (ТРК)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (артиллерийской разведки)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (батальонных САУ)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (дивизионных САУ)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (дивизионных гаубиц)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (ЗРК ближнего действия)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (ЗРК малой дальности)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (ЗРК средней дальности)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (полковых САУ)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак батареи (полковых гаубиц)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (мобильная АЭС)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (понтонно-мостовой)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (РХБ разведки)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (боевых роботов)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (военной полиции)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (охраны тыла)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (войск РХБЗ)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (десантно-штурмовой)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (диверсионно-разведывательной)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (инженерно-сапёрной)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (инженерной)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (медицинской)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (передовой)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (понтонной)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (радиолокаицонной разведки)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (радиотехнической разведки)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (радиоэлектронного подавления)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (радиоэлектронной разведки)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (разведывательной)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (разведывательных БПЛА)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (ремонтной)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (сапёрной)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (связи)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (специального назначения)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (танковой)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (тыловой)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['===Тактический знак роты (штурмовой)'] = {
        'Цикл НОРД роты (в сутки)':6,
        '===Тактические знаки рот':1,
        }

metadict_model['==Тактический знак авиационного взвода (РХБ разведки)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (автоматических гранатомётов)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (военной полиции)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (планёров-бомбардировщиков)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (противовоздушных планёров)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (противотанкового)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (противотанковых планёров)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (пулемётного)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (разведывательного)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (ракетных планёров)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (снабжения)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного взвода (снайперского)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного звена (истребителей-бомбардировщиков)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак авиационного звена (экранолётов)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак аэромобильного огневого взвода (миномётного)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (ЗРПК)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (РХБ защиты)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (РХБ разведки)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (боевых роботов)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (военной полиции)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (охраны тыла)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (десантно-штурмового)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (диверсионно-разведывательного)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (звукометрической разведки)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (инженерного взвода)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (инженерной разведки)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (медицинского)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (метеорологического взвода)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (механизированного)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (механизированных мостов)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (мотострелкового)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (пегасо-десантного)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (понтонно-мостового)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (радиотехнической разведки)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (радиоэлектронного подавления)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (радиоэлектронной разведки)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (разведывательного)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (разведывательных БПЛА)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (ремонтный)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (роботов РЭБ)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (сапёрного)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (связи)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (снабжение)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (специального назначения)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (танкового)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (топогеодезического)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (тылового)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак взвода (тяжёлого оружия)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак огневого взвода (210-мм РСЗО)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак огневого взвода (120-мм САУ)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак огневого взвода (150-мм САУ)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак огневого взвода (120-мм гаубиц)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак огневого взвода (150-мм гаубиц)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['==Тактический знак огневого взвода (самоходных миномётов)'] = {
        'Цикл НОРД взвода (в сутки)':6,
        '==Тактические знаки взводов':1,
        }

metadict_model['=Тактический знак авиационного отделения (автоматических гранатомётов)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (военной полиции)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (медицинского)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (планёров-бомбардировщиков)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (противовоздушных планёров)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (противотанкового)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (противотанковых планёров)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (пулемётного)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (разведывательного)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (ракетных планёров)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (сапёрного)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (снабжения)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационного отделения (снайперского)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационной единицы (экранолёт)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак авиационной пары (истребителей)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак боевой бронированной машины (БМП)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак боевой бронированной машины (БРМ)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак боевой бронированной машины (ЗРПК)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак боевой бронированной машины (танк)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак ЗРК (ближнего действия)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак ЗРК (малой дальности)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак ЗРК (средней дальности)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак ЗРК (большой дальности)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак артиллерии (120-мм миномёт)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак артиллерии (120-мм САУ)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак артиллерии (150-мм САУ)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак артиллерии (120-мм гаубица)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак артиллерии (150-мм гаубица)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак артиллерии (210-мм РСЗО)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак артиллерии (ПУ МБР)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак артиллерии (ПУ ОТРК)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак артиллерии (ПУ ТРК)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (БПЛА)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (РХБ защиты)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (РХБ разведка)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (РХБ разведки)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (автоматических гранатомётов)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (военной полиции)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (охраны тыла)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (диверсионно-разведывательного)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (звукометрической разведки)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (инженерного)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (инженерной разведки)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (лёгкой пехоты)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (механизированных мостов)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (пулемётного)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (радиолокационного)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (радиотехнической разведки)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (радиоэлектронного подавления)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (радиоэлектронной разведки)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (разведывательного)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (сапёров)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (связи)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (снабжения)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (специального назначения)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (топогеодезического)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

metadict_model['=Тактический знак отделения (тылового)'] = {
        'Цикл НОРД отделения (в сутки)':12,
        '=Тактические знаки отделений':1,
        }

#----
# Обработка тактических знаков:



#metadict_model['====Тактические знаки батальонов'] = {
#        'Тактические знаки батальонов':1,
#        'Пометки на рабочих картах батальонов':12,
#        'Разведка батальонов противника':3,
#        }
#
#metadict_model['===Тактические знаки рот'] = {
#        'Тактические знаки рот':1,
#        'Пометки систем огня рот':12,
#        'Разведка рот противника':3,
#        }
#
#metadict_model['==Тактические знаки взводов'] = {
#        'Тактические знаки взводов':1,
#        'Пометки систем огня взводов':12,
#        'Разведка взводов противника':3,
#        }
#
#metadict_model['=Тактические знаки отделений'] = {
#        'Тактические знаки отделений':1,
#        'Пометки систем огня отделений':12,
#        'Разведка отделений противника':3,
#        }
#
#
#metadict_model['Тактические знаки батальонов'] = {
#        'Нанесение тактических знаков батальонов (минут)':0.2,
#        }
#
#metadict_model['Тактические знаки рот'] = {
#        'Нанесение тактических знаков рот (минут)':0.2,
#        }
#
#metadict_model['Тактические знаки взводов'] = {
#        'Нанесение тактических знаков взводов (минут)':0.2,
#        }
#
#metadict_model['Тактические знаки отделений'] = {
#        'Нанесение тактических знаков отделений (минут)':0.2,
#        }
#
#metadict_model['Пометки на рабочих картах батальонов'] = {
#        'Нанесение тактических знаков батальонов (минут)':0.2,
#        }
#
#metadict_model['Пометки систем огня рот'] = {
#        'Нанесение тактических знаков рот (минут)':0.2,
#        }
#
#metadict_model['Пометки систем огня взводов'] = {
#        'Нанесение тактических знаков взводов (минут)':0.2,
#        }
#
#metadict_model['Пометки систем огня отделений'] = {
#        'Нанесение тактических знаков отделений (минут)':0.2,
#        }
#
#metadict_model['Разведка батальонов противника'] = {
#        'Нанесение тактических знаков батальонов (минут)':0.2,
#        }
#
#metadict_model['Разведка рот противника'] = {
#        'Нанесение тактических знаков рот (минут)':0.2,
#        }
#
#metadict_model['Разведка взводов противника'] = {
#        'Нанесение тактических знаков взводов (минут)':0.2,
#        }
#
#metadict_model['Разведка отделений противника'] = {
#        'Нанесение тактических знаков отделений (минут)':0.2,
#        }

#----
# Циклы НОРД:

metadict_model['Цикл НОРД батальона (в сутки)'] = {
        # Наблюдение
        'Боевой приказ батальона (минут)':40,
        # Ориентация
        'Тактические знаки батальонов':1,
        'Пометки на рабочих картах батальонов':12,
        'Разведка батальонов противника':3,
        # Решение
        'Организация работы батальона (минут)':160,
        # Действие
        'Боевой приказ батальону (минут)':40,
        }

metadict_model['Цикл НОРД роты (в сутки)'] = {
        'Боевой приказ роты (минут)':20,
        'Тактические знаки рот':1,
        'Пометки систем огня рот':12,
        'Разведка рот противника':3,
        'Организация работы роты (минут)':80,
        'Боевой приказ роте (минут)':20,
        }

metadict_model['Цикл НОРД взвода (в сутки)'] = {
        'Боевой приказ взвода (минут)':10,
        'Тактические знаки взводов':1,
        'Пометки систем огня взводов':12,
        'Разведка взводов противника':3,
        'Организация работы взвода (минут)':40,
        'Боевой приказ взводу (минут)':10,
        }

metadict_model['Цикл НОРД отделения (в сутки)'] = {
        'Боевой приказ отделения (минут)':10,
        'Тактические знаки отделений':1,
        'Пометки систем огня отделений':12,
        'Разведка отделений противника':3,
        'Организация работы отделения (минут)':40,
        'Боевой приказ отделению (минут)':10,
        }



metadict_model['Тактические знаки батальонов'] = {
        'Нанесение тактических знаков батальонов (минут)':0.2,
        }

metadict_model['Тактические знаки рот'] = {
        'Нанесение тактических знаков рот (минут)':0.2,
        }

metadict_model['Тактические знаки взводов'] = {
        'Нанесение тактических знаков взводов (минут)':0.2,
        }

metadict_model['Тактические знаки отделений'] = {
        'Нанесение тактических знаков отделений (минут)':0.2,
        }

metadict_model['Пометки на рабочих картах батальонов'] = {
        'Нанесение тактических знаков батальонов (минут)':0.2,
        }

metadict_model['Пометки систем огня рот'] = {
        'Нанесение тактических знаков рот (минут)':0.2,
        }

metadict_model['Пометки систем огня взводов'] = {
        'Нанесение тактических знаков взводов (минут)':0.2,
        }

metadict_model['Пометки систем огня отделений'] = {
        'Нанесение тактических знаков отделений (минут)':0.2,
        }

metadict_model['Разведка батальонов противника'] = {
        'Нанесение тактических знаков батальонов (минут)':0.2,
        }

metadict_model['Разведка рот противника'] = {
        'Нанесение тактических знаков рот (минут)':0.2,
        }

metadict_model['Разведка взводов противника'] = {
        'Нанесение тактических знаков взводов (минут)':0.2,
        }

metadict_model['Разведка отделений противника'] = {
        'Нанесение тактических знаков отделений (минут)':0.2,
        }





metadict_model['Боевой приказ батальону (минут)'] = {
        '-Нагрузка командования батальона (часов/день)':0.0167,
        '-Нагрузка делопроизводителей батальона (часов/день)':0.0167,
        '-Нагрузка связистов батальона (часов/день)':0.0167,
        }

metadict_model['Боевой приказ батальона (минут)'] = {
        '-Нагрузка командования батальона (часов/день)':0.0167,
        '-Нагрузка делопроизводителей батальона (часов/день)':0.0167,
        '-Нагрузка связистов батальона (часов/день)':0.0167,
        }

metadict_model['Боевой приказ роте (минут)'] = {
        '-Нагрузка командования роты (часов/день)':0.0167,
        '-Нагрузка связистов батальона (часов/день)':0.0167,
        }

metadict_model['Боевой приказ роты (минут)'] = {
        '-Нагрузка командования роты (часов/день)':0.0167,
        '-Нагрузка связиста роты (часов/день)':0.0167,
        }

metadict_model['Боевой приказ взводу (минут)'] = {
        '-Нагрузка командования взвода (часов/день)':0.0167,
        '-Нагрузка связиста роты (часов/день)':0.0167,
        }

metadict_model['Боевой приказ взвода (минут)'] = {
        '-Нагрузка командования взвода (часов/день)':0.0167,
        }

metadict_model['Боевой приказ отделению (минут)'] = {
        '-Нагрузка командования взвода (часов/день)':0.0167,
        }

metadict_model['Боевой приказ отделения (минут)'] = {
        '-Нагрузка командира отделения (часов/день)':0.0167,
        }



metadict_model['Нанесение тактических знаков батальонов (минут)'] = {
        '-Нагрузка начальника штаба батальона (часов/день)':0.0167,
        }

metadict_model['Нанесение тактических знаков рот (минут)'] = {
        '-Нагрузка начальника штаба батальона (часов/день)':0.0167,
        '-Нагрузка командования роты (часов/день)':0.0167,
        }

metadict_model['Нанесение тактических знаков взводов (минут)'] = {
        '-Нагрузка начальника штаба батальона (часов/день)':0.0167,
        '-Нагрузка командования роты (часов/день)':0.0167,
        '-Нагрузка командования взвода (часов/день)':0.0167,
        }

metadict_model['Нанесение тактических знаков отделений (минут)'] = {
        '-Нагрузка командования роты (часов/день)':0.0167,
        '-Нагрузка командования взвода (часов/день)':0.0167,
        '-Нагрузка командира отделения (часов/день)':0.0167,
        }



metadict_model['Организация работы батальона (минут)'] = {
        '-Нагрузка начальника штаба батальона (часов/день)':0.0167,
        }

metadict_model['Организация работы взвода (минут)'] = {
        '-Нагрузка командования взвода (часов/день)':0.0167,
        }

metadict_model['Организация работы отделения (минут)'] = {
        '-Нагрузка командира отделения (часов/день)':0.0167,
        }

metadict_model['Организация работы роты (минут)'] = {
        '-Нагрузка командования роты (часов/день)':0.0167,
        }




metadict_model['-Нагрузка делопроизводителей батальона (часов/день)'] = {
        '-Нагрузка штаба батальона (часов/день)':1,
        }

metadict_model['-Нагрузка командования батальона (часов/день)'] = {
        '-Нагрузка штаба батальона (часов/день)':1,
        }

metadict_model['-Нагрузка связиста роты (часов/день)'] = {
        '-Нагрузка связистов (часов/день)':1,
        }

metadict_model['-Нагрузка связистов батальона (часов/день)'] = {
        '-Нагрузка связистов (часов/день)':1,
        }

metadict_model['-Нагрузка начальника штаба батальона (часов/день)'] = {
        '-Нагрузка штаба батальона (часов/день)':1,
        }


