#----
# Генеральный штаб:

metadict_army['Генеральный штаб'] = {
        'Командование Генерального штаба':1,
        'Главное оперативное управление':1,
        'Главное разведывательное управление':1,
        'Главное организационное управление':1,
        'Военно-научное управление':1,
        'Управление военных сообщений':1,
        'Управление материально-технического обеспечения':1,
        'Военно-топографическое управление':1,
        'Главное управление связи':1,
        'Центральный командный пункт Генерального штаба':1,
        }

metadict_army['Главное оперативное управление'] = {
        'Командование управления Генерального штаба':1,
        'Оперативное управление направлений':1,
        'Управление авиации и противовоздушной обороны':1,
        'Самостоятельные отделы главного оперативного управления':1,
        'Канцелярия Генерального штаба':1,
        }

metadict_army['Оперативное управление направлений'] = {
        'Южное направление':1,
        'Северное направление':1,
        'Юго-восточное направление':1,
        'Юго-западное направление':1,
        'Западно-восточное океанское направление':1,
        'Направление внутренних военных округов':1,
        'Отдел дислокации и оперативного учёта войск':1,
        'Секретное отделение Генерального штаба':1,
        }

metadict_army['Управление авиации и противовоздушной обороны'] = {
        'Авиационный отдел':1,
        'Отдел противовоздушной обороны':1,
        'Секретное отделение Генерального штаба':1,
        }

metadict_army['Самостоятельные отделы главного оперативного управления'] = {
        'Отдел планирования оперативной подготовки':1,
        'Отдел по извучению и подготовке театра военных действий':1,
        'Морской отдел главного оперативного управления':1,
        }

metadict_army['Главное разведывательное управление'] = {
        'Командование управления Генерального штаба':1,
        'Управление стратегической разведки':1,
        'Управление информации сухопутных войск и военно-воздушных сил':1,
        'Самостоятельные отделы главного разведывательного управления':1,
        }

metadict_army['Управление стратегической разведки'] = {
        'Зебриканский отдел':1,
        'Восточно-океанский отдел':1,
        }

metadict_army['Управление информации сухопутных войск и военно-воздушных сил'] = {
        'Зебриканский отдел информации':1,
        'Восточно-океанский отдел информации':1,
        'Кристально-имперский отдел информации':1,
        'Отдел информации военно-воздушных сил':1,
        }

metadict_army['Самостоятельные отделы главного разведывательного управления'] = {
        'Отдел военно-морской стратегической разведки':1,
        'Специальный отдел ГРУ':1,
        'Отдел военно-морской информации':1,
        'Военно-технический отдел ГРУ':1,
        'Отдел военной экономики и театра военных действий':1,
        'Отдел радиоразведки и радиотехнической разведки':1,
        'Отдел оперативно-агентурной разведки':1,
        'Отдел кадров ГРУ':1,
        'Отдел внешних сношений ГРУ':1,
        'Финансовый отдел ГРУ':1,
        'Шифровальный отдел ГРУ':1,
        'Политический отдел ГРУ':1,
        'Отдел оперативной техники':1,
        'Особая группа ГРУ':1,
        'Отделение обработки документов ГРУ':1,
        'Отделение радиосвязи ГРУ':1,
        'Учётно-архивное отделение ГРУ':1,
        'Редакционно-издательское отделение':1,
        'Административно-хозяйственное отделение ГРУ':1,
        }

metadict_army['Главное организационное управление'] = {
        'Командование управления Генерального штаба':1,
        'Мобилизационное управление':1,
        'Управление укомплектования и службы войск':1,
        'Самостоятельные отделы главного организационного управления':1,
        }

metadict_army['Организационное управление'] = {
        'Организационно-плановый отдел':1,
        'Отдел сухопутных войск':1,
        'Отдел военно-воздушных сил':1,
        'Отдел военно-морских сил':1,
        'Отдел технических войск и специальных частей':1,
        'Отдел органов управления':1,
        'Отдел военно-учебных заведений':1,
        'Отдел тыловых частей и учреждений':1,
        'Секретное отделение Генерального штаба':1,
        'Административно-хозяйственная часть Генерального штаба':1,
        }

metadict_army['Мобилизационное управление'] = {
        'Мобилизационно-плановый отдел':1,
        'Отдел укомплектования личным составом запаса':1,
        'Отдел комплектования мехтранспортом и дорожно-строительной техникой':1,
        'Отдел учета военнообязанных запаса и бронирования':1,
        'Мобилизационно-инспекторский отдел':1,
        'Секретное отделение Генерального штаба':1,
        'Административно-хозяйственная часть Генерального штаба':1,
        }

metadict_army['Управление укомплектования и службы войск'] = {
        'Отдел укомплектования':1,
        'Отдел службы войск':1,
        'Отдел по выездам за границу':1,
        'Секретное отделение Генерального штаба':1,
        'Административно-хозяйственная часть Генерального штаба':1,
        }

metadict_army['Самостоятельные отделы главного организационного управления'] = {
        'Отдел учёта численности войск':1,
        'Отдел по персональному учёту потерь сержантов и солдат':1,
        'Административно-хозяйственная часть Генерального штаба':1,
        }

metadict_army['Военно-научное управление'] = {
        'Командование управления Генерального штаба':1,
        'Отдел по исследованию вопросов военного искусства':1,
        'Военно-исторический отдел':1,
        'Уставной отдел военно-научного управления':1,
        'Отдел по планированию военно-научной работы':1,
        'Редакционно-издательское отделение':1,
        'Военно-научная библиотека Генерального штаба':1,
        'Секретное отделение Генерального штаба':1,
        'Административно-хозяйственная часть Генерального штаба':1,
        }

metadict_army['Управление военных сообщений'] = {
        'Командование управления Генерального штаба':1,
        'Отдел планирования железнодорожных перевозок':1,
        'Отдел воздушных перевозок':1,
        'Отдел эшелонных перевозок':1,
        'Отдел грузовых перевозок':1,
        'Отдел водных перевозок':1,
        'Мобилизационно-технический отдел':1,
        'Отдел оперативных и мобилизационных перевозок':1,
        'Отдел боевой подготовки управления военных сообщений':1,
        'Военно-научный отдел управления военных сообщений':1,
        'Инспекция управления военных сообщений':1,
        'Отделение кадров управления военных сообщений':1,
        'Финансовое отделение управления военных сообщений':1,
        'Секретное отделение Генерального штаба':1,
        'Административно-хозяйственная часть Генерального штаба':1,
        }

metadict_army['Управление материально-технического обеспечения'] = {
        'Командование управления Генерального штаба':1,
        'Мобилизационно-плановый отдел вооружения и материально-технического обеспечения':1,
        'Отдел мобилизационного планирования артиллерийского вооружения':1,
        'Отдел мобилизационного планирования бронетанкового вооружения':1,
        'Отдел мобилизационного планирования военной техники':1,
        'Отдел мобилизационного планирования авиатехники':1,
        'Отдел мобилизационного планирования ГСМ':1,
        'Отдел мобилизационного планирования интендантского и медицинского имущества':1,
        'Отдел мобилизационного планирования техники морского флота':1,
        'Отдел опытно-конструкторских и научно-исследовательских работ':1,
        'Секретное отделение Генерального штаба':1,
        'Административно-хозяйственная часть Генерального штаба':1,
        }

metadict_army['Военно-топографическое управление'] = {
        'Командование управления Генерального штаба':1,
        'Организационно-плановый отдел военно-топографического управления':1,
        'Отдел топогеодезический и картографический':1,
        'Отдел обеспечения войск топографическими картами и специально-техническим вооружением':1,
        'Отдел кадров и топографической подготовки войск':1,
        'Финансовое отделение военно-топографического управления':1,
        'Секретное отделение Генерального штаба':1,
        'Административно-хозяйственная часть Генерального штаба':1,
        }

metadict_army['Главное управление связи'] = {
        'Командование управления Генерального штаба':1,
        'Организационно-плановый отдел':1,
        'Отдел обеспечения шифросвязью по направлениям':1,
        'Инспекторский отдел главного управления связи':1,
        'Специальный отдел главного управления связи':1,
        'Отдел по эксплуатации оборудования связи':1,
        'Отдел кадров, боевой и специальной подготовки главного управления связи':1,
        'Секретное отделение Генерального штаба':1,
        'Административно-хозяйственная часть Генерального штаба':1,
        }

metadict_army['Самостоятельные отделы Генерального штаба'] = {
        'Отдел связи Генерального штаба':1,
        'Узел связи Генерального штаба':1,
        'Отдел военой цензуры Генерального штаба':1,
        'Политический отдел Генерального штаба':1,
        'Отдел кадров Генерального штаба':1,
        'Архивная служба Генерального штаба':1,
        'Библиотека Генерального штаба':1,
        'Административно-хозяйственный отдел Генерального штаба':1,
        }

metadict_army['Авиационный отдел'] = {
        'Военнослужащий Генерального штаба':23,
        }

metadict_army['Административно-хозяйственная часть Генерального штаба'] = {
        'Военнослужащий Генерального штаба':2,
        'Служащий Генерального штаба':2,
        }

metadict_army['Административно-хозяйственное отделение ГРУ'] = {
        'Военнослужащий Генерального штаба':19,
        'Служащий Генерального штаба':16,
        }

metadict_army['Военно-исторический отдел'] = {
        'Военнослужащий Генерального штаба':41,
        'Служащий Генерального штаба':1,
        }

metadict_army['Военно-научная библиотека Генерального штаба'] = {
        'Военнослужащий Генерального штаба':2,
        'Служащий Генерального штаба':12,
        }

metadict_army['Военно-научный отдел управления военных сообщений'] = {
        'Военнослужащий Генерального штаба':18,
        'Служащий Генерального штаба':1,
        }

metadict_army['Военно-технический отдел ГРУ'] = {
        'Военнослужащий Генерального штаба':20,
        }

metadict_army['Восточно-океанский отдел'] = {
        'Военнослужащий Генерального штаба':20,
        }

metadict_army['Восточно-океанский отдел информации'] = {
        'Военнослужащий Генерального штаба':20,
        }

metadict_army['Западно-восточное океанское направление'] = {
        'Военнослужащий Генерального штаба':15,
        }

metadict_army['Зебриканский отдел'] = {
        'Военнослужащий Генерального штаба':25,
        }

metadict_army['Зебриканский отдел информации'] = {
        'Военнослужащий Генерального штаба':20,
        }

metadict_army['Инспекторский отдел главного управления связи'] = {
        'Военнослужащий Генерального штаба':30,
        }

metadict_army['Инспекция управления военных сообщений'] = {
        'Военнослужащий Генерального штаба':3,
        }

metadict_army['Канцелярия Генерального штаба'] = {
        'Военнослужащий Генерального штаба':20,
        'Военнослужащий Генерального штаба':3,
        }

metadict_army['Командование Генерального штаба'] = {
        'Начальник Генерального штаба':1,
        'Заместитель начальника Генерального штаба':2,
        }

metadict_army['Командование управления Генерального штаба'] = {
        'Начальник управления Генерального штаба':1,
        'Заместитель начальника управления Генерального штаба':2,
        }

metadict_army['Кристально-имперский отдел информации'] = {
        'Военнослужащий Генерального штаба':15,
        }

metadict_army['Мобилизационно-инспекторский отдел'] = {
        'Военнослужащий Генерального штаба':16,
        }

metadict_army['Мобилизационно-плановый отдел'] = {
        'Военнослужащий Генерального штаба':27,
        }

metadict_army['Мобилизационно-плановый отдел вооружения и материально-технического обеспечения'] = {
        'Военнослужащий Генерального штаба':43,
        }

metadict_army['Мобилизационно-технический отдел'] = {
        'Военнослужащий Генерального штаба':32,
        }

metadict_army['Морской отдел главного оперативного управления'] = {
        'Военнослужащий Генерального штаба':12,
        }

metadict_army['Направление внутренних военных округов'] = {
        'Военнослужащий Генерального штаба':15,
        }

metadict_army['Организационно-плановый отдел'] = {
        'Военнослужащий Генерального штаба':30,
        }

metadict_army['Организационно-плановый отдел военно-топографического управления'] = {
        'Военнослужащий Генерального штаба':18,
        'Служащий Генерального штаба':1,
        }

metadict_army['Отдел информации военно-воздушных сил'] = {
        'Военнослужащий Генерального штаба':14,
        }

metadict_army['Отдел боевой подготовки управления военных сообщений'] = {
        'Военнослужащий Генерального штаба':18,
        'Служащий Генерального штаба':1,
        }

metadict_army['Особая группа ГРУ'] = {
        'Военнослужащий Генерального штаба':17,
        'Служащий Генерального штаба':1,
        }

metadict_army['Отдел внешних сношений ГРУ'] = {
        'Военнослужащий Генерального штаба':10,
        'Служащий Генерального штаба':3,
        }

metadict_army['Отдел водных перевозок'] = {
        'Военнослужащий Генерального штаба':17,
        }

metadict_army['Отдел военно-морской информации'] = {
        'Военнослужащий Генерального штаба':33,
        'Служащий Генерального штаба':3,
        }

metadict_army['Отдел военно-морской стратегической разведки'] = {
        'Военнослужащий Генерального штаба':24,
        'Служащий Генерального штаба':1,
        }

metadict_army['Отдел военной экономики и театра военных действий'] = {
        'Военнослужащий Генерального штаба':40,
        }

metadict_army['Отдел воздушных перевозок'] = {
        'Военнослужащий Генерального штаба':30,
        }

metadict_army['Отдел грузовых перевозок'] = {
        'Военнослужащий Генерального штаба':25,
        }

metadict_army['Отдел дислокации и оперативного учёта войск'] = {
        'Военнослужащий Генерального штаба':10,
        }

metadict_army['Отдел кадров ГРУ'] = {
        'Военнослужащий Генерального штаба':40,
        'Служащий Генерального штаба':22,
        }

metadict_army['Отдел кадров и топографической подготовки войск'] = {
        'Военнослужащий Генерального штаба':14,
        'Служащий Генерального штаба':2,
        }

metadict_army['Отделение кадров управления военных сообщений'] = {
        'Военнослужащий Генерального штаба':3,
        'Служащий Генерального штаба':1,
        }

metadict_army['Отдел кадров, боевой и специальной подготовки главного управления связи'] = {
        'Военнослужащий Генерального штаба':16,
        }

metadict_army['Отдел комплектования мехтранспортом и дорожно-строительной техникой'] = {
        'Военнослужащий Генерального штаба':9,
        }

metadict_army['Отдел мобилизационного планирования ГСМ'] = {
        'Военнослужащий Генерального штаба':10,
        }

metadict_army['Отдел мобилизационного планирования авиатехники'] = {
        'Военнослужащий Генерального штаба':20,
        }

metadict_army['Отдел мобилизационного планирования артиллерийского вооружения'] = {
        'Военнослужащий Генерального штаба':19,
        }

metadict_army['Отдел мобилизационного планирования бронетанкового вооружения'] = {
        'Военнослужащий Генерального штаба':13,
        }

metadict_army['Отдел мобилизационного планирования военной техники'] = {
        'Военнослужащий Генерального штаба':14,
        }

metadict_army['Отдел мобилизационного планирования интендантского и медицинского имущества'] = {
        'Военнослужащий Генерального штаба':14,
        }

metadict_army['Отдел мобилизационного планирования техники морского флота'] = {
        'Военнослужащий Генерального штаба':12,
        }

metadict_army['Отдел обеспечения войск топографическими картами и специально-техническим вооружением'] = {
        'Военнослужащий Генерального штаба':20,
        'Служащий Генерального штаба':13,
        }

metadict_army['Отдел обеспечения шифросвязью по направлениям'] = {
        'Военнослужащий Генерального штаба':130,
        }

metadict_army['Отдел оперативно-агентурной разведки'] = {
        'Военнослужащий Генерального штаба':17,
        'Служащий Генерального штаба':2,
        }

metadict_army['Отдел оперативной техники'] = {
        'Военнослужащий Генерального штаба':17,
        'Служащий Генерального штаба':5,
        }

metadict_army['Отдел оперативных и мобилизационных перевозок'] = {
        'Военнослужащий Генерального штаба':20,
        'Служащий Генерального штаба':2,
        }

metadict_army['Отдел опытно-конструкторских и научно-исследовательских работ'] = {
        'Военнослужащий Генерального штаба':20,
        }

metadict_army['Отдел планирования железнодорожных перевозок'] = {
        'Военнослужащий Генерального штаба':19,
        }

metadict_army['Отдел планирования оперативной подготовки'] = {
        'Военнослужащий Генерального штаба':18,
        'Служащий Генерального штаба':1,
        }

metadict_army['Отдел по выездам за границу'] = {
        'Военнослужащий Генерального штаба':17,
        'Служащий Генерального штаба':8,
        }

metadict_army['Отдел по извучению и подготовке театра военных действий'] = {
        'Военнослужащий Генерального штаба':28,
        'Служащий Генерального штаба':1,
        }

metadict_army['Отдел по исследованию вопросов военного искусства'] = {
        'Военнослужащий Генерального штаба':34,
        }

metadict_army['Отдел по персональному учёту потерь сержантов и солдат'] = {
        'Военнослужащий Генерального штаба':17,
        'Служащий Генерального штаба':52,
        }

metadict_army['Отдел по планированию военно-научной работы'] = {
        'Военнослужащий Генерального штаба':6,
        }

metadict_army['Отдел по эксплуатации оборудования связи'] = {
        'Военнослужащий Генерального штаба':9,
        }

metadict_army['Отдел противовоздушной обороны'] = {
        'Военнослужащий Генерального штаба':17,
        }

metadict_army['Отдел радиоразведки и радиотехнической разведки'] = {
        'Военнослужащий Генерального штаба':31,
        'Служащий Генерального штаба':7,
        }

metadict_army['Отдел радиоразведки и радиотехнической разведки'] = {
        'Военнослужащий Генерального штаба':29,
        }

metadict_army['Отдел топогеодезический и картографический'] = {
        'Военнослужащий Генерального штаба':22,
        'Служащий Генерального штаба':2,
        }

metadict_army['Отдел укомплектования'] = {
        'Военнослужащий Генерального штаба':29,
        }

metadict_army['Отдел укомплектования личным составом запаса'] = {
        'Военнослужащий Генерального штаба':27,
        }

metadict_army['Отдел учета военнообязанных запаса и бронирования'] = {
        'Военнослужащий Генерального штаба':14,
        }

metadict_army['Отдел службы войск'] = {
        'Военнослужащий Генерального штаба':29,
        }

metadict_army['Отдел учёта численности войск'] = {
        'Военнослужащий Генерального штаба':54,
        'Служащий Генерального штаба':5,
        }

metadict_army['Отдел эшелонных перевозок'] = {
        'Военнослужащий Генерального штаба':17,
        }

metadict_army['Отделение обработки документов ГРУ'] = {
        'Военнослужащий Генерального штаба':32,
        'Служащий Генерального штаба':45,
        }

metadict_army['Отделение радиосвязи ГРУ'] = {
        'Военнослужащий Генерального штаба':7,
        'Служащий Генерального штаба':2,
        }

metadict_army['Учётно-архивное отделение ГРУ'] = {
        'Военнослужащий Генерального штаба':15,
        'Служащий Генерального штаба':6,
        }

metadict_army['Политический отдел ГРУ'] = {
        'Военнослужащий Генерального штаба':15,
        'Служащий Генерального штаба':5,
        }

metadict_army['Редакционно-издательское отделение'] = {
        'Военнослужащий Генерального штаба':24,
        'Служащий Генерального штаба':13,
        }

metadict_army['Северное направление'] = {
        'Военнослужащий Генерального штаба':15,
        }

metadict_army['Секретное отделение Генерального штаба'] = {
        'Военнослужащий Генерального штаба':10,
        'Служащий Генерального штаба':12,
        }

metadict_army['Специальный отдел ГРУ'] = {
        'Военнослужащий Генерального штаба':48,
        'Служащий Генерального штаба':4,
        }

metadict_army['Специальный отдел главного управления связи'] = {
        'Военнослужащий Генерального штаба':13,
        }

metadict_army['Уставной отдел военно-научного управления'] = {
        'Военнослужащий Генерального штаба':31,
        }

metadict_army['Финансовое отделение военно-топографического управления'] = {
        'Военнослужащий Генерального штаба':4,
        'Служащий Генерального штаба':2,
        }

metadict_army['Финансовое отделение управления военных сообщений'] = {
        'Военнослужащий Генерального штаба':10,
        'Служащий Генерального штаба':3,
        }

metadict_army['Финансовый отдел ГРУ'] = {
        'Военнослужащий Генерального штаба':20,
        'Служащий Генерального штаба':3,
        }

metadict_army['Шифровальный отдел ГРУ'] = {
        'Военнослужащий Генерального штаба':77,
        'Служащий Генерального штаба':10,
        }

metadict_army['Юго-восточное направление'] = {
        'Военнослужащий Генерального штаба':20,
        }

metadict_army['Юго-западное направление'] = {
        'Военнослужащий Генерального штаба':25,
        }

metadict_army['Южное направление'] = {
        'Военнослужащий Генерального штаба':20,
        }

#----
# Управление родов и видов войск:

metadict_army['Управление ракетных войск'] = {
        'Главный штаб РВСН':1,
        'Центральный узел связи':1,
        'Центральный командный пункт РВСН':1,
        'Запасной центральный командный пункт РВСН':1,
        'Центр автоматической системы управления РВСН':1,
        'Центральный научно-исследовательский институт РВСН':1,
        'Управление эксплуатации ракетного вооружения':1,
        'Главное управление ракетного вооружения':1,
        'Инженерная служба РВСН':1,
        'Управление связи':1,
        'Академия РВСН':1,
        'Тыл РВСН':1,
        }

metadict_army['Обеспечение ракетных войск'] = {
        'Арсенал РВСН':3,
        }

#----
# Управление групп армий, фронтов, округов:

metadict_army['Управление группы армий'] = {
        'Командование группы армий':1,
        'Штаб группы армий':1,
        'Канцелярия группы армий':1,
        }

metadict_army['Штаб группы армий'] = {
        'Управление ПВО группы армий':1,
        'Управление вооружения группы армий':1,
        'Управление войск связи группы армий':1,
        'Разведывательное управление группы армий':1,
        'Управление инженерных войск группы армий':1,
        'Управление войск химической защиты группы армий':1,
        'Управление медицинской службы группы армий':1,
        }

#----
# Управление армий, флотов:

metadict_army['Управление Тандерхеда'] = {
        'Командование Тандерхеда':1,
        'Штурманская Тандерхеда':1,
        'Штаб Тандерхеда':1,
        'Тыл Тандерхеда':1,
        'Канцелярия Тандерхеда':1,
        }

metadict_army['Штурманская Тандерхеда'] = {
        'Штурман Тандерхеда':1,
        'Заместитель командира боевой части':1,
        'Навигационная группа':1,
        }

metadict_army['Управление армии'] = {
        'Командование армии':1,
        'Штаб армии':1,
        'Тыл армии':1,
        }

metadict_army['Штаб армии'] = {
        'Начальник штаба армии':0,
        'Оперативный отдел штаба армии':1,
        'Отдел авиации армии':1,
        'Отдел инженерных войск армии':1,
        'Отдел ракетных войск и артиллерии армии':1,
        'Отдел противовоздушной обороны армии':1,
        'Канцелярия армии':1,
        }

metadict_army['Оперативный отдел штаба армии'] = {
        'Заместитель начальника штаба армии':0,
        'Отдел связи армии':1,
        'Отдел химической защиты армии':1,
        'Отдел военной полиции армии':1,
        'Разведывательный отдел армии':1,
        'Топогеодезическая служба армии':1,
        'Метеорологическая служба армии':1,
        }

metadict_army['Канцелярия армии'] = {
        'Начальник канцелярии армии':1,
        'Отдел кадров армии':1,
        'Шифровальный отдел армии':1,
        'Административно-хозяйственный отдел армии':1,
        'Отдел воспитательной работы армии':1,
        'Отдел боевой подготовки армии':1,
        'Военно-юридическая служба армии':1,
        }

metadict_army['Тыл армии'] = {
        'Начальник тыла армии':0,
        'Заместитель начальника тыла армии':0,
        'Квартирно-эксплуатационная служба армии':1,
        'Продовольственная служба армии':1,
        'Медицинская служба армии':1,
        'Служба химической защиты армии':1,
        'Финансовая служба армии':1,
        'Вещевая служба армии':1,
        'Служба ГСМ армии':1,
        'Техническая часть армии':1,
        'Офицерский клуб армии':1,
        }

metadict_army['Техническая часть армии'] = {
        'Начальник технической части армии':1,
        'Бронетанковая служба армии':1,
        'Автомобильная служба армии':1,
        'Авиационная служба армии':1,
        'Служба ракетно-артиллерийского вооружения армии':1,
        }

metadict_army['Авиационная служба армии'] = {
        'Начальник авиационной службы армии':0,
        }

metadict_army['Автомобильная служба армии'] = {
        'Начальник автомобильной службы армии':0,
        }

metadict_army['Административно-хозяйственный отдел армии'] = {
        'Начальник административно-хозяйствненого отдела армии':1,
        'Военнослужащий штаба армии':4,
        'Служащий штаба армии':36,
        }

metadict_army['Бронетанковая служба армии'] = {
        'Начальник бронетанковой службы армии':0,
        }

metadict_army['Вещевая служба армии'] = {
        'Начальник вещевой службы армии':0,
        }

metadict_army['Квартирно-эксплуатационная служба армии'] = {
        'Начальник квартирно-эксплуатационной службы армии':1,
        'Военнослужащий штаба армии':2,
        'Служащий штаба армии':5,
        }

metadict_army['Командование армии'] = {
        'Командующий армией':1,
        'Заместитель командующего армией':2,
        }

metadict_army['Медицинская служба армии'] = {
        'Начальник медицинской службы армии':0,
        }

metadict_army['Метеорологическая служба армии'] = {
        'Военнослужащий штаба армии':3,
        }

metadict_army['Отдел кадров армии'] = {
        'Начальник отдела кадров армии':1,
        'Военнослужащий штаба армии':6,
        'Служащий штаба армии':30,
        }

metadict_army['Отдел химической защиты армии'] = {
        'Начальник химической защиты армии':0,
        }

metadict_army['Отдел авиации армии'] = {
        'Начальник химической защиты армии':0,
        }

metadict_army['Отдел боевой подготовки армии'] = {
        'Начальник боевой подготовки армии':0,
        }

metadict_army['Военно-юридическая служба армии'] = {
        'Начальник военно-юридической службы армии':1,
        'Военнослужащий штаба армии':3,
        'Служащий штаба армии':12,
        }

metadict_army['Отдел воспитательной работы армии'] = {
        'Начальник воспитательной работы армии':1,
        'Военнослужащий штаба армии':3,
        'Служащий штаба армии':3,
        }

metadict_army['Отдел инженерных войск армии'] = {
        'Начальник инженерных войск армии':0,
        }

metadict_army['Отдел разведки армии'] = {
        'Начальник разведки армии':0,
        }

metadict_army['Отдел военной полиции армии'] = {
        'Начальник военной полиции армии':0,
        }

metadict_army['Отдел противовоздушной обороны армии'] = {
        'Начальник противовоздушной обороны армии':0,
        }

metadict_army['Отдел ракетных войск и артиллерии армии'] = {
        'Начальник ракетных войск и артиллерии армии':0,
        }

metadict_army['Отдел связи армии'] = {
        'Начальник связи армии':0,
        }

metadict_army['Офицерский клуб армии'] = {
        'Служащий штаба армии':3,
        }

metadict_army['Продовольственная служба армии'] = {
        'Начальник продовольственной службы армии':0,
        }

metadict_army['Разведывательный отдел армии'] = {
        'Начальник разведки армии':0,
        }

metadict_army['Служба ГСМ армии'] = {
        'Начальник службы ГСМ армии':0,
        }

metadict_army['Служба химической защиты армии'] = {
        'Начальник химической защиты армии':0,
        }

metadict_army['Служба ракетно-артиллерийского вооружения армии'] = {
        'Начальник ракетно-артиллерийской службы армии':0,
        }

metadict_army['Топогеодезическая служба армии'] = {
        'Начальник топогеодезической службы армии':1,
        'Военнослужащий штаба армии':3,
        'Служащий штаба армии':3,
        }

metadict_army['Финансовая служба армии'] = {
        'Начальник финансовой службы армии':1,
        'Военнослужащий штаба армии':3,
        'Служащий штаба армии':6,
        }

metadict_army['Шифровальный отдел армии'] = {
        'Начальник секретной части армии':1,
        'Военнослужащий штаба армии':3,
        'Служащий штаба армии':12,
        }

#----
# Управление дивизий, флотилий:

metadict_army['Управление дивизии'] = {
        'Командование дивизии':1,
        'Штаб дивизии':1,
        'Тыл дивизии':1,
        }

metadict_army['Командование дивизии'] = {
        'Командир дивизии':1,
        'Заместитель командира дивизии по обучению':1,
        'Заместитель командира дивизии по вооружению':1,
        }

metadict_army['Штаб дивизии'] = {
        'Начальник штаба дивизии':1,
        'Оперативный отдел штаба дивизии':1,
        'Начальник авиации дивизии':0,
        'Начальник артиллерии дивизии':0,
        'Начальник химической защиты дивизии':0,
        'Начальник инженерной службы дивизии':0,
        'Начальник медицинской службы дивизии':0,
        'Начальник противовоздушной обороны дивизии':0,
        'Канцелярия дивизии':1,
        }

metadict_army['Оперативный отдел штаба дивизии'] = {
        'Заместитель начальника штаба дивизии':1,
        'Начальник связи дивизии':0,
        'Начальник разведки дивизии':0,
        'Начальник военной полиции дивизии':0,
        'Начальник метеорологической службы дивизии':1,
        'Начальник геодезической службы дивизии':1,
        }

metadict_army['Канцелярия дивизии'] = {
        'Начальник канцелярии дивизии':1,
        'Группа делопроизводства дивизии':1,
        'Группа шифровальщиков дивизии':1,
        'Отдел боевой подготовки дивизии':1,
        'Отдел воспитательной работы дивизии':1,
        'Военно-юридическая служба дивизии':1,
        }

metadict_army['Группа делопроизводства дивизии'] = {
        'Начальник отдела кадров дивизии':1,
        'Служащий штаба дивизии':35,
        }

metadict_army['Группа шифровальщиков дивизии'] = {
        'Начальник секретной части дивизии':1,
        'Шифровальщик':9,
        }

metadict_army['Тыл дивизии'] = {
        'Начальник тыла дивизии':1,
        'Заместитель начальника тыла дивизии':1,
        'Квартирно-эксплуатационная служба дивизии':1,
        'Продовольственная служба дивизии':1,
        'Медицинская служба дивизии':1,
        'Финансовая служба дивизии':1,
        'Вещевая служба дивизии':1,
        'Служба ГСМ дивизии':1,
        'Техническая часть дивизии':1,
        'Офицерский клуб дивизии':1,
        }

metadict_army['Техническая часть дивизии'] = {
        'Начальник технической части дивизии':1,
        'Начальник склада боеприпасов дивизии':0,
        'Начальник автомобильной службы дивизии':0,
        'Начальник бронетанковой службы дивизии':0,
        'Начальник авиационной службы дивизии':0,
        }

metadict_army['Вещевая служба дивизии'] = {
        'Начальник вещевой службы дивизии':0,
        }

metadict_army['Квартирно-эксплуатационная служба дивизии'] = {
        'Начальник квартирно-эксплуатационной службы дивизии':0,
        }

metadict_army['Медицинская служба дивизии'] = {
        'Начальник медицинской службы дивизии':0,
        }

metadict_army['Отдел боевой подготовки дивизии'] = {
        'Начальник боевой подготовки дивизии':0,
        }

metadict_army['Отдел боевой подготовки дивизии'] = {
        'Начальник боевой подготовки дивизии':0,
        }

metadict_army['Военно-юридическая служба дивизии'] = {
        'Начальник военно-юридической службы дивизии':0,
        }

metadict_army['Отдел воспитательной работы дивизии'] = {
        'Начальник воспитательной работы дивизии':0,
        }

metadict_army['Офицерский клуб дивизии'] = {
        'Служащий штаба дивизии':3,
        }

metadict_army['Продовольственная служба дивизии'] = {
        'Начальник продовольственной службы дивизии':0,
        }

metadict_army['Служба ГСМ дивизии'] = {
        'Начальник службы ГСМ дивизии':0,
        }

metadict_army['Финансовая служба дивизии'] = {
        'Начальник финансовой службы дивизии':1,
        'Служащий штаба дивизии':7,
        }

#----
# Управление полков:

metadict_army['Управление полка'] = {
        'Командование полка':1,
        'Штаб полка':1,
        'Тыл полка':1,
        }

metadict_army['Командование полка'] = {
        'Командир полка':1,
        'Заместитель командира полка по обучению':1,
        'Заместитель командира полка по вооружению':1,
        }

metadict_army['Штаб полка'] = {
        'Начальник штаба полка':0,
        'Оперативный отдел штаба полка':1,
        'Начальник авиации полка':0,
        'Начальник артиллерии полка':0,
        'Начальник инженерной службы полка':0,
        'Начальник противовоздушной обороны полка':0,
        'Канцелярия полка':1,
        }

metadict_army['Оперативный отдел штаба полка'] = {
        'Заместитель начальника штаба полка':0,
        'Начальник связи полка':0,
        'Начальник разведки полка':0,
        'Начальник военной полиции':0,
        'Начальник химической защиты полка':0,
        }

metadict_army['Канцелярия полка'] = {
        'Начальник канцелярии полка':1,
        'Группа делопроизводства полка':1,
        'Группа шифровальщиков полка':1,
        }

metadict_army['Группа делопроизводства полка'] = {
        'Начальник отдела кадров полка':1,
        'Служащий штаба полка':8,
        }

metadict_army['Группа шифровальщиков полка'] = {
        'Начальник секретной части полка':1,
        'Шифровальщик':2,
        }

metadict_army['Тыл полка'] = {
        'Начальник тыла полка':0,
        'Техническая часть полка':1,
        'Начальник службы ГСМ полка':0,
        'Начальник вещевой службы полка':0,
        'Начальник продовольственной службы полка':0,
        'Начальник квартирно-эксплуатационной части полка':1,
        'Начальник медицинской службы полка':0,
        'Начальник финансовой службы полка':1,
        }

metadict_army['Техническая часть полка'] = {
        'Начальник технической части полка':1,
        'Начальник склада боеприпасов полка':0,
        'Начальник автомобильной службы полка':0,
        'Начальник бронетанковой службы полка':0,
        'Начальник авиационной службы полка':0,
        }

#----
# Управление батальонов, дивизионов, эскадрилий:

metadict_army['Управление ремонтного батальона'] = {
        'Командование ремонтного батальона':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление разведывательного батальона'] = {
        'Командование разведывательного батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Управление понтонно-мостового батальона'] = {
        'Командование понтонно-мостового батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Управление переправочно-десантного батальона'] = {
        'Командование переправочно-десантного батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Управление пегасо-десантного батальона'] = {
        'Командование пегасо-десантного батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Управление мотострелкового батальона'] = {
        'Командование мотострелкового батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Управление механизированного батальона'] = {
        'Командование механизированного батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Управление медико-санитарного батальона'] = {
        'Командование медико-санитарного батальона':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление инженерного батальона'] = {
        'Командование инженерного батальона':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление инженерно-сапёрного батальона'] = {
        'Командование инженерно-сапёрного батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Управление инженерно-дорожного батальона'] = {
        'Командование инженерно-дорожного батальона':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление трубопроводного батальона'] = {
        'Командование трубопроводного батальона':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление десантно-штурмового батальона'] = {
        'Командование десантно-штурмового батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Управление штурмового батальона'] = {
        'Командование штурмового батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона снабжения'] = {
        'Командование батальона снабжения':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление батальона связи и охраны'] = {
        'Командование батальона связи и охраны':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление батальона связи'] = {
        'Командование батальона связи':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление батальона глубинной разведки'] = {
        'Командование батальона глубинной разведки':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона химических войск'] = {
        'Командование батальона химических войск':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона военной полиции'] = {
        'Командование батальона военной полиции':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона ведомственной охраны'] = {
        'Командование батальона ведомственной охраны':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление батальона боевого обеспечения'] = {
        'Командование батальона боевого обеспечения':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона аэродромно-технического обеспечения'] = {
        'Командование батальона аэродромно-технического обеспечения':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона химической разведки'] = {
        'Командование батальона химической разведки':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона РТР'] = {
        'Командование батальона РТР':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление батальона РЭБ'] = {
        'Командование батальона РЭБ':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление батальона РЭР'] = {
        'Командование батальона РЭР':1,
        'Штаб тылового батальона':1,
        }

metadict_army['Управление батальона специального назначения'] = {
        'Командование батальона специального назначения':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона стальных рейнджеров'] = {
        'Командование батальона стальных рейнджеров':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона аэрозольного противодействия'] = {
        'Командование батальона аэрозольного противодействия':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона обеспечения'] = {
        'Командование батальона обеспечения':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона обслуживания'] = {
        'Командование батальона обслуживания':1,
        'Штаб батальона':1,
        }

metadict_army['Управление батальона'] = {
        'Командование батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Управление дивизиона 120-мм миномётов (аэромобильное)'] = {
        'Командование дивизиона 120-мм миномётов (аэромобильное)':1,
        'Штаб дивизиона (аэромобильный)':1,
        }

metadict_army['Управление дивизиона 120-мм гаубиц'] = {
        'Командование дивизиона 120-мм гаубиц':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона 120-мм САУ'] = {
        'Командование дивизиона 120-мм САУ':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона 150-мм САУ'] = {
        'Командование дивизиона 150-мм САУ':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона 150-мм гаубиц'] = {
        'Командование дивизиона 150-мм гаубиц':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона 120-мм РСЗО'] = {
        'Командование дивизиона 120-мм РСЗО':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона 220-мм РСЗО'] = {
        'Командование дивизиона 220-мм РСЗО':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона ЗРК ближнего действия'] = {
        'Командование дивизиона ЗРК ближнего действия':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона ЗРК малой дальности'] = {
        'Командование дивизиона ЗРК малой дальности':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона ЗРК средней дальности'] = {
        'Командование дивизиона ЗРК средней дальности':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона ЗРК большой дальности'] = {
        'Командование дивизиона ЗРК большой дальности':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона тактических ракет'] = {
        'Командование дивизиона тактических ракет':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона оперативно-тактических ракет'] = {
        'Командование дивизиона оперативно-тактических ракет':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона артиллерийской разведки'] = {
        'Командование дивизиона артиллерийской разведки':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона зенитной разведки'] = {
        'Командование дивизиона зенитной разведки':1,
        'Штаб дивизиона':1,
        }

metadict_army['Управление дивизиона (аэромобильное)'] = {
        'Командование дивизиона (аэромобильное)':1,
        'Штаб дивизиона (аэромобильный)':1,
        }

metadict_army['Управление танкового батальона'] = {
        'Командование танкового батальона':1,
        'Штаб батальона':1,
        }

metadict_army['Командование батальона'] = {
        'Командир батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона РТР'] = {
        'Командир батальона РТР':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона химической разведки'] = {
        'Командир батальона химической разведки':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона РЭБ'] = {
        'Командир батальона РЭБ':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона РЭР'] = {
        'Командир батальона РЭР':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона аэродромно-технического обеспечения'] = {
        'Командир батальона аэродромно-технического обеспечения':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона боевого обеспечения'] = {
        'Командир батальона боевого обеспечения':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона ведомственной охраны'] = {
        'Командир батальона ведомственной охраны':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона военной полиции'] = {
        'Командир батальона военной полиции':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона химических войск'] = {
        'Командир батальона химических войск':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона глубинной разведки'] = {
        'Командир батальона глубинной разведки':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона связи'] = {
        'Командир батальона связи':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона связи и охраны'] = {
        'Командир батальона связи и охраны':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона снабжения'] = {
        'Командир батальона снабжения':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона обеспечения'] = {
        'Командир батальона обеспечения':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона обслуживания'] = {
        'Командир батальона обслуживания':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование десантно-штурмового батальона'] = {
        'Командир десантно-штурмового батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование механизированного батальона'] = {
        'Командир механизированного батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование мотострелкового батальона'] = {
        'Командир мотострелкового батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование пегасо-десантного батальона'] = {
        'Командир пегасо-десантного батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование понтонно-мостового батальона'] = {
        'Командир понтонно-мостового батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование разведывательного батальона'] = {
        'Командир разведывательного батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование ремонтного батальона'] = {
        'Командир ремонтного батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование штурмового батальона'] = {
        'Командир штурмового батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование инженерно-дорожного батальона'] = {
        'Командир инженерно-дорожного батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование трубопроводного батальона'] = {
        'Командир трубопроводного батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование инженерно-сапёрного батальона'] = {
        'Командир инженерно-сапёрного батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование инженерного батальона'] = {
        'Командир инженерного батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование медико-санитарного батальона'] = {
        'Командир медико-санитарного батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона специального назначения'] = {
        'Командир батальона специального назначения':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона стальных рейнджеров'] = {
        'Командир батальона стальных рейнджеров':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование батальона аэрозольного противодействия'] = {
        'Командир батальона аэрозольного противодействия':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        }

metadict_army['Командование танкового батальона'] = {
        'Командир танкового батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        'Экипаж командирского танка':1,
        }

metadict_army['Штаб батальона'] = {
        'Начальник штаба батальона':1,
        'Заместитель начальника штаба батальона':1,
        'Начальник связи батальона':0,
        'Начальник разведки батальона':0,
        'Инструктор по химической защите':1,
        'Делопроизводитель':1,
        'Полевой хирург (единорог)':1,
        }

metadict_army['Штаб тылового батальона'] = {
        'Начальник штаба батальона':1,
        'Заместитель начальника штаба батальона':1,
        'Начальник связи батальона':0,
        'Инструктор по химической защите':1,
        'Делопроизводитель':1,
        }

metadict_army['Командование дивизиона'] = {
        'Командир дивизиона':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона 120-мм гаубиц'] = {
        'Командир дивизиона 120-мм гаубиц':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона 120-мм САУ'] = {
        'Командир дивизиона 120-мм САУ':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона 150-мм САУ'] = {
        'Командир дивизиона 150-мм САУ':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона 150-мм гаубиц'] = {
        'Командир дивизиона 150-мм гаубиц':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона 120-мм РСЗО'] = {
        'Командир дивизиона 120-мм РСЗО':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона 220-мм РСЗО'] = {
        'Командир дивизиона 220-мм РСЗО':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона ЗРК ближнего действия'] = {
        'Командир дивизиона ЗРК ближнего действия':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона ЗРК малой дальности'] = {
        'Командир дивизиона ЗРК большой дальности':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона ЗРК средней дальности'] = {
        'Командир дивизиона ЗРК средней дальности':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона ЗРК большой дальности'] = {
        'Командир дивизиона ЗРК большой дальности':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона тактических ракет'] = {
        'Командир дивизиона тактических ракет':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона оперативно-тактических ракет'] = {
        'Командир дивизиона оперативно-тактических ракет':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона зенитной разведки'] = {
        'Командир дивизиона зенитной разведки':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона артиллерийской разведки'] = {
        'Командир дивизиона артиллерийской разведки':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }

metadict_army['Командование дивизиона 120-мм миномётов (аэромобильное)'] = {
        'Командир дивизиона 120-мм миномётов (пегас)':1,
        'Заместитель командира дивизиона по обучению':1,
        'Заместитель командира дивизиона по вооружению':1,
        }


metadict_army['Штаб дивизиона'] = {
        'Начальник штаба дивизиона':1,
        'Делопроизводитель':1,
        'Заместитель начальника штаба дивизиона':1,
        'Инструктор по химической защите':1,
        'Полевой хирург (единорог)':1,
        }

metadict_army['Управление тылового батальона'] = {
        'Командир тылового батальона':1,
        'Заместитель командира батальона по обучению':1,
        'Заместитель командира батальона по вооружению':1,
        'Инструктор по химической защите':1,
        'Делопроизводитель':1,
        }

metadict_army['Командование дивизиона (аэромобильное)'] = {
        'Командир дивизиона (пегас)':1,
        'Заместитель командира дивизиона по обучению (пегас)':1,
        'Заместитель командира дивизиона по вооружению (пегас)':1,
        }

metadict_army['Штаб дивизиона (аэромобильный)'] = {
        'Начальник штаба дивизиона (пегас)':1,
        'Делопроизводитель':1,
        'Заместитель начальника штаба дивизиона (пегас)':1,
        'Инструктор по химической защите':1,
        'Полевой хирург (единорог)':1,
        }

metadict_army['Управление дивизиона шахтных МБР'] = {
        'Командир дивизиона шахтных МБР':1,
        'Заместитель командира дивизиона по вооружению':1,
        'Инструктор по химической защите':1,
        }

metadict_army['Управление эскадрильи бомбонесущих планёров'] = {
        'Командир эскадрильи бомбонесущих планёров (пегас)':1,
        'Штаб эскадрильи пегасов':1,
        }

metadict_army['Управление эскадрильи противотанковых планёров'] = {
        'Командир эскадрильи противотанковых планёров (пегас)':1,
        'Штаб эскадрильи пегасов':1,
        }

metadict_army['Управление эскадрильи противовоздушных планёров'] = {
        'Командир эскадрильи противовоздушных планёров (пегас)':1,
        'Штаб эскадрильи пегасов':1,
        }

metadict_army['Управление эскадрильи ракетных планёров'] = {
        'Командир эскадрильи ракетных планёров (пегас)':1,
        'Штаб эскадрильи пегасов':1,
        }

metadict_army['Управление эскадрильи транспортных планёров'] = {
        'Командир эскадрильи транспортных планёров (пегас)':1,
        'Штаб эскадрильи пегасов':1,
        }

metadict_army['Управление эскадрильи тяжёлых планёров'] = {
        'Командир эскадрильи тяжёлых планёров (пегас)':1,
        'Штаб эскадрильи пегасов':1,
        }

metadict_army['Управление эскадрильи истребителей-бомбардировщиков'] = {
        'Командир эскадрильи истребителей-бомбардировщиков (пегас)':1,
        'Штаб эскадрильи авиации':1,
        }

metadict_army['Управление эскадрильи транспортной авиации'] = {
        'Командир эскадрильи транспортной авиации (пегас)':1,
        'Штаб эскадрильи авиации':1,
        }

metadict_army['Штаб эскадрильи пегасов'] = {
        'Заместитель командира эскадрильи (пегас)':1,
        'Делопроизводитель':1,
        'Инструктор по химической защите':1,
        'Полевой хирург (единорог)':1,
        }

metadict_army['Штаб эскадрильи авиации'] = {
        'Заместитель командира эскадрильи (пегас)':1,
        'Делопроизводитель':1,
        'Инструктор по химической защите':1,
        }

#----
# Управление рот, батарей:

metadict_army['Управление тыловой роты'] = {
        'Командир тыловой роты':1,
        'Штаб роты':1,
        }

metadict_army['Управление сапёрной роты'] = {
        'Командир сапёрной роты':1,
        'Штаб роты':1,
        }

metadict_army['Управление сапёрной роты (аэромобильное)'] = {
        'Командир сапёрной роты (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление роты тяжёлого оружия (аэромобильное)'] = {
        'Командир роты тяжёлого оружия (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление роты транспортных планёров'] = {
        'Командир роты транспортных планёров (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление роты связи'] = {
        'Командир роты связи':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты разведывательных БПЛА'] = {
        'Командир роты разведывательных БПЛА':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты радиолокационной разведки'] = {
        'Командир роты радиолокационной разведки':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты химических войск'] = {
        'Командир роты химических войск':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты военной полиции'] = {
        'Командир роты военной полиции':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты ведомственной охраны'] = {
        'Командир роты ведомственной охраны':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты боевых роботов'] = {
        'Командир роты боевых роботов':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты планёров-бомбардировщиков'] = {
        'Командир роты планёров-бомбардировщиков (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление роты противовоздушных планёров'] = {
        'Командир роты противовоздушных планёров (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление роты противотанковых планёров'] = {
        'Командир роты противотанковых планёров (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление роты ракетных планёров'] = {
        'Командир роты ракетных планёров (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление звена транспортной авиации'] = {
        'Командир звена транспортной авиации':1,
        }

metadict_army['Управление звена истребителей-бомбардировщиков'] = {
        'Командир звена истребителей-бомбардировщиков':1,
        }

metadict_army['Управление роты РЭР'] = {
        'Командир роты РЭР':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты РЭБ'] = {
        'Командир роты РЭБ':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты химической разведки (аэромобильное)'] = {
        'Командир роты химической разведки (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление роты химической разведки'] = {
        'Командир роты химической разведки':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты РТР и РЭР'] = {
        'Командир роты РТР и РЭР':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты РТР'] = {
        'Командир роты РТР':1,
        'Штаб роты':1,
        }

metadict_army['Управление ремонтной роты'] = {
        'Командир ремонтной роты':1,
        'Штаб роты':1,
        }

metadict_army['Управление разведывательной роты (бронетехника)'] = {
        'Командир разведывательной роты (бронетехника)':1,
        'Штаб роты':1,
        'Экипаж командирского БМП':1,
        }

metadict_army['Управление понтонно-мостовой роты'] = {
        'Командир понтонно-мостовой роты':1,
        'Штаб роты':1,
        }

metadict_army['Управление переправочно-десантной роты'] = {
        'Командир переправочно-десантной роты':1,
        'Штаб роты':1,
        }

metadict_army['Управление медицинской роты'] = {
        'Командир медицинской роты':1,
        'Штаб роты':1,
        }

metadict_army['Управление медицинской роты (аэромобильное)'] = {
        'Командир медицинской роты (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление инженерной роты'] = {
        'Командир инженерной роты':1,
        'Штаб роты':1,
        }

metadict_army['Управление инженерно-сапёрной роты'] = {
        'Командир инженерно-сапёрной роты':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты инструкторов'] = {
        'Командир роты инструкторов':1,
        'Штаб роты':1,
        }

metadict_army['Управление роты стальных рейнджеров'] = {
        'Командир роты стальных рейнджеров':1,
        'Штаб роты специального назначения':1,
        'Экипаж командирского БТР':1,
        }

metadict_army['Управление снайперской роты'] = {
        'Командир роты снайперов':1,
        'Штаб роты специального назначения':1,
        'Экипаж командирского БТР':1,
        }

metadict_army['Управление штурмовой роты'] = {
        'Командир штурмовой роты':1,
        'Штаб роты специального назначения':1,
        'Экипаж командирского БМП':1,
        }

metadict_army['Управление штурмовой роты (без БМП)'] = {
        'Командир штурмовой роты':1,
        'Штаб роты специального назначения':1,
        }

metadict_army['Управление пегасо-десантной роты'] = {
        'Командир пегасо-десантной роты':1,
        'Штаб роты':1,
        }

metadict_army['Управление десантно-штурмовой роты'] = {
        'Командир десантно-штурмовой роты':1,
        'Штаб мотострелковой роты':1,
        'Экипаж командирского БМД':1,
        }

metadict_army['Управление мотострелковой роты'] = {
        'Командир мотострелковой роты':1,
        'Штаб мотострелковой роты':1,
        'Экипаж командирского БМП':1,
        }

metadict_army['Управление механизированной роты'] = {
        'Командир механизированной роты':1,
        'Штаб мотострелковой роты':1,
        'Экипаж командирского БТР':1,
        }

metadict_army['Управление танковой роты'] = {
        'Командир танковой роты':1,
        'Штаб танковой роты':1,
        'Экипаж командирского танка':1,
        }

metadict_army['Управление разведывательной роты (аэромобильное)'] = {
        'Командир разведывательной роты (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление диверсионно-разведывательной роты'] = {
        'Командир роты специального назначения (пегас)':1,
        'Штаб роты специального назначения':1,
        }

metadict_army['Управление роты посыльных'] = {
        'Командир роты посыльных (пегас)':1,
        'Штаб роты (аэромобильный)':1,
        }

metadict_army['Управление роты обеспечения'] = {
        'Командир роты обеспечения':1,
        'Штаб батареи':1,
        }

metadict_army['Управление роты обслуживания'] = {
        'Командир роты обслуживания':1,
        'Штаб батареи':1,
        }

metadict_army['Управление роты снабжения'] = {
        'Командир роты снабжения':1,
        'Штаб батареи':1,
        }

metadict_army['Управление транспортной роты'] = {
        'Командир транспортной роты':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи ЗРК ближнего действия'] = {
        'Командир батареи ЗРК малой дальности':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи ЗРК малой дальности'] = {
        'Командир батареи ЗРК малой дальности':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи ЗРК средней дальности'] = {
        'Командир батареи ЗРК средней дальности':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи ЗРК большой дальности'] = {
        'Командир батареи ЗРК большой дальности':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи 120-мм РСЗО'] = {
        'Командир батареи 120-мм РСЗО':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи 220-мм РСЗО'] = {
        'Командир батареи 220-мм РСЗО':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи батальонных САУ'] = {
        'Командир батареи батальонных САУ':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи полковых САУ'] = {
        'Командир батареи полковых САУ':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи полковых гаубиц'] = {
        'Командир батареи полковых гаубиц':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи дивизионных САУ'] = {
        'Командир батареи дивизионных САУ':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи дивизионных гаубиц'] = {
        'Командир батареи дивизионных гаубиц':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи артиллерийской разведки'] = {
        'Командир батареи артиллерийской разведки':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи гаубиц'] = {
        'Командир батареи гаубиц':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи тактических ракет'] = {
        'Командир батареи тактических ракет':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи оперативно-тактических ракет'] = {
        'Командир батареи оперативно-тактических ракет':1,
        'Штаб батареи':1,
        }

metadict_army['Управление батареи связи'] = {
        'Командир батареи связи':1,
        'Штаб батареи':1,
        }

metadict_army['Управление миномётной батареи'] = {
        'Командир миномётной батареи':1,
        'Штаб батареи':1,
        }

metadict_army['Управление миномётной батареи (аэромобильное)'] = {
        'Командир миномётной батареи (пегас)':1,
        'Штаб батареи (аэромобильный)':1,
        }

metadict_army['Управление противотанковой батареи (аэромобильное)'] = {
        'Командир противотанковой батареи (пегас)':1,
        'Штаб батареи (аэромобильный)':1,
        }

metadict_army['Управление батареи (аэромобильное)'] = {
        'Командир крылатой батареи (пегас)':1,
        'Штаб батареи (аэромобильный)':1,
        }

metadict_army['Управление роты мобильной АЭС'] = {
        'Командир роты мобильной АЭС':1,
        'Штаб роты':1,
        }

metadict_army['Управление армейских складов'] = {
        'Управляющий армейских складов':1,
        'Заместитель управляющего армейских складов':1,
        'Делопроизводитель':6,
        }

metadict_army['Управление складского терминала'] = {
        'Управляющий складского терминала':1,
        'Делопроизводитель':1,
        }

metadict_army['Штаб роты'] = {
        'Заместитель командира роты':1,
        'Управляющий хозяйством роты':1,
        'Инструктор по боевой подготовке':1,
        'Инструктор по вооружению':1,
        'Санитар-инструктор':1,
        'Имущество роты':1,
        }

metadict_army['Штаб роты (аэромобильный)'] = {
        'Заместитель командира роты (пегас)':1,
        'Управляющий хозяйством роты (пегас)':1,
        'Инструктор по боевой подготовке (пегас)':1,
        'Инструктор по вооружению (пегас)':1,
        'Санитар-инструктор':1,
        'Станция ближней разведки':1,
        'Лазерный прибор разведки':1,
        'Лёгкий планёр (перевозка снаряжения)':5,
        'Имущество роты (аэромобильной)':1,
        }

metadict_army['Штаб мотострелковой роты'] = {
        'Заместитель командира роты':1,
        'Управляющий хозяйством роты':1,
        'Инструктор по боевой подготовке':1,
        'Инструктор экипажей бронемашин':1,
        'Инструктор по вооружению':1,
        'Санитар-инструктор':1,
        'Имущество роты (мотострелковой)':1,
        }

metadict_army['Штаб роты специального назначения'] = {
        'Заместитель командира роты специального назначения':1,
        'Управляющий хозяйством роты':1,
        'Инструктор по боевой подготовке':1,
        'Инструктор по вооружению':1,
        'Полевой хирург (единорог)':1,
        'Имущество роты (специального назначения)':1,
        }

metadict_army['Штаб роты специального назначения (аэромобильный)'] = {
        'Заместитель командира роты специального назначения (пегас)':1,
        'Связист диверсионно-разведывательной группы (пегас)':1,
        'Управляющий хозяйством роты (пегас)':1,
        'Инструктор по боевой подготовке (пегас)':1,
        'Инструктор по вооружению (пегас)':1,
        'Полевой хирург (единорог)':1,
        'КВ-радиостанция переносная':1,
        'Станция ближней разведки':1,
        'Лазерный прибор разведки':1,
        'Лёгкий планёр (перевозка снаряжения)':6,
        'Имущество роты (аэромобильной СпН)':1,
        }

metadict_army['Штаб танковой роты'] = {
        'Заместитель командира роты':1,
        'Инструктор экипажей бронемашин':1,
        'Санитар-инструктор':1,
        'Имущество роты (танковой)':1,
        }

metadict_army['Штаб батареи'] = {
        'Заместитель командира батареи':1,
        'Управляющий хозяйством батареи':1,
        'Инструктор по боевой подготовке':1,
        'Инструктор по вооружению':1,
        'Санитар-инструктор':1,
        'Имущество батареи':1,
        }

metadict_army['Штаб батареи (аэромобильный)'] = {
        'Заместитель командира роты (пегас)':1,
        'Управляющий хозяйством роты (пегас)':1,
        'Инструктор по боевой подготовке (пегас)':1,
        'Инструктор по вооружению (пегас)':1,
        'Санитар-инструктор':1,
        'Имущество батареи (аэромобильной)':1,
        }

#----
# Управление взводов:

metadict_army['Управление взвода РТР'] = {                      
        'Командир взвода РТР':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода РТР (аэромобильное)'] = {
        'Командир взвода РТР (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода РЭБ'] = {
        'Командир взвода РЭБ':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода РЭБ (аэромобильное)'] = {
        'Командир взвода РЭБ (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода РЭР'] = {
        'Командир взвода РЭР':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода РЭР (аэромобильное)'] = {
        'Командир взвода РЭР (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода боевых роботов'] = {
        'Командир взвода боевых роботов':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода ведомственной охраны'] = {
        'Командир взвода ведомственной охраны':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода военной полиции'] = {
        'Командир взвода военной полиции':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода военной полиции (аэромобильное)'] = {
        'Командир взвода военной полиции (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода звукометрической разведки'] = {
        'Командир взвода звукометрической разведки':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода инженерной разведки'] = {
        'Командир взвода инженерной разведки':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода механизированных мостов'] = {
        'Командир взвода механизированных мостов':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода мобильного энергоблока'] = {
        'Командир взвода мобильного энергоблока':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода обеспечения'] = {
        'Командир взвода обеспечения':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода обеспечения (аэромобильное)'] = {
        'Командир взвода обеспечения (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода обслуживания'] = {
        'Командир взвода обслуживания':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода планёров-бомбардировщиков (аэромобильное)'] = {
        'Командир взвода планёров-бомбардировщиков (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода противовоздушных планёров (аэромобильное)'] = {
        'Командир взвода противовоздушных планёров (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода противотанковых планёров (аэромобильное)'] = {
        'Командир взвода противотанковых планёров (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода разведывательных БПЛА'] = {
        'Командир взвода разведывательных БПЛА':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода ракетных планёров (аэромобильное)'] = {
        'Командир взвода ракетных планёров (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода роботов РЭБ'] = {
        'Командир взвода роботов РЭБ':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода связи'] = {
        'Командир взвода связи':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода связи (аэромобильное)'] = {
        'Командир взвода связи (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода снабжения'] = {
        'Командир взвода снабжения':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода стальных рейнджеров'] = {
        'Командир взвода стальных рейнджеров':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода транспортных планёров (аэромобильное)'] = {
        'Командир взвода транспортных планёров (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление взвода тяжёлого оружия'] = {
        'Командир взвода тяжёлого оружия':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода химической защиты'] = {
        'Командир взвода химической защиты':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода химической разведки'] = {
        'Командир взвода химической разведки':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление взвода химической разведки (аэромобильное)'] = {
        'Командир взвода химической разведки (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление гранатомётного взвода (аэромобильное)'] = {
        'Командир гранатомётного взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление десантно-штурмового взвода'] = {
        'Командир десантно-штурмового взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление диверсионно-разведывательного взвода (аэромобильное)'] = {
        'Командир диверсионно-разведывательного взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление инженерного взвода'] = {
        'Командир инженерного взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление инженерного взвода (аэромобильное)'] = {
        'Командир инженерного взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        }

metadict_army['Управление медицинского взвода'] = {
        'Командир медицинского взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление медицинского взвода (аэромобильное)'] = {
        'Командир медицинского взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление метеорологического взвода'] = {
        'Командир метеорологического взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление механизированного взвода'] = {
        'Командир механизированного взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление миномётного взвода'] = {
        'Командир миномётного взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление миномётного взвода (аэромобильное)'] = {
        'Командир миномётного взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление миномётного взвода (бронетехника)'] = {
        'Командир миномётного взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление мотострелкового взвода'] = {
        'Командир мотострелкового взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление огневого взвода 120-мм РСЗО'] = {
        'Командир огневого взвода 120-мм РСЗО':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление огневого взвода 220-мм РСЗО'] = {
        'Командир огневого взвода 220-мм РСЗО':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление огневого взвода 120-мм САУ'] = {
        'Командир огневого взвода 120-мм САУ':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление огневого взвода 120-мм гаубиц'] = {
        'Командир огневого взвода 120-мм гаубиц':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление огневого взвода 150-мм САУ'] = {
        'Командир огневого взвода 150-мм САУ':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление огневого взвода 150-мм гаубиц'] = {
        'Командир огневого взвода 150-мм гаубиц':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление огнемётного взвода'] = {
        'Командир огнемётного взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление пегасо-десантного взвода'] = {
        'Командир пегасо-десантного взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление переправочно-десантного взвода'] = {
        'Командир переправочно-десантного взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление понтонно-мостового взвода'] = {
        'Командир понтонно-мостового взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление противотанкового взвода (аэромобильное)'] = {
        'Командир противотанкового взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление пулемётного взвода (аэромобильное)'] = {
        'Командир пулемётного взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление разведывательного взвода (аэромобильное)'] = {
        'Командир разведывательного взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление разведывательного взвода (бронетехника)'] = {
        'Командир разведывательного взвода (бронетехника)':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление ремонтного взвода'] = {
        'Командир ремонтного взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление сапёрного взвода'] = {
        'Командир сапёрного взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление сапёрного взвода (аэромобильное)'] = {
        'Командир сапёрного взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление снайперского взвода (аэромобильное)'] = {
        'Командир снайперского взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление танкового взвода'] = {
        'Командир танкового взвода':1,
        'Заместитель командира взвода':1,
        }

metadict_army['Управление топогеодезического взвода (аэромобильное)'] = {
        'Командир топогеодезического взвода (пегас)':1,
        'Заместитель командира взвода (пегас)':1,
        'Лёгкий планёр (перевозка снаряжения)':2,
        }

metadict_army['Управление транспортного взвода'] = {
        'Командир транспортного взвода':1,
        'Заместитель командира взвода':1,
        }
