#----
# Строения, контейнеры, конструктивные элементы:

metadict_detail['Понтонно-мостовой парк'] = {
        # Длина звена: 7.2 метра; ширина 8 метров; ширина проезжей части 6.55 метра.
        # Масса звена 7 тонн. Грузоподъемность звена 22.5 тонн.
        # http://saper.isnet.ru//texnica-2/pp-91.html
        '-Строительные материалы (тонн)':150,
        'wpn_cost':500000,
        }

metadict_detail['Комплект КФУ'] = {
        '-Строительные материалы (тонн)':1.5,
        'wpn_cost':1500,
        }

metadict_detail['Топливный резервуар (50 кубометров)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':6,
        '-Место под жидкое топливо (литры)':50000,
        'wpn_cost':10000,
        }

metadict_detail['Контейнер для угля (70 кубометров)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':4,
        '-Место под уголь (тонн)':60,
        'wpn_cost':5000,
        }

metadict_detail['Водный резервуар (50 кубометров)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':6,
        '-Место под воду (тонн)':5,
        'wpn_cost':10000,
        }

metadict_detail['Контейнер для боеприпасов (70 кубометров)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':4,
        '-Место под боеприпасы (тонн)':30,
        'wpn_cost':5000,
        }

metadict_detail['Контейнер для снаряжения (70 кубометров)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':4,
        '-Место под снаряжение (тонн)':30,
        'wpn_cost':5000,
        }

metadict_detail['Контейнер для строительных материалов (70 кубометров)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':4,
        '-Строительные материалы (тонн)':30,
        'wpn_cost':5000,
        }

metadict_detail['Контейнер для продовольствия (70 кубометров)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':4,
        '-Место под продовольствие (тонн)':30,
        'wpn_cost':5000,
        }

metadict_detail['Рефрижератор (70 кубометров)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':10,
        '-Место под продовольствие (тонн)':30,
        '--Потребление энергии (кВт)':20,
        '--Запас энергии (МДж)':1000,
        'wpn_cost':20000,
        }
