#----
# Вооружённые силы:

metadict_army['Вооружённые силы Эквестрии'] = {
        'Генеральный штаб':1,
        'Сухопутные войска':1,
        'Военно-воздушные силы':1,
        'Военно-морской флот':1,
        'Ракетные войска':1,
        }

#----
# Рода войск:

metadict_army['Военно-воздушные силы'] = {
        'Управление военно-воздушных сил':1,
        'Воздушная группа армий':2,
        'Воздушный флот "Тандерхед"':1,
        'Воздушный флот "Лайтинг"':1,
        'Воздушный флот "Сильверскай"':1,
        }

metadict_army['Сухопутные войска'] = {
        'Управление сухопутных войск':1,
        'Группа армий "Центр"':1,
        'Группа армий "Запад"':1,
        'Внутренние войска':1,
        }

metadict_army['Ракетные войска'] = {
        'Управление ракетных войск':1,
        'Кантерлотская ракетная группа армий':1,
        'Хуффингтонская ракетная группа армий':1,
        'Военно-космическая программа Эквестрии':1,
        'Обеспечение ракетных войск':1,
        }

metadict_army['Военно-космическая программа Эквестрии'] = {
        # https://ru.wikipedia.org/wiki/Список_космических_запусков_СССР_в_1977_году
        # Всего было запущено около 3000 аппаратов (1400 в период 1957-1977)
        # Срок службы спутника от десятков суток (низкоорбитальные), до 5 лет.
        'Спутниковая система обнаружения стартов МБР':1,
        'Спутниковая система радиотехнической разведки':1,
        'Спутниковая система оптико-электронной разведки':1,
        'Спутниковая система ретрансляции':1,
        'Спутниковая система навигации':1,
        'Спутниковая система связи':1,
        }

#----
# Группы армий, фронты:

metadict_army['Группа армий "Центр"'] = {
        'Управление группы армий':1,
        'Танковая армия':2,
        'Общевойсковая армия':2,
        'Лёгкая пехотная армия':1,
        'Крылатая армия':1,
        'Обеспечение группы армий':1,
        }

metadict_army['Группа армий "Запад"'] = {
        'Управление группы армий':1,
        'Танковая армия':2,
        'Общевойсковая армия':2,
        'Лёгкая пехотная армия':1,
        'Крылатая армия':1,
        'Обеспечение группы армий':1,
        }

metadict_army['Внутренние войска'] = {
        'Управление группы армий':1,
        'Танковая армия':2,
        'Общевойсковая армия':2,
        'Лёгкая пехотная армия':4,
        'Крылатая армия':1,
        'Обеспечение группы армий':1,
        }

metadict_army['Воздушная группа армий'] = {
        'Управление группы армий':1,
        'Воздушная армия':3,
        }

metadict_army['Воздушный флот "Тандерхед"'] = {
        'Управление группы армий':1,
        'Тандерхед':3,
        }

metadict_army['Воздушный флот "Лайтинг"'] = {
        'Управление группы армий':1,
        'Тандерхед':3,
        }

metadict_army['Воздушный флот "Сильверскай"'] = {
        'Управление группы армий':1,
        'Тандерхед':3,
        }

metadict_army['Кантерлотская ракетная группа армий'] = {
        'Управление группы армий':1,
        'Ракетная армия':3,
        }

metadict_army['Хуффингтонская ракетная группа армий'] = {
        'Управление группы армий':1,
        'Ракетная армия':3,
        }

#----
# Флоты, армии, корпуса:

metadict_army['Танковая армия'] = {
        'Управление армии':1,
        'Танковая дивизия':4,
        'Мотострелковая дивизия':2,
        'Крылатая боевая дивизия':1,
        'Зенитная ракетная дивизия':1,
        'Оперативно-тактическая ракетная дивизия':1,
        'Дивизия инженерных войск':1,
        'Дивизия связи и разведки':1,
        'Дивизия тылового обеспечения':1,
        }

metadict_army['Общевойсковая армия'] = {
        'Управление армии':1,
        'Танковая дивизия':2,
        'Мотострелковая дивизия':4,
        'Крылатая боевая дивизия':1,
        'Зенитная ракетная дивизия':1,
        'Оперативно-тактическая ракетная дивизия':1,
        'Дивизия инженерных войск':1,
        'Дивизия связи и разведки':1,
        'Дивизия тылового обеспечения':1,
        }

metadict_army['Лёгкая пехотная армия'] = {
        'Управление армии':1,
        'Пегасо-десантная дивизия':6,
        'Крылатая транспортная дивизия':1,
        'Зенитная ракетная дивизия':1,
        'Оперативно-тактическая ракетная дивизия':1,
        'Дивизия инженерных войск':1,
        'Дивизия связи и разведки':1,
        'Дивизия тылового обеспечения':1,
        }

metadict_army['Крылатая армия'] = {
        'Управление армии':1,
        'Крылатая боевая дивизия':3,
        'Крылатая транспортная дивизия':3,
        'Зенитная ракетная дивизия':1,
        'Дивизия инженерных войск':1,
        'Дивизия связи и разведки':1,
        'Дивизия тылового обеспечения':1,
        }

metadict_army['Воздушная армия'] = {
        'Управление армии':1,
        'Истребительная авиационная дивизия':3,
        'Транспортная авиационная дивизия':1,
        'Дивизия инженерных войск':1,
        'Дивизия связи и разведки':1,
        'Дивизия тылового обеспечения':1,
        }

metadict_army['Тандерхед'] = {
        'Управление Тандерхеда':1,
        'Боевые части Тандерхеда':1,
        'Службы Тандерхеда':1,
        'Авиакрыло Тандерхеда':1,
        'Десантно-штурмовая дивизия':1,
        }

metadict_army['Ракетная армия'] = {
        'Управление армии':1,
        'Стратегическая ракетная дивизия':3,
        'Зенитная ракетная дивизия большой дальности':1,
        'Дивизия инженерных войск':1,
        'Дивизия связи и разведки':1,
        'Дивизия тылового обеспечения':1,
        }

metadict_army['Обеспечение группы армий'] = {
        'Управление железнодорожных войск':1,
        'Ремонтные предприятия группы армий':1,
        'Склады и арсеналы группы армий':1,
        'Центр боевой подготовки':1,
        'Центральный госпиталь':1,
        }

#----
# Дивизии:

metadict_army['Мотострелковая дивизия'] = {
        'Управление дивизии':1,
        'Механизированный полк':2,
        'Мотострелковый полк':1,
        'Танковый полк':1,
        'Самоходно-артиллерийский полк':1,
        'Полк зенитных ракет ближнего действия':1,
        'Полк боевого обеспечения танковых войск':1,
        'Полк тылового обеспечения танковых войск':1,
        }

metadict_army['Танковая дивизия'] = {
        'Управление дивизии':1,
        'Танковый полк':3,
        'Мотострелковый полк':1,
        'Самоходно-артиллерийский полк':1,
        'Полк зенитных ракет ближнего действия':1,
        'Полк боевого обеспечения танковых войск':1,
        'Полк тылового обеспечения танковых войск':1,
        }

metadict_army['Пегасо-десантная дивизия'] = {
        'Управление дивизии':1,
        'Пегасо-десантный полк':3,
        'Лёгкий артиллерийский полк':1,
        'Полк зенитных ракет ближнего действия':1,
        'Полк транспортных планёров':1,
        'Полк боевого обеспечения':1,
        'Полк тылового обеспечения':1,
        }

metadict_army['Десантно-штурмовая дивизия'] = {
        'Управление дивизии':1,
        'Десантно-штурмовой полк':3,
        'Лёгкий артиллерийский полк':1,
        'Полк зенитных ракет ближнего действия':1,
        'Полк транспортных планёров':1,
        'Полк боевого обеспечения':1,
        'Полк тылового обеспечения':1,
        }

metadict_army['Крылатая боевая дивизия'] = {
        'Управление дивизии':1,
        'Полк ракетных планёров':3,
        'Полк бомбонесущих планёров':3,
        'Полк боевого обеспечения крылатых':1,
        'Полк тылового обеспечения крылатых':1,
        }

metadict_army['Крылатая транспортная дивизия'] = {
        'Управление дивизии':1,
        'Полк транспортных планёров':6,
        'Полк боевого обеспечения крылатых':1,
        'Полк тылового обеспечения крылатых':1,
        }

metadict_army['Оперативно-тактическая ракетная дивизия'] = {
        'Управление дивизии':1,
        'Бригада оперативно-тактических ракет':3,
        'Полк боевого обеспечения РВСН':1,
        'Полк тылового обеспечения РВСН':1,
        }

metadict_army['Стратегическая ракетная дивизия'] = {
        # У понек исключительно шахтные установки.
        # Континент в мире один, так что аббревиатура МБР неуместна.
        'Управление дивизии':1,
        'Полк шахтных МБР':3,
        'Техническая ракетная база':1,
        'Полк боевого обеспечения РВСН':1,
        'Полк тылового обеспечения РВСН':1,
        }

metadict_army['Зенитная ракетная дивизия'] = {
        'Управление дивизии':1,
        'Полк зенитных ракет малой дальности':3,
        'Полк зенитных ракет средней дальности':3,
        'Полк боевого обеспечения ПВО':1,
        'Полк тылового обеспечения ПВО':1,
        }

metadict_army['Зенитная ракетная дивизия большой дальности'] = {
        'Управление дивизии':1,
        'Полк зенитных ракет большой дальности':6,
        'Техническая зенитно-ракетная база':1,
        'Полк боевого обеспечения ПВО':1,
        'Полк тылового обеспечения ПВО':1,
        }

metadict_army['Дивизия инженерных войск'] = {
        'Управление дивизии':1,
        'Бригада войск РХБ защиты':1,
        'Понтонно-мостовая бригада':1,
        'Инженерно-дорожная бригада':1,
        'Инженерно-техническая бригада':1,
        'Штурмовая инженерно-сапёрная бригада':1,
        'Полк боевого обеспечения инженерных войск':1,
        'Полк тылового обеспечения':1,
        }

metadict_army['Дивизия связи и разведки'] = {
        'Управление дивизии':1,
        'Бригада связи':1,
        'Бригада радиоэлектронной разведки':1,
        'Бригада радиоэлектронного подавления':1,
        'Бригада глубинной разведки':1,
        'Бригада военной полиции':1,
        'Полк тылового обеспечения войск связи':1,
        }

metadict_army['Дивизия тылового обеспечения'] = {
        'Управление дивизии':1,
        'Бригада снабжения':1,
        'Армейские склады':1,
        'Военный госпиталь':1,
        'Подвижная ремонтно-техническая база':1,
        'Армейская ремонтно-восстановительная база':1,
        }

metadict_army['Истребительная авиационная дивизия'] = {
        'Управление дивизии':1,
        'Истребительный авиационный полк':3,
        'Военный аэродром':3,
        }

metadict_army['Транспортная авиационная дивизия'] = {
        'Управление дивизии':1,
        'Транспортный авиационный полк':3,
        }

metadict_army['Боевые части Тандерхеда'] = {
        'Командование Тандерхеда':1,
        'Полк зенитных ракет большой дальности':1,
        'Бригада оперативно-тактических ракет':1,
        'Бригада связи':1,
        'Стационарная АЭС':1,
        }

metadict_army['Службы Тандерхеда'] = {
        'Радиотехническая служба Тандерхеда':1,
        'Медицинская служба Тандерхеда':1,
        'Интендантская служба Тандерхеда':1,
        'Ремонтная база Тандерхеда':1,
        }

metadict_army['Авиакрыло Тандерхеда'] = {
        'Управление дивизии':1,
        'Истребительный авиационный полк':3,
        'Транспортный авиационный полк':1,
        'Военный аэродром':1,
        }

metadict_army['Ремонтные предприятия группы армий'] = {
        'Ремонтный завод инженерной техники':1,
        'Артиллерийский ремонтный завод':2,
        'Ремонтный завод средств связи':1,
        'Бронетанковый ремонтный завод':3,
        'Авторемонтный завод':3,
        }

metadict_army['Склады и арсеналы группы армий'] = {
        'База хранения вооружений и техники':5,
        'Артиллерийская база боеприпасов':5,
        'Склады особых боеприпасов':5,
        'Арсенал вооружений':3,
        }

#----
# Полки, бригады:

metadict_army['Пегасо-десантный полк'] = {
        'Управление полка':1,
        'Пегасо-десантный батальон':3,
        'Дивизион 120-мм гаубиц':1,
        'Эскадрилья боевых планёров':1,
        'Батальон боевого обеспечения':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Десантно-штурмовой полк'] = {
        'Управление полка':1,
        'Десантно-штурмовой батальон':3,
        'Дивизион 120-мм гаубиц':1,
        'Эскадрилья боевых планёров':1,
        'Батальон боевого обеспечения':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Мотострелковый полк'] = {
        'Управление полка':1,
        'Мотострелковый батальон':3,
        'Дивизион 120-мм САУ':1,
        'Эскадрилья боевых планёров':1,
        'Батальон боевого обеспечения (бронетехника)':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Механизированный полк'] = {
        'Управление полка':1,
        'Механизированный батальон':3,
        'Дивизион 120-мм гаубиц':1,
        'Эскадрилья боевых планёров':1,
        'Батальон боевого обеспечения':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Танковый полк'] = {
        'Управление полка':1,
        'Мотострелковый батальон':1,
        'Танковый батальон':3,
        'Дивизион 120-мм САУ':1,
        'Эскадрилья боевых планёров':1,
        'Батальон боевого обеспечения (бронетехника)':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Лёгкий артиллерийский полк'] = {
        'Управление полка':1,
        'Дивизион 150-мм гаубиц':3,
        'Дивизион 210-мм РСЗО':1,
        'Дивизион тактических ракет':1,
        'Дивизион управления и артиллерийской разведки':1,
        'Рота снабжения (боеприпасы)':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Самоходно-артиллерийский полк'] = {
        'Управление полка':1,
        'Дивизион 150-мм САУ':3,
        'Дивизион 210-мм РСЗО':1,
        'Дивизион тактических ракет':1,
        'Дивизион управления и артиллерийской разведки':1,
        'Рота снабжения (боеприпасы)':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Полк ракетных планёров'] = {
        'Управление полка':1,
        'Эскадрилья ракетных планёров':1,
        'Эскадрилья противотанковых планёров':1,
        'Эскадрилья противовоздушных планёров':1,
        'Батальон боевого обеспечения':1,
        'Рота снабжения (боеприпасы)':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Полк бомбонесущих планёров'] = {
        'Управление полка':1,
        'Эскадрилья бомбонесущих планёров':3,
        'Батальон боевого обеспечения':1,
        'Рота снабжения (боеприпасы)':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Полк транспортных планёров'] = {
        'Управление полка':1,
        'Эскадрилья тяжёлых планёров':1,
        'Эскадрилья транспортных планёров':3,
        'Батальон боевого обеспечения':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Истребительный авиационный полк'] = {
        'Управление полка':1,
        'Командный пункт авиаполка':1,
        'Эскадрилья истребителей-бомбардировщиков':3,
        'Технико-эксплуатационная часть':1,
        }

metadict_army['Транспортный авиационный полк'] = {
        'Управление полка':1,
        'Командный пункт авиаполка':1,
        'Эскадрилья транспортной авиации':1,
        'Технико-эксплуатационная часть':1,
        }

metadict_army['Полк боевого обеспечения'] = {
        'Управление полка':1,
        'Батальон связи':1,
        'Батальон военной полиции':1,
        'Разведывательный батальон':1,
        'Инженерно-сапёрный батальон':1,
        }

metadict_army['Полк боевого обеспечения крылатых'] = {
        'Управление полка':1,
        'Батальон связи тыловой':1,
        'Батальон военной полиции':1,
        'Разведывательный батальон':1,
        'Инженерно-сапёрный батальон крылатых':1,
        }

metadict_army['Полк боевого обеспечения ПВО'] = {
        'Управление полка':1,
        'Батальон связи тыловой':1,
        'Батальон военной полиции':1,
        'Инженерный батальон РВСН':1,
        }

metadict_army['Полк боевого обеспечения РВСН'] = {
        'Управление полка':1,
        'Батальон связи тыловой':1,
        'Батальон военной полиции':1,
        'Инженерный батальон РВСН':1,
        }

metadict_army['Полк боевого обеспечения танковых войск'] = {
        'Управление полка':1,
        'Батальон связи':1,
        'Батальон военной полиции':1,
        'Разведывательный батальон':1,
        'Инженерно-сапёрный батальон':2,
        }

metadict_army['Полк боевого обеспечения инженерных войск'] = {
        'Управление полка':1,
        'Батальон связи':1,
        'Батальон военной полиции':1,
        'Разведывательный батальон':1,
        }

metadict_army['Полк тылового обеспечения'] = {
        'Управление полка':1,
        'Батальон снабжения':1,
        'Батальон обслуживания':1,
        'Ремонтно-восстановительный батальон':1,
        'Медико-санитарный батальон':1,
        }

metadict_army['Полк тылового обеспечения крылатых'] = {
        'Управление полка':1,
        'Батальон снабжения':1,
        'Батальон обслуживания':1,
        'Ремонтно-восстановительный батальон (планёры)':1,
        'Медико-санитарный батальон':1,
        }

metadict_army['Полк тылового обеспечения танковых войск'] = {
        'Управление полка':1,
        'Батальон снабжения танковых войск':1,
        'Батальон обслуживания':1,
        'Ремонтно-восстановительный батальон (бронетехника)':1,
        'Медико-санитарный батальон':1,
        }

metadict_army['Полк тылового обеспечения войск связи'] = {
        'Управление полка':1,
        'Батальон снабжения':1,
        'Батальон обслуживания':1,
        'Ремонтно-восстановительный батальон (радиотехника)':1,
        'Медико-санитарный батальон':1,
        }

metadict_army['Полк тылового обеспечения ПВО'] = {
        'Управление полка':1,
        'Батальон снабжения ПВО':1,
        'Батальон обслуживания ПВО':1,
        'Ремонтно-восстановительный батальон':1,
        'Медико-санитарный батальон':1,
        }

metadict_army['Полк тылового обеспечения РВСН'] = {
        'Управление полка':1,
        'Батальон снабжения РВСН':1,
        'Батальон обслуживания РВСН':1,
        'Ремонтно-восстановительный батальон':1,
        'Медико-санитарный батальон':1,
        }

metadict_army['Бригада войск РХБ защиты'] = {
        'Управление полка':1,
        'Батальон войск РХБ защиты':2,
        'Батальон дальней РХБ разведки':1,
        'Батальон аэрозольного противодействия':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Понтонно-мостовая бригада'] = {
        'Управление полка':1,
        'Понтонно-мостовой батальон':4,
        'Батальон связи и охраны':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Инженерно-дорожная бригада'] = {
        'Управление полка':1,
        'Инженерно-дорожный батальон':3,
        'Рота специальной обработки войск РХБЗ':1,
        'Батальон связи и охраны':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Инженерно-техническая бригада'] = {
        'Управление полка':1,
        'Инженерно-технический батальон':3,
        'Батальон связи и охраны':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Штурмовая инженерно-сапёрная бригада'] = {
        'Управление полка':1,
        'Штурмовой инженерно-сапёрный батальон':3,
        'Дивизион 120-мм САУ':1,
        'Эскадрилья боевых планёров':1,
        'Батальон боевого обеспечения (бронетехника)':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Бригада связи'] = {
        'Управление полка':1,
        'Узловой батальон связи':1,
        'Батальон тропосферной связи':1,
        'Линейно-кабельный батальон связи':1,
        'Радиорелейный батальон связи':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Бригада глубинной разведки'] = {
        'Управление полка':1,
        'Батальон глубинной разведки':3,
        'Дивизион 120-мм гаубиц':1,
        'Эскадрилья боевых планёров':1,
        'Батальон связи и охраны':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Бригада военной полиции'] = {
        'Управление полка':1,
        'Батальон военной полиции':3,
        'Дивизион 120-мм гаубиц':1,
        'Батальон стальных рейнджеров':1,
        'Батальон связи и охраны':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Бригада радиоэлектронной разведки'] = {
        'Управление полка':1,
        'Батальон радиоэлектронной разведки':1,
        'Батальон дальней радиотехнической разведки':1,
        'Батальон связи и охраны':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Бригада радиоэлектронного подавления'] = {
        'Управление полка':1,
        'Батальон радиоэлектронного подавления':1,
        'Батальон радиопомех самолётным средствам':1,
        'Батальон радиопомех наземным средствам':1,
        'Батальон связи и охраны':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Бригада оперативно-тактических ракет'] = {
        'Управление полка':1,
        'Дивизион оперативно-тактических ракет':3,
        'Батарея регламента и ремонта (баллистические ракеты)':1,
        'Метеорологическая батарея':1,
        'Батальон связи и охраны':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Полк шахтных МБР'] = {
        'Управление полка':1,
        'Дивизион шахтных МБР':6,
        'Батарея регламента и ремонта (баллистические ракеты)':1,
        'Дивизион боевого обеспечения РВСН':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Полк зенитных ракет ближнего действия'] = {
        'Управление полка':1,
        'Дивизион зенитных ракет ближнего действия':3,
        'Дивизион управления и зенитной разведки':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Полк зенитных ракет малой дальности'] = {
        'Управление полка':1,
        'Дивизион зенитных ракет малой дальности':2,
        'Дивизион управления и зенитной разведки':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Полк зенитных ракет средней дальности'] = {
        'Управление полка':1,
        'Дивизион зенитных ракет средней дальности':2,
        'Дивизион управления и зенитной разведки':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Полк зенитных ракет большой дальности'] = {
        'Управление полка':1,
        'Дивизион зенитных ракет большой дальности':3,
        'Дивизион управления и зенитной разведки':1,
        'Ремонтная рота (зенитные ракеты)':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Бригада снабжения'] = {
        'Управление полка':1,
        'Батальон снабжения (боеприпасы)':4,
        'Батальон снабжения (топливо и маховики)':1,
        'Батальон снабжения (продовольствие и снаряжение)':1,
        'Батальон связи и охраны':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Военный аэродром'] = {
        'Управление полка':1,
        'Батальон аэродромно-технического обеспечения':1,
        'Батальон связи тыловой':1,
        'Склады военного аэродрома':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Стационарная АЭС'] = {
        'Управление стационарной АЭС':1,
        'Дивизион управления работой реактора':1,
        'Дивизион механических систем реактора':1,
        'Рота ведомственной охраны':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Техническая ракетная база'] = {
        'Управление полка':1,
        'Цеха ракетной базы':1,
        'Склады ракетной базы':1,
        'Батальон связи и охраны':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Армейские склады'] = {
        'Управление полка':1,
        'Батальон ведомственной охраны':1,
        'Склады артиллерийских боеприпасов':2,
        'Склады продовольствия':2,
        'Склады снаряжения':1,
        'Склады топлива':2,
        }

metadict_army['Интендантская служба Тандерхеда'] = {
        'Главное управление армейских складов':1,
        'Батальон ведомственной охраны':1,
        'Склады артиллерийских боеприпасов':2,
        'Склады продовольствия':2,
        'Склады снаряжения':1,
        'Склады топлива':2,
        }

#----
# Батальоны, дивизионы, эскадрильи:

metadict_army['Пегасо-десантный батальон'] = {
        'Управление пегасо-десантного батальона':1,
        'Пегасо-десантная рота':3,
        'Рота тяжёлого оружия (аэромобильная)':1,
        'Противотанковая батарея (аэромобильная)':1,
        'Батарея станковых 80-мм миномётов (аэромобильная)':1,
        'Рота обеспечения десанта':1,
        }

metadict_army['Десантно-штурмовой батальон'] = {
        'Управление десантно-штурмового батальона':1,
        'Десантно-штурмовая рота':3,
        'Рота боевых роботов':1,
        'Батарея станковых 80-мм миномётов (аэромобильная)':1,
        'Рота обеспечения мотострелков':1,
        }

metadict_army['Мотострелковый батальон'] = {
        'Управление мотострелкового батальона':1,
        'Мотострелковая рота':3,
        'Рота боевых роботов':1,
        'Батарея автоматических 80-мм миномётов':1,
        'Рота обеспечения мотострелков':1,
        }

metadict_army['Механизированный батальон'] = {
        'Управление механизированного батальона':1,
        'Механизированная рота':3,
        'Рота тяжёлого оружия (аэромобильная)':1,
        'Противотанковая батарея (аэромобильная)':1,
        'Батарея автоматических 80-мм миномётов':1,
        'Рота обеспечения мотострелков':1,
        }

metadict_army['Танковый батальон'] = {
        'Управление танкового батальона':1,
        'Танковая рота':3,
        'Рота боевых роботов':1,
        'Рота обеспечения мотострелков':1,
        }

metadict_army['Батальон боевого обеспечения'] = {
        'Управление батальона боевого обеспечения':1,
        'Рота связи полковая':1,
        'Рота военной полиции':1,
        'Разведывательная рота (аэромобильная)':1,
        'Инженерно-сапёрная рота':1,
        'Взвод эвакуации раненых (аэромобильный)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон боевого обеспечения (бронетехника)'] = {
        'Управление батальона боевого обеспечения':1,
        'Рота связи полковая':1,
        'Рота военной полиции':1,
        'Разведывательная рота (бронетехника)':1,
        'Инженерно-сапёрная рота':1,
        'Взвод эвакуации раненых (аэромобильный)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон связи и охраны'] = {
        'Управление батальона связи и охраны':1,
        'Рота связи полковая':1,
        'Рота ведомственной охраны':1,
        'Инженерно-сапёрная рота':1,
        'Взвод эвакуации раненых (аэромобильный)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион управления и артиллерийской разведки'] = {
        'Управление дивизиона артиллерийской разведки':1,
        'Батарея управления':1,
        'Рота военной полиции':1,
        'Инженерно-сапёрная рота':1,
        'Батарея артиллерийской разведки':1,
        'Взвод эвакуации раненых (аэромобильный)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион управления и зенитной разведки'] = {
        'Управление дивизиона зенитной разведки':1,
        'Батарея управления':1,
        'Рота военной полиции':1,
        'Инженерно-сапёрная рота':1,
        'Рота радиолокационной разведки':1,
        'Взвод эвакуации раненых (аэромобильный)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион боевого обеспечения РВСН'] = {
        'Управление батальона боевого обеспечения':1,
        'Командный пункт РВСН':1,
        'Рота военной полиции':1,
        'Инженерно-технический взвод':1,
        }

metadict_army['Батальон тылового обеспечения'] = {
        'Управление тылового батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота снабжения (боеприпасы)':1,
        'Рота снабжения (топливо и маховики)':1,
        'Рота снабжения (продовольствие и снаряжение)':1,
        'Ремонтный взвод (автомобили)':1,
        'Медицинский пункт полка':1,
        'Взвод обслуживания':1,
        }

metadict_army['Дивизион 120-мм гаубиц'] = {
        'Управление дивизиона 120-мм гаубиц':1,
        'Взвод управления артиллерией':1,
        'Батарея 120-мм гаубиц':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион 120-мм САУ'] = {
        'Управление дивизиона 120-мм САУ':1,
        'Взвод управления артиллерией':1,
        'Батарея 120-мм САУ':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион 150-мм гаубиц'] = {
        'Управление дивизиона 150-мм гаубиц':1,
        'Взвод управления артиллерией':1,
        'Батарея 150-мм гаубиц':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион 150-мм САУ'] = {
        'Управление дивизиона 150-мм САУ':1,
        'Взвод управления артиллерией':1,
        'Батарея 150-мм САУ':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион 210-мм РСЗО'] = {
        # http://rbase.new-factoria.ru/missile/wobb/uraga/uraga.shtml
        'Управление дивизиона 210-мм РСЗО':1,
        'Взвод управления артиллерией':1,
        'Батарея 210-мм РСЗО':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион тактических ракет'] = {
        # http://rbase.new-factoria.ru/missile/wobb/lance/lance.shtml
        # http://rbase.new-factoria.ru/missile/wobb/tochka/tochka.shtml
        'Управление дивизиона тактических ракет':1,
        'Взвод управления артиллерией':1,
        'Батарея тактических ракет':2,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион оперативно-тактических ракет'] = {
        # http://rbase.new-factoria.ru/missile/wobb/8k14/8k14.shtml
        # http://rbase.new-factoria.ru/missile/wobb/9k76/9k76.shtml
        'Управление дивизиона оперативно-тактических ракет':1,
        'Взвод управления артиллерией':1,
        'Батарея оперативно-тактических ракет':2,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион шахтных МБР'] = {
        # http://rbase.new-factoria.ru/missile/wobb/8k84/8k84.shtml
        'Управление дивизиона шахтных МБР':1,
        'Группа управления (шахтная МБР)':1,
        'Группа подготовки и запуска (шахтная МБР)':3,
        }

metadict_army['Дивизион зенитных ракет ближнего действия'] = {
        # https://ru.wikipedia.org/wiki/Оса_(зенитный_ракетный_комплекс)
        'Управление дивизиона ЗРК ближнего действия':1,
        'Взвод управления зенитного дивизиона':1,
        'Батарея ЗРК ближнего действия':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион зенитных ракет малой дальности'] = {
        # https://ru.wikipedia.org/wiki/Куб_(зенитный_ракетный_комплекс)
        # http://rbase.new-factoria.ru/missile/wobb/kub/kub.shtml
        'Управление дивизиона ЗРК малой дальности':1,
        'Взвод управления зенитного дивизиона':1,
        'Батарея ЗРК малой дальности':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион зенитных ракет средней дальности'] = {
        # У понек хорошие радары, но ракеты на жидком топливе:
        # https://ru.wikipedia.org/wiki/Бук_(зенитный_ракетный_комплекс)
        # https://ru.wikipedia.org/wiki/Круг_(зенитный_ракетный_комплекс)
        # Нужен взвод подготовки к старту, заправки топливом, техобслуживания.
        'Управление дивизиона ЗРК средней дальности':1,
        'Взвод управления зенитного дивизиона':1,
        'Батарея ЗРК средней дальности':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Дивизион зенитных ракет большой дальности'] = {
        # Это комплекс объектной обороны, фронтового звена:
        # http://rbase.new-factoria.ru/missile/wobb/c200/c200.shtml
        'Управление дивизиона ЗРК большой дальности':1,
        'Взвод управления зенитного дивизиона':1,
        'Расчёт ЗРК большой дальности':6,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Эскадрилья истребителей-бомбардировщиков'] = {
        'Управление эскадрильи истребителей-бомбардировщиков':1,
        'Звено истребителей-бомбардировщиков':3,
        'Группа обеспечения авиации':1,
        }

metadict_army['Эскадрилья транспортной авиации'] = {
        'Управление эскадрильи транспортной авиации':1,
        'Звено транспортной авиации':3,
        'Группа обеспечения авиации':3,
        }

metadict_army['Эскадрилья тяжёлых планёров'] = {
        'Управление эскадрильи тяжёлых планёров':1,
        'Тяжёлый планёр (транспортный)':36,
        'Рота транспортировки (авиация)':1,
        }

metadict_army['Эскадрилья боевых планёров'] = {
        'Управление эскадрильи боевых планёров':1,
        'Рота боевых планёров (авиабомбы)':1,
        'Рота боевых планёров (реактивные снаряды)':1,
        'Рота боевых планёров (зенитные ракеты)':1,
        }

metadict_army['Эскадрилья бомбонесущих планёров'] = {
        'Управление эскадрильи бомбонесущих планёров':1,
        'Рота боевых планёров (авиабомбы)':3,
        }

metadict_army['Эскадрилья ракетных планёров'] = {
        'Управление эскадрильи ракетных планёров':1,
        'Рота боевых планёров (реактивные снаряды)':3,
        }

metadict_army['Эскадрилья противотанковых планёров'] = {
        'Управление эскадрильи противотанковых планёров':1,
        'Рота боевых планёров (управляемые ракеты)':3,
        }

metadict_army['Эскадрилья противовоздушных планёров'] = {
        'Управление эскадрильи противовоздушных планёров':1,
        'Рота боевых планёров (зенитные ракеты)':3,
        }

metadict_army['Эскадрилья транспортных планёров'] = {
        'Управление эскадрильи транспортных планёров':1,
        'Рота транспортных планёров':3,
        }

metadict_army['Батальон связи'] = {
        'Управление батальона связи':1,
        'Рота пунктов управления дивизии':1,
        'Рота радиоэлектронной борьбы':1,
        'Рота обработки данных':1,
        'Рота обеспечения связи':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон связи тыловой'] = {
        'Управление батальона связи':1,
        'Рота пунктов управления дивизии':1,
        'Рота радиоэлектронной борьбы':1,
        'Рота обработки данных':1,
        'Рота обеспечения связи':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон радиоэлектронной разведки'] = {
        'Управление батальона РЭР':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота радиоразведки':3,
        'Рота перевода и обработки информации':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон радиоэлектронного подавления'] = {
        'Управление батальона РЭБ':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота помех радиовзрывателям':1,
        'Рота радиопомех КВ-диапазона':1,
        'Рота радиопомех УКВ-диапазона':1,
        'Рота роботов радиоподавления':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон радиопомех самолётным средствам'] = {
        'Управление батальона РЭБ':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота радиопомех самолётным средствам':3,
        'Рота радиолокационной разведки':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон дальней радиотехнической разведки'] = {
        'Управление батальона РТР':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота дальней радиотехнической разведки':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Разведывательный батальон'] = {
        'Управление разведывательного батальона':1,
        'Взвод связи (аэромобильный)':1,
        'Разведывательная рота (аэромобильная)':3,
        'Рота радио и радиотехнической разведки':1,
        'Рота разведывательных роботов':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон глубинной разведки'] = {
        'Управление батальона глубинной разведки':1,
        'Взвод связи (аэромобильный)':1,
        'Диверсионно-разведывательная рота':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон стальных рейнджеров'] = {
        'Управление батальона специального назначения':1,
        'Взвод связи (передовой пункт управления батальона)':1,
        'Рота стальных рейнджеров':3,
        'Рота боевых роботов':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон военной полиции'] = {
        'Управление батальона военной полиции':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Патрульная рота (аэромобильная)':1,
        'Рота стальных рейнджеров':1,
        'Оперативная рота военной полиции':1,
        'Рота регулировщиков (аэромобильная)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон ведомственной охраны'] = {
        'Управление батальона ведомственной охраны':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Пожарная рота':1,
        'Рота ведомственной охраны':1,
        'Патрульная рота (аэромобильная)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Инженерно-сапёрный батальон'] = {
        'Управление инженерно-сапёрного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Сапёрная рота':1,
        'Инженерно-дорожная рота':1,
        'Инженерно-техническая рота':1,
        'Рота мобильной АЭС':1,
        'Рота специальной обработки войск РХБЗ':1,
        'Понтонно-мостовая рота':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Штурмовой инженерно-сапёрный батальон'] = {
        'Управление штурмового батальона':1,
        'Взвод связи (передовой пункт управления батальона)':1,
        'Штурмовая рота':3,
        'Батарея автоматических 80-мм миномётов':1,
        'Рота специальной обработки войск РХБЗ':1,
        'Рота боевых роботов':1,
        'Взвод разграждения':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Инженерно-технический батальон'] = {
        'Управление инженерного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Инженерно-техническая рота':3,
        'Рота мобильной АЭС':1,
        'Рота специальной обработки войск РХБЗ':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Инженерно-сапёрный батальон крылатых'] = {
        'Управление инженерно-сапёрного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Сапёрная рота (аэромобильная)':1,
        'Инженерно-техническая рота':1,
        'Рота специальной обработки войск РХБЗ':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Инженерный батальон РВСН'] = {
        'Управление инженерного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Сапёрная рота':1,
        'Инженерно-дорожная рота':1,
        'Инженерно-техническая рота':1,
        'Рота специальной обработки войск РХБЗ':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Понтонно-мостовой батальон'] = {
        # http://saper.isnet.ru//texnica/pmp.html
        'Управление понтонно-мостового батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Понтонно-мостовая рота':2,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Инженерно-дорожный батальон'] = {
        'Управление инженерно-дорожного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Инженерно-дорожная рота':3,
        'Рота регулировщиков (аэромобильная)':1,
        'Патрульная рота (аэромобильная)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон войск РХБ защиты'] = {
        'Управление батальона войск РХБЗ':1,
        'Рота разведки войск РХБЗ':2,
        'Рота очистки войск РХБЗ':2,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон аэрозольного противодействия'] = {
        'Управление батальона аэрозольного противодействия':1,
        'Рота аэрозольных завес войск РХБЗ':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон дальней РХБ разведки'] = {
        'Управление батальона РХБ разведки':1,
        'Рота разведки войск РХБЗ (аэромобильная)':3,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон снабжения'] = {
        'Управление батальона снабжения':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота снабжения (боеприпасы)':1,
        'Рота снабжения (топливо и маховики)':1,
        'Рота снабжения (продовольствие и снаряжение)':1,
        'Ремонтный взвод (автомобили)':1,
        'Взвод транспортных планёров':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон снабжения (боеприпасы)'] = {
        'Управление батальона снабжения':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота снабжения (боеприпасы)':3,
        'Ремонтный взвод (автомобили)':1,
        'Взвод транспортных планёров':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон снабжения (топливо и маховики)'] = {
        'Управление батальона снабжения':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота снабжения (топливо и маховики)':3,
        'Ремонтный взвод (автомобили)':1,
        'Взвод транспортных планёров':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон снабжения (продовольствие и снаряжение)'] = {
        'Управление батальона снабжения':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота снабжения (продовольствие и снаряжение)':3,
        'Ремонтный взвод (автомобили)':1,
        'Взвод транспортных планёров':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон снабжения танковых войск'] = {
        'Управление батальона снабжения':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота снабжения (боеприпасы)':2,
        'Рота снабжения (топливо и маховики)':2,
        'Рота снабжения (продовольствие и снаряжение)':1,
        'Ремонтный взвод (автомобили)':2,
        'Взвод транспортных планёров':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон снабжения РВСН'] = {
        'Управление батальона снабжения':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Железнодорожная станция снабжения':1,
        'Рота снабжения (топливо и маховики)':1,
        'Рота снабжения (продовольствие и снаряжение)':1,
        'Рота транспортировки (стратегические ракеты)':1,
        'Ремонтный взвод (автомобили)':1,
        'Взвод транспортных планёров':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон снабжения ПВО'] = {
        'Управление батальона снабжения':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота снабжения (зенитные ракеты)':1,
        'Рота снабжения (топливо и маховики)':1,
        'Рота снабжения (продовольствие и снаряжение)':1,
        'Ремонтный взвод (автомобили)':1,
        'Взвод транспортных планёров':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон обслуживания'] = {
        'Управление тылового батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Рота инструкторов':1,
        'Рота обслуживания (хлебозавод)':1,
        'Рота обслуживания (прачечные)':1,
        'Рота обслуживания (бани)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон обслуживания РВСН'] = {
        'Управление тылового батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Военная школа младших специалистов РВСН':1,
        'Рота обслуживания':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Батальон обслуживания ПВО'] = {
        'Управление тылового батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Военная школа младших специалистов ПВО':1,
        'Рота обслуживания':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Ремонтно-восстановительный батальон'] = {
        'Управление ремонтного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Ремонтная рота (передовая)':1,
        'Ремонтная рота (лёгкое оружие)':1,
        'Ремонтная рота (тяжёлое оружие)':1,
        'Ремонтная рота (ракетное оружие)':1,
        'Ремонтная рота (лёгкие планёры и БПЛА)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Ремонтно-восстановительный батальон (бронетехника)'] = {
        'Управление ремонтного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Ремонтная рота (передовая)':3,
        'Ремонтная рота (лёгкое оружие)':1,
        'Ремонтная рота (тяжёлое оружие)':3,
        'Ремонтная рота (ракетное оружие)':1,
        'Ремонтная рота (лёгкие планёры и БПЛА)':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Ремонтно-восстановительный батальон (планёры)'] = {
        'Управление ремонтного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Ремонтная рота (передовая)':1,
        'Ремонтная рота (лёгкое оружие)':1,
        'Ремонтная рота (ракетное оружие)':1,
        'Ремонтная рота (лёгкие планёры и БПЛА)':3,
        'Ремонтная рота (тяжёлые планёры)':2,
        'Рота тылового обеспечения':1,
        }

metadict_army['Ремонтно-восстановительный батальон (радиотехника)'] = {
        'Управление ремонтного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Ремонтная рота (радиотехника)':2,
        'Ремонтная рота (лёгкое оружие)':1,
        'Ремонтная рота (лёгкие планёры и БПЛА)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Технико-эксплуатационная часть'] = {
        'Управление ремонтного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Ремонтная рота (системы управления)':1,
        'Ремонтная рота (газотурбинные двигатели)':1,
        'Ремонтная рота (тяжёлые планёры)':1,
        'Ремонтная рота (ракетное оружие)':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Цеха ракетной базы'] = {
        'Управление тылового батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Ремонтная рота ликвидации аварий':1,
        'Сборочный цех (баллистические ракеты)':2,
        'Ремонтный цех (системы навигации)':1,
        'Ремонтный цех (системы управления)':1,
        'Ремонтный цех (пусковые установки)':1,
        'Ремонтный цех (системы электроснабжения)':1,
        'Ремонтный цех (системы сигнализации и охраны)':1,
        }

metadict_army['Батальон аэродромно-технического обеспечения'] = {
        'Управление батальона аэродромно-технического обеспечения':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Аэродромно-эксплуатационная рота':1,
        'Рота ведомственной охраны':1,
        'Взвод тылового обеспечения':1,
        'Автотехническая рота':1,
        }

metadict_army['Медико-санитарный батальон'] = {
        'Управление медико-санитарного батальона':1,
        'Взвод связи (тыловой пункт управления батальона)':1,
        'Медицинская рота':1,
        'Медицинский взвод':1,
        'Рота эвакуации раненых (аэромобильная)':1,
        'Отделение медицинского снабжения':1,
        'Санитарно-эпидемиологическая лаборатория':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Склады продовольствия'] = {
        'Управление армейских складов':1,
        'Складкской терминал продовольствия':3,
        }

metadict_army['Склады артиллерийских боеприпасов'] = {
        'Управление армейских складов':1,
        'Складской терминал боеприпасов':3,
        }

metadict_army['Склады снаряжения'] = {
        'Управление армейских складов':1,
        'Складской терминал снаряжения':2,
        'Складской терминал строительных материалов':1,
        }

metadict_army['Склады топлива'] = {
        'Управление армейских складов':1,
        'Складской терминал жидкого топлива':2,
        'Складской терминал твёрдого топлива':1,
        }

#----
# Роты, батареи, авиационные звенья:

metadict_army['Батарея станковых 80-мм миномётов (аэромобильная)'] = {
        'Управление миномётной батареи (аэромобильное)':1,
        'Отделение связи (аэромобильное)':1,
        'Отделение артиллерийской разведки (аэромобильное)':1,
        'Огневой взвод станковых 80-мм миномётов (аэромобильный)':2,
        }

metadict_army['Батарея автоматических 80-мм миномётов'] = {
        'Управление батареи батальонных САУ':1,
        'Артиллерийский командный пункт':1,
        'Отделение артиллерийской разведки (аэромобильное)':1,
        'Огневой взвод автоматических 80-мм миномётов':2,
        }

metadict_army['Батарея 120-мм гаубиц'] = {
        'Управление батареи полковых гаубиц':1,
        'Артиллерийский командный пункт':1,
        'Отделение управления огнём артиллерии':1,
        'Огневой взвод 120-мм гаубиц':2,
        }

metadict_army['Батарея 120-мм САУ'] = {
        'Управление батареи полковых САУ':1,
        'Артиллерийский командный пункт':1,
        'Отделение управления огнём артиллерии':1,
        'Огневой взвод 120-мм САУ':2,
        }

metadict_army['Батарея 150-мм гаубиц'] = {
        'Управление батареи дивизионных гаубиц':1,
        'Артиллерийский командный пункт':1,
        'Отделение управления огнём артиллерии':1,
        'Огневой взвод 150-мм гаубиц':2,
        'Отделение снабжения (боеприпасы)':1,
        }

metadict_army['Батарея 150-мм САУ'] = {
        'Управление батареи дивизионных САУ':1,
        'Артиллерийский командный пункт':1,
        'Отделение управления огнём артиллерии':1,
        'Огневой взвод 150-мм САУ':2,
        'Отделение снабжения (боеприпасы)':1,
        }

metadict_army['Батарея 210-мм РСЗО'] = {
        'Управление батареи РСЗО':1,
        'Артиллерийский командный пункт':1,
        'Отделение управления огнём артиллерии':1,
        'Огневой взвод 210-мм РСЗО':3,
        'Отделение снабжения (боеприпасы)':1,
        }

metadict_army['Батарея тактических ракет'] = {
        'Управление батареи тактических ракет':1,
        'Артиллерийский командный пункт':1,
        'Расчёт тактических ракет':3,
        }

metadict_army['Батарея оперативно-тактических ракет'] = {
        'Управление батареи оперативно-тактических ракет':1,
        'Артиллерийский командный пункт':1,
        'Расчёт оперативно-тактических ракет':3,
        }

metadict_army['Батарея артиллерийской разведки'] = {
        'Управление батареи артиллерийской разведки':1,
        'Взвод связи (радиорелейный)':1,
        'Взвод радиолокационной разведки':1,
        'Взвод звукометрической разведки':1,
        'Топогеодезический взвод':1,
        'Метеорологический взвод':1,
        }

metadict_army['Батарея ЗРК ближнего действия'] = {
        'Управление батареи ЗРК ближнего действия':1,
        'Отделение связи зенитной батареи':1,
        'Взвод ЗРК ближнего действия':3,
        }

metadict_army['Батарея ЗРК малой дальности'] = {
        'Управление батареи ЗРК малой дальности':1,
        'Отделение связи зенитной батареи':1,
        'Расчёт ЗРК малой дальности':4,
        }

metadict_army['Батарея ЗРК средней дальности'] = {
        'Управление батареи ЗРК средней дальности':1,
        'Отделение связи зенитной батареи':1,
        'Расчёт ЗРК средней дальности':3,
        }

metadict_army['Патрульная рота (аэромобильная)'] = {
        'Управление роты военной полиции':1,
        'Патрульный взвод (аэромобильный)':3,
        }

metadict_army['Рота регулировщиков (аэромобильная)'] = {
        'Управление роты военной полиции':1,
        'Взвод регулировщиков (аэромобильный)':3,
        }

metadict_army['Рота военной полиции'] = {
        'Управление роты военной полиции':1,
        'Патрульный взвод (аэромобильный)':1,
        'Взвод военной полиции':1,
        'Взвод регулировщиков (аэромобильный)':1,
        }

metadict_army['Пегасо-десантная рота'] = {
        'Управление пегасо-десантной роты':1,
        'Пегасо-десантный взвод':3,
        'Взвод тяжёлого оружия':1,
        }

metadict_army['Десантно-штурмовая рота'] = {
        'Управление десантно-штурмовой роты':1,
        'Десантно-штурмовой взвод':3,
        }

metadict_army['Мотострелковая рота'] = {
        'Управление мотострелковой роты':1,
        'Мотострелковый взвод':3,
        }

metadict_army['Механизированная рота'] = {
        'Управление механизированной роты':1,
        'Механизированный взвод':3,
        }

metadict_army['Танковая рота'] = {
        'Управление танковой роты':1,
        'Танковый взвод':3,
        }

metadict_army['Рота тяжёлого оружия (аэромобильная)'] = {
        'Управление роты тяжёлого оружия (аэромобильное)':1,
        'Пулемётный взвод (аэромобильный)':1,
        'Гранатомётный взвод (аэромобильный)':1,
        }

metadict_army['Противотанковая батарея (аэромобильная)'] = {
        'Управление противотанковой батареи (аэромобильное)':1,
        'Противотанковый взвод (аэромобильный)':3,
        }

metadict_army['Рота боевых роботов'] = {
        'Управление роты боевых роботов':1,
        'Отделение командно-штабной машины':1,
        'Взвод штурмовых роботов':3,
        }

metadict_army['Разведывательная рота (бронетехника)'] = {
        'Управление разведывательной роты (бронетехника)':1,
        'Разведывательный взвод (бронетехника)':3,
        'Взвод радиоперехвата и радиопеленгации УКВ-диапазона (аэромобильный)':1,
        'Взвод технических средств разведки':1,
        }

metadict_army['Разведывательная рота (аэромобильная)'] = {
        'Управление разведывательной роты (аэромобильное)':1,
        'Разведывательный взвод (аэромобильный)':3,
        'Взвод радиоперехвата и радиопеленгации УКВ-диапазона (аэромобильный)':1,
        'Взвод технических средств разведки':1,
        }

metadict_army['Диверсионно-разведывательная рота'] = {
        'Управление диверсионно-разведывательной роты':1,
        'Диверсионно-разведывательный взвод (аэромобильный)':3,
        'Снайперский взвод (аэромобильный)':1,
        }

metadict_army['Оперативная рота военной полиции'] = {
        'Управление роты военной полиции':1,
        'Взвод военной полиции':3,
        }

metadict_army['Рота ведомственной охраны'] = {
        'Управление роты ведомственной охраны':1,
        'Взвод ведомственной охраны':3,
        }

metadict_army['Пожарная рота'] = {
        'Управление инженерной роты':1,
        'Пожарный взвод':1,
        'Диспечерская пожарной роты':1,
        }

metadict_army['Рота стальных рейнджеров'] = {
        'Управление роты стальных рейнджеров':1,
        'Взвод стальных рейнджеров':3,
        }

metadict_army['Звено истребителей-бомбардировщиков'] = {
        'Управление звена истребителей-бомбардировщиков':1,
        'Пара истребителей-бомбардировщиков':2,
        }

metadict_army['Звено транспортной авиации'] = {
        'Управление звена транспортной авиации':1,
        'Экипаж транспортного экранолёта':4,
        }

metadict_army['Рота боевых планёров (реактивные снаряды)'] = {
        'Управление роты ракетных планёров':1,
        'Взвод боевых планёров (реактивные снаряды)':3,
        }

metadict_army['Рота боевых планёров (управляемые ракеты)'] = {
        'Управление роты противотанковых планёров':1,
        'Взвод боевых планёров (управляемые ракеты)':3,
        }

metadict_army['Рота боевых планёров (зенитные ракеты)'] = {
        'Управление роты противовоздушных планёров':1,
        'Взвод боевых планёров (зенитные ракеты)':3,
        }

metadict_army['Рота боевых планёров (авиабомбы)'] = {
        'Управление роты планёров-бомбардировщиков':1,
        'Взвод боевых планёров (авиабомбы)':3,
        }

metadict_army['Рота транспортных планёров'] = {
        'Управление роты транспортных планёров':1,
        'Взвод транспортных планёров':3,
        }

metadict_army['Рота разведки войск РХБЗ'] = {
        'Управление роты РХБ разведки':1,
        'Взвод РХБ разведки':3,
        }

metadict_army['Рота разведки войск РХБЗ (аэромобильная)'] = {
        'Управление роты РХБ разведки (аэромобильное)':1,
        'Взвод РХБ разведки (аэромобильный)':3,
        }

metadict_army['Рота очистки войск РХБЗ'] = {
        'Управление роты войск РХБЗ':1,
        'Взвод РХБ очистки':3,
        }

metadict_army['Рота аэрозольных завес войск РХБЗ'] = {
        'Управление роты войск РХБЗ':1,
        'Взвод аэрозольных завес':3,
        }

metadict_army['Рота специальной обработки войск РХБЗ'] = {
        'Управление роты войск РХБЗ':1,
        'Взвод РХБ разведки':1,
        'Взвод РХБ очистки':1,
        'Взвод аэрозольных завес':1,
        }

metadict_army['Инженерно-дорожная рота'] = {
        'Управление инженерной роты':1,
        'Взвод разграждения':1,
        'Взвод механизированных мостов':1,
        }

metadict_army['Сапёрная рота'] = {
        'Управление сапёрной роты':1,
        'Сапёрный взвод':2,
        'Взвод управляемого минирования':1,
        }

metadict_army['Сапёрная рота (аэромобильная)'] = {
        'Управление сапёрной роты (аэромобильное)':1,
        'Сапёрный взвод (аэромобильный)':3,
        }

metadict_army['Штурмовая рота'] = {
        'Управление штурмовой роты':1,
        'Огнемётный взвод':3,
        }

metadict_army['Инженерно-сапёрная рота'] = {
        'Управление инженерно-сапёрной роты':1,
        'Сапёрный взвод':1,
        'Взвод управляемого минирования':1,
        'Инженерно-технический взвод':1,
        'Взвод РХБ наблюдения':1,
        }

metadict_army['Инженерно-техническая рота'] = {
        'Управление инженерной роты':1,
        'Взвод полевого водоснабжения':1,
        'Взвод землеройных машин':1,
        'Взвод оборудования позиций':1,
        'Инженерно-строительный взвод':1,
        }

metadict_army['Аэродромно-эксплуатационная рота'] = {
        'Управление инженерной роты':1,
        'Взвод землеройных машин':1,
        'Взвод оборудования позиций':1,
        'Инженерно-строительный взвод':1,
        'Отделение полевого водоснабжения':1,
        'Взвод аэрозольных завес':1,
        'Взвод РХБ очистки':1,
        }

metadict_army['Понтонно-мостовая рота'] = {
        'Управление понтонно-мостовой роты':1,
        'Понтонно-мостовой взвод':1,
        'Взвод строительства мостов':1,
        'Взвод механизированных мостов':1,
        'Взвод плавающих транспортёров':1,
        'Взвод инженерной разведки':1,
        }

metadict_army['Медицинская рота'] = {
        'Управление медицинской роты':1,
        'Приёмно-сортировочный взвод':1,
        'Операционно-перевязочный взвод':1,
        'Госпитальный взвод':1,
        'Отделение анестезиологии и реанимации':1,
        'Стоматологический кабинет':1,
        'Рентгенологический кабинет':1,
        'Клиническая лаборатория':1,
        }

metadict_army['Медицинский пункт полка'] = {
        'Управление медицинской роты':1,
        'Медицинский взвод':1,
        'Взвод эвакуации раненых (аэромобильный)':1,
        }

metadict_army['Рота эвакуации раненых (аэромобильная)'] = {
        'Управление медицинской роты (аэромобильное)':1,
        'Взвод эвакуации раненых (аэромобильный)':3,
        }

metadict_army['Ремонтная рота (лёгкое оружие)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (стрелковое оружие)':1,
        'Ремонтный взвод (боевая экипировка)':1,
        'Ремонтный взвод (оптические приборы)':1,
        'Ремонтный взвод (радиоэлектроника)':1,
        'Ремонтный взвод (оптитроника)':1,
        }

metadict_army['Ремонтная рота (тяжёлое оружие)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (пушки и гаубицы)':1,
        'Ремонтный взвод (колёсная ходовая)':1,
        'Ремонтный взвод (гусеничная ходовая)':1,
        'Ремонтный взвод (вариаторы и маховики)':1,
        'Ремонтный взвод (двигатели и генераторы)':1,
        }

metadict_army['Ремонтная рота (ракетное оружие)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (реактивная артиллерия)':1,
        'Ремонтный взвод (противотанковые ракеты)':1,
        'Ремонтный взвод (зенитные ракеты)':1,
        'Ремонтный взвод (системы наведения)':1,
        }

metadict_army['Ремонтная рота (зенитные ракеты)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (зенитные ракеты)':1,
        'Ремонтный взвод (системы наведения)':1,
        'Ремонтный взвод (радиоэлектроника)':1,
        'Ремонтный взвод (оптитроника)':1,
        }

metadict_army['Батарея регламента и ремонта (баллистические ракеты)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (баллистические ракеты)':1,
        'Ремонтный взвод (системы наведения)':1,
        'Ремонтный взвод (радиоэлектроника)':1,
        'Ремонтный взвод (оптитроника)':1,
        }

metadict_army['Ремонтная рота (лёгкие планёры и БПЛА)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (лёгкие планёры)':3,
        'Ремонтный взвод (БПЛА)':1,
        }

metadict_army['Ремонтная рота (тяжёлые планёры)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (тяжёлые планёры)':3,
        }

metadict_army['Ремонтная рота (газотурбинные двигатели)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (газотурбинные двигатели)':3,
        }

metadict_army['Ремонтная рота (системы управления)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (оптические приборы)':1,
        'Ремонтный взвод (радиоэлектроника)':1,
        'Ремонтный взвод (оптитроника)':1,
        }

metadict_army['Ремонтная рота (радиотехника)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (радиоэлектроника)':2,
        'Ремонтный взвод (оптитроника)':1,
        }

metadict_army['Рота обеспечения связи'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (радиоэлектроника)':2,
        'Ремонтный взвод (оптитроника)':1,
        }

metadict_army['Ремонтная рота (передовая)'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (аэромобильный)':3,
        'Взвод эвакуации тяжёлой техники':1,
        }

metadict_army['Ремонтная рота ликвидации аварий'] = {
        'Управление ремонтной роты':1,
        'Ремонтный взвод (аэромобильный)':1,
        'Взвод РХБ наблюдения':1,
        'Взвод разграждения':1,
        'Пожарный взвод':1,
        }

metadict_army['Группа обеспечения авиации'] = {
        'Управление ремонтной роты':1,
        'Взвод обеспечения авиации':3,
        'Взвод эвакуации авиатехники':1,
        }

metadict_army['Рота обеспечения десанта'] = {
        'Управление тыловой роты':1,
        'Взвод связи (аэромобильный)':1,
        'Разведывательный взвод (аэромобильный)':1,
        'Взвод эвакуации раненых (аэромобильный)':1,
        'Взвод транспортных планёров':1,
        }

metadict_army['Рота обеспечения мотострелков'] = {
        'Управление тыловой роты':1,
        'Взвод связи (передовой пункт управления батальона)':1,
        'Сапёрный взвод (аэромобильный)':1,
        'Разведывательный взвод (аэромобильный)':1,
        'Взвод эвакуации раненых (аэромобильный)':1,
        'Взвод тылового обеспечения':1,
        }

metadict_army['Рота тылового обеспечения'] = {
        'Управление тыловой роты':1,
        'Отделение связи (радиосвязь)':1,
        'Взвод снабжения (топливо и боеприпасы)':1,
        'Взвод снабжения (продовольствие и снаряжение)':1,
        'Взвод эвакуации раненых (аэромобильный)':1,
        'Ремонтное отделение (автомобили)':1,
        'Взвод обслуживания':1,
        }

metadict_army['Рота обслуживания'] = {
        'Управление тыловой роты':1,
        'Взвод обслуживания (хлебозавод)':1,
        'Взвод обслуживания (прачечные)':1,
        'Взвод обслуживания (бани)':1,
        }

metadict_army['Рота обслуживания (хлебозавод)'] = {
        'Управление тыловой роты':1,
        'Взвод обслуживания (хлебозавод)':3,
        }

metadict_army['Рота обслуживания (прачечные)'] = {
        'Управление тыловой роты':1,
        'Взвод обслуживания (прачечные)':3,
        }

metadict_army['Рота обслуживания (бани)'] = {
        'Управление тыловой роты':1,
        'Взвод обслуживания (бани)':3,
        }

metadict_army['Автотехническая рота'] = {
        'Управление тыловой роты':1,
        'Ремонтный взвод (аэромобильный)':3,
        'Взвод снабжения (боеприпасы)':1,
        'Взвод снабжения (жидкое топливо)':1,
        'Взвод снабжения (снаряжение)':1,
        }

metadict_army['Рота снабжения (боеприпасы)'] = {
        'Управление тыловой роты':1,
        'Взвод снабжения с прицепами (боеприпасы)':3,
        }

metadict_army['Рота снабжения (зенитные ракеты)'] = {
        'Управление тыловой роты':1,
        'Взвод снабжения с прицепами (зенитные ракеты)':3,
        }

metadict_army['Рота снабжения (жидкое топливо)'] = {
        'Управление тыловой роты':1,
        'Взвод снабжения с прицепами (жидкое топливо)':3,
        }

metadict_army['Рота снабжения (топливо и маховики)'] = {
        'Управление тыловой роты':1,
        'Взвод снабжения с прицепами (топливо)':1,
        'Взвод снабжения с прицепами (маховики)':1,
        }

metadict_army['Рота снабжения (продовольствие и снаряжение)'] = {
        'Управление тыловой роты':1,
        'Взвод снабжения с прицепами (продовольствие)':1,
        'Взвод снабжения с прицепами (снаряжение)':1,
        }

metadict_army['Рота транспортировки (авиация)'] = {
        'Управление тыловой роты':1,
        'Взвод транспортировки (авиация)':3,
        }

metadict_army['Рота транспортировки (стратегические ракеты)'] = {
        'Управление тыловой роты':1,
        'Взвод транспортировки (стратегические ракеты)':3,
        }

metadict_army['Рота помех радиовзрывателям'] = {
        'Управление роты РЭБ':1,
        'Взвод помех радиовзрывателям':3,
        }

metadict_army['Рота радиопомех КВ-диапазона'] = {
        'Управление роты РЭБ':1,
        'Взвод радиопомех КВ-диапазона':3,
        }

metadict_army['Рота радиопомех УКВ-диапазона'] = {
        'Управление роты РЭБ':1,
        'Взвод радиопомех УКВ-диапазона':3,
        }

metadict_army['Рота роботов радиоподавления'] = {
        'Управление роты РЭБ':1,
        'Взвод роботов радиоподавления':3,
        }

metadict_army['Рота радиоэлектронной борьбы'] = {
        'Управление роты РЭБ':1,
        'Взвод помех радиовзрывателям':1,
        'Взвод радиопомех КВ-диапазона':1,
        'Взвод радиопомех УКВ-диапазона (аэромобильный)':2,
        'Взвод роботов радиоподавления':1,
        }

metadict_army['Рота радиоразведки'] = {
        'Управление роты РЭР':1,
        'Взвод радиоразведки':3,
        }

metadict_army['Рота радио и радиотехнической разведки'] = {
        'Управление роты РТР и РЭР':1,
        'Взвод радиоразведки':3,
        'Взвод радиотехнической разведки':1,
        'Взвод перевода и обработки информации':1,
        }

metadict_army['Рота радиолокационной разведки'] = {
        'Управление роты радиолокационной разведки':1,
        'Взвод радиолокационной разведки':1,
        'Взвод радиолокационной разведки (аэромобильный)':2,
        }

metadict_army['Рота радиопомех самолётным средствам'] = {
        'Управление роты РЭБ':1,
        'Взвод радиопомех самолётным средствам':3,
        }

metadict_army['Рота дальней радиотехнической разведки'] = {
        'Управление роты РТР':1,
        'Взвод дальней радиотехнической разведки':1,
        'Взвод дальней радиотехнической разведки (аэромобильный)':2,
        }

metadict_army['Рота разведывательных роботов'] = {
        'Управление роты разведывательных БПЛА':1,
        'Взвод разведывательных роботов':3,
        'Отделение обработки данных':1,
        }

metadict_army['Рота связи полковая'] = {
        'Управление роты связи':1,
        'Взвод связи (передовой пункт управления полка)':1,
        'Взвод связи (проводная связь)':1,
        'Взвод связи (радиорелейный)':1,
        'Взвод обеспечения связи':1,
        'Транспортный взвод':1,
        }

metadict_army['Рота пунктов управления дивизии'] = {
        'Взвод связи (передовой пункт управления дивизии)':1,
        'Взвод связи (запасной пункт управления дивизии)':1,
        'Взвод связи (проводная связь)':1,
        'Взвод связи (радиорелейный)':1,
        'Взвод обеспечения связи':1,
        'Транспортный взвод':1,
        }

metadict_army['Батарея управления'] = {
        'Управление батареи связи':1,
        'Взвод связи (передовой пункт управления полка)':1,
        'Взвод связи (проводная связь)':1,
        'Взвод связи (радиорелейный)':1,
        'Взвод обеспечения связи':1,
        'Транспортный взвод':1,
        }

metadict_army['Рота связи (посыльные)'] = {
        'Управление роты посыльных':1,
        'Взвод транспортных планёров':2,
        }

metadict_army['Рота связи (проводная связь)'] = {
        'Управление роты связи':1,
        'Взвод связи (проводная связь)':3,
        }

metadict_army['Рота связи (передовой пункт управления)'] = {
        'Управление роты связи':1,
        'Взвод связи (передовой пункт управления)':2,
        'Отделение спутниковой связи (тыловое)':1,
        }

metadict_army['Рота связи (тыловой пункт управления)'] = {
        'Управление роты связи':1,
        'Взвод связи (тыловой пункт управления)':2,
        'Отделение спутниковой связи (тыловое)':1,
        }

metadict_army['Рота обработки данных'] = {
        'Управление роты связи':1,
        'Взвод обработки данных':2,
        'Взвод сервера АСУ':1,
        }

metadict_army['Рота перевода и обработки информации'] = {
        'Управление роты связи':1,
        'Взвод перевода и обработки информации':3,
        }

metadict_army['Командный пункт авиаполка'] = {
        'Управление роты связи':1,
        'Взвод обработки данных':1,
        'Отделение спутниковой связи (тыловое)':1,
        'Транспортный взвод':1,
        }

metadict_army['Командный пункт РВСН'] = {
        'Управление роты связи':1,
        'Взвод обработки данных':1,
        'Отделение спутниковой связи (тыловое)':1,
        'Транспортный взвод':1,
        }

metadict_army['Рота инструкторов'] = {
        'Управление роты инструкторов':1,
        'Взвод инструкторов (полёты)':1,
        'Взвод инструкторов (стрельбище)':1,
        'Взвод инструкторов (бронетехника)':1,
        'Взвод инструкторов (артиллерия)':1,
        'Взвод инструкторов (симуляторы)':1,
        }

metadict_army['Военная школа младших специалистов РВСН'] = {
        'Управление роты инструкторов':1,
        'Взвод инструкторов (охрана труда)':1,
        'Взвод инструкторов (системы наведения)':1,
        'Взвод инструкторов (оптическая электроника)':1,
        'Взвод инструкторов (баллистические ракеты)':1,
        'Взвод инструкторов (ядерные боеголовки)':1,
        }

metadict_army['Военная школа младших специалистов ПВО'] = {
        'Управление роты инструкторов':1,
        'Взвод инструкторов (охрана труда)':1,
        'Взвод инструкторов (системы наведения)':1,
        'Взвод инструкторов (оптическая электроника)':1,
        'Взвод инструкторов (зенитные ракеты)':1,
        'Взвод инструкторов (ядерные боеголовки)':1,
        }

metadict_army['Рота мобильной АЭС'] = {
        'Управление мобильной АЭС':1,
        'Взвод мобильного энергоблока':2,
        'Взвод зарядки маховиков':2,
        'Взвод военной полиции':1,
        }

#----
# Взводы и отделения:

metadict_army['Транспортный взвод'] = {
        'Командир тылового взвода':1,
        'Заместитель командира тылового взвода':1,
        'Отделение транспортных планёров':1,
        'Автомобильное отделение':1,
        }

metadict_army['Автомобильное отделение'] = {
        'Командир тылового отделения':1,
        'Водитель грузовика':6,
        'Военный грузовик (КУНГ)':6,
        }

metadict_army['Патрульный взвод (аэромобильный)'] = {
        'Командир взвода военной полиции (пегас)':1,
        'Патрульное отделение (аэромобильное)':3,
        }

metadict_army['Патрульное отделение (аэромобильное)'] = {
        'Командир отделения военной полиции (пегас)':1,
        'Оператор станции ближней разведки':1,
        'Патрульный (пегас)':4,
        'Станция ближней разведки':1,
        }

metadict_army['Взвод регулировщиков (аэромобильный)'] = {
        'Командир взвода военной полиции (пегас)':1,
        'Отделение регулировщиков (аэромобильное)':3,
        }

metadict_army['Отделение регулировщиков (аэромобильное)'] = {
        'Командир отделения военной полиции (пегас)':1,
        'Регулировщик (пегас)':7,
        }

metadict_army['Взвод радиолокационной разведки'] = {
        'Командир тылового взвода':1,
        'Заместитель командира тылового взвода':1,
        'Отделение связи (радиосвязь)':1,
        'Отделение обработки данных':1,
        'Отделение РЛС обнаружения':3,
        'Отделение обеспечения связи (передовое)':1,
        }

metadict_army['Взвод радиолокационной разведки (аэромобильный)'] = {
        'Командир тылового взвода (пегас)':1,
        'Заместитель командира тылового взвода':1,
        'Отделение связи (радиосвязь)':1,
        'Отделение обработки данных':1,
        'Отделение РЛС обнаружения (аэромобильное)':3,
        'Отделение обеспечения связи (тыловое)':1,
        'Отделение транспортировки (авиация)':1,
        }

metadict_army['Отделение РЛС обнаружения'] = {
        'Командир отделения РЛС':1,
        'Оператор мобильной РЛС':2,
        'Механик-водитель ОБТ':1,
        'Тяжёлый гусеничный тягач (РЛС обнаружения)':1,
        }

metadict_army['Отделение РЛС обнаружения (аэромобильное)'] = {
        'Командир отделения РЛС':1,
        'Оператор мобильной РЛС':2,
        'Лётчик (пегас)':12,
        'Тяжёлый планёр (РЛС обнаружения)':1,
        }

metadict_army['Взвод управления зенитного дивизиона'] = {
        'Командир взвода РТР':1,
        'Отделение связи зенитного дивизиона':1,
        'Отделение РЛС наведения':1,
        }

metadict_army['Отделение РЛС наведения'] = {
        'Командир отделения РЛС':1,
        'Оператор мобильной РЛС':2,
        'Механик-водитель ОБТ':1,
        'Тяжёлый гусеничный тягач (РЛС наведения)':1,
        }

metadict_army['Отделение РЛС наведения (аэромобильное)'] = {
        'Командир отделения РЛС':1,
        'Оператор мобильной РЛС':2,
        'Лётчик (пегас)':12,
        'Тяжёлый планёр (РЛС наведения)':1,
        }

metadict_army['Отделение связи зенитного дивизиона'] = {
        'Командир отделения связи':1,
        'Связист':2,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Отделение связи зенитной батареи'] = {
        'Командир отделения связи':1,
        'Связист':2,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Взвод разведывательных роботов'] = {
        'Командир взвода разведывательных БПЛА':1,
        'Отделение управления БПЛА':1,
        'Отделение перевозки БПЛА':1,
        'Разведывательный БПЛА':18,
        }

metadict_army['Взвод сторожевых роботов'] = {
        'Командир взвода сторожевых БПЛА':1,
        'Отделение управления БПЛА':1,
        'Отделение перевозки БПЛА':1,
        'Сторожевой робот':18,
        }

metadict_army['Взвод роботов радиоподавления'] = {
        'Командир взвода роботов РЭБ':1,
        'Отделение управления БПЛА':1,
        'Отделение перевозки БПЛА':1,
        'БПЛА радиоподавления':18,
        }

metadict_army['Отделение управления БПЛА'] = {
        'Командир отделения БПЛА':1,
        'Оператор БПЛА':9,
        'Водитель грузовика':1,
        'Военный грузовик (КШМ)':1,
        }

metadict_army['Отделение перевозки БПЛА'] = {
        'Командир тылового отделения':1,
        'Водитель грузовика':2,
        'Военный грузовик (снаряжение)':2,
        }

metadict_army['Взвод штурмовых роботов'] = {
        'Командир взвода боевых роботов':1,
        'Отделение управления БПЛА (передовое)':1,
        'Звено штурмовых роботов':3,
        }

metadict_army['Отделение управления БПЛА (передовое)'] = {
        'Командир отделения БПЛА':1,
        'Оператор БПЛА':9,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Звено штурмовых роботов'] = {
        'Штурмовой робот':3,
        'Сторожевой робот':3,
        }

metadict_army['Отделение сторожевых роботов'] = {
        'Командир отделения БПЛА':1,
        'Оператор БПЛА':3,
        'Водитель грузовика':2,
        'Военный грузовик (КШМ)':1,
        'Военный грузовик (снаряжение)':1,
        'Сторожевой робот':6,
        }

metadict_army['Взвод РХБ наблюдения'] = {
        'Командир взвода РХБ защиты':1,
        'Отделение РХБ очистки':1,
        'Отделение РХБ разведки':1,
        }

metadict_army['Отделение РХБ очистки'] = {
        'Командир отделения РХБ защиты':1,
        'Боец войск РХБ защиты':5,
        'Военный грузовик (авторазливочная станция)':1,
        'Военный грузовик (снаряжение)':1,
        }

metadict_army['Отделение РХБ разведки'] = {
        'Командир отделения РХБ разведки':1,
        'Боец войск РХБ защиты':2,
        'Бронетранспортёр (РХБ разведка)':1,
        }

metadict_army['Взвод РХБ очистки'] = {
        'Командир взвода РХБ защиты':1,
        'Отделение РХБ очистки':3,
        'Отделение дозиметрического контроля':1,
        }

metadict_army['Отделение дозиметрического контроля'] = {
        'Командир отделения РХБ защиты':1,
        'Боец войск РХБ защиты':3,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Взвод РХБ разведки'] = {
        'Командир взвода РХБ разведки':1,
        'Отделение РХБ разведки':3,
        }

metadict_army['Взвод РХБ разведки (аэромобильный)'] = {
        'Командир взвода РХБ разведки (пегас)':1,
        'Отделение РХБ разведки (аэромобильное)':3,
        }

metadict_army['Отделение РХБ разведки (аэромобильное)'] = {
        'Командир отделения РХБ разведки (пегас)':1,
        'Боец войск РХБ защиты (пегас)':5,
        'Лёгкий планёр (перевозка снаряжения)':6,
        }

metadict_army['Взвод звукометрической разведки'] = {
        'Командир взвода звукометрической разведки':1,
        'Отделение звукометрической разведки (аэромобильное)':3,
        'Отделение обработки данных':1,
        }

metadict_army['Отделение звукометрической разведки (аэромобильное)'] = {
        'Командир отделения звукометрической разведки (пегас)':1,
        'Разведчик (пегас)':2,
        'Оператор станции звукометрической разведки':1,
        'Пегасо-переносимая станция звукометрической разведки':1,
        }

metadict_army['Топогеодезический взвод'] = {
        'Командир топогеодезического взвода (пегас)':1,
        'Топогеодезическое отделение (аэромобильное)':3,
        'Отделение обработки данных':1,
        }

metadict_army['Топогеодезическое отделение (аэромобильное)'] = {
        'Командир топогеодезического отделения (пегас)':1,
        'Топогеодезист (пегас)':3,
        }

metadict_army['Метеорологический взвод'] = {
        'Командир метеорологического взвода':1,
        'Метеоролог':4,
        'Водитель грузовика':2,
        'Военный грузовик (радиопеленгационный метеорологический комплекс)':1,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Взвод зарядки маховиков'] = {
        'Командир тылового взвода':1,
        'Отделение зарядки маховиков':3,
        }

metadict_army['Отделение зарядки маховиков'] = {
        'Командир тылового отделения':1,
        'Водитель грузовика':3,
        'Тяжёлый седельный тягач (станция зарядки маховиков)':3,
        }

metadict_army['Взвод землеройных машин'] = {
        'Командир инженерного взвода':1,
        'Отделение землеройных машин':2,
        }

metadict_army['Взвод оборудования позиций'] = {
        'Командир инженерного взвода':1,
        'Отделение оборудования позиций':2,
        }

metadict_army['Взвод инженерной разведки'] = {
        'Командир взвода инженерной разведки':1,
        'Отделение инженерной разведки':1,
        'Водолазное отделение':1,
        }

metadict_army['Отделение инженерной разведки'] = {
        'Командир отделения инженерной разведки':1,
        'Механик-водитель БТР':1,
        'Инженер-разведчик':2,
        'Бронетранспортёр (ИРМ)':1,
        }

metadict_army['Водолазное отделение'] = {
        'Командир водолазного отделения':1,
        'Водолаз-разведчик (единорог)':3,
        'Оператор инженерной машины':1,
        'Водитель грузовика':1,
        'Плавающий гусеничный транспортёр':1,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Взвод инструкторов (артиллерия)'] = {
        'Командир тылового взвода':1,
        'Инструктор артиллеристов':11,
        }

metadict_army['Взвод инструкторов (бронетехника)'] = {
        'Командир тылового взвода':1,
        'Инструктор экипажей бронемашин':11,
        }

metadict_army['Взвод инструкторов (полёты)'] = {
        'Командир тылового взвода (пегас)':1,
        'Инструктор по боевой подготовке (пегас)':11,
        }

metadict_army['Взвод инструкторов (симуляторы)'] = {
        'Командир тылового взвода':1,
        'Инструктор по боевой подготовке (единорог)':11,
        }

metadict_army['Взвод инструкторов (стрельбище)'] = {
        'Командир тылового взвода':1,
        'Инструктор по вооружению':11,
        }

metadict_army['Взвод инструкторов (охрана труда)'] = {
        'Командир тылового взвода':1,
        'Инструктор по боевой подготовке':11,
        }

metadict_army['Взвод инструкторов (системы наведения)'] = {
        'Командир тылового взвода':1,
        'Инструктор артиллеристов':11,
        }

metadict_army['Взвод инструкторов (оптическая электроника)'] = {
        'Командир тылового взвода':1,
        'Инструктор артиллеристов':11,
        }

metadict_army['Взвод инструкторов (баллистические ракеты)'] = {
        'Командир тылового взвода':1,
        'Инструктор ракетчиков':11,
        }

metadict_army['Взвод инструкторов (зенитные ракеты)'] = {
        'Командир тылового взвода':1,
        'Инструктор ракетчиков':11,
        }

metadict_army['Взвод инструкторов (ядерные боеголовки)'] = {
        'Командир тылового взвода':1,
        'Инструктор ракетчиков':11,
        }

metadict_army['Взвод механизированных мостов'] = {
        'Командир взвода механизированных мостов':1,
        'Отделение механизированных мостов':2,
        }

metadict_army['Отделение механизированных мостов'] = {
        'Командир отделения механизированных мостов':1,
        'Оператор инженерной машины':2,
        'Инженер-строитель (пегас)':4,
        'Военный грузовик (тяжёлый механизированный мост)':2,
        }

metadict_army['Взвод строительства мостов'] = {
        'Командир инженерного взвода':1,
        'Отделение строительства мостов':2,
        }

metadict_army['Отделение строительства мостов'] = {
        'Командир инженерного отделения':1,
        'Оператор инженерной машины':1,
        'Водитель грузовика':1,
        'Инженер-строитель (пегас)':2,
        'Военный грузовик (установка строительства мостов)':1,
        'Военный грузовик (снаряжение)':1,
        }

metadict_army['Понтонно-мостовой взвод'] = {
        'Командир понтонно-мостового взвода':1,
        'Заместитель командира тылового взвода':1,
        'Водитель грузовика':25,
        'Понтонист (пегас)':24,
        'Военный грузовик (звено понтонно-мостового парка)':18,
        'Военный грузовик (буксировщик техники)':6,
        'Военный грузовик (снаряжение)':1,
        'Буксируемый катер':6,
        }

metadict_army['Взвод управляемого минирования'] = {
        'Командир инженерного взвода':1,
        'Сапёр-специалист':3,
        'Сапёр (единорог)':11,
        'Оператор инженерной машины':1,
        'Водитель грузовика':2,
        'Военный грузовик (бурильная машина)':1,
        'Военный грузовик (взрывчатка и мины)':2,
        }

metadict_army['Взвод обслуживания'] = {
        'Командир тылового взвода':1,
        'Заместитель командира тылового взвода':1,
        'Отделение обслуживания (автомобильные кухни)':1,
        'Отделение обслуживания (душ и дезинфекция)':1,
        'Отделение обслуживания (прачечные)':1,
        'Отделение обслуживания (бани)':1,
        }

metadict_army['Взвод обслуживания (хлебозавод)'] = {
        'Командир тылового взвода':1,
        'Заместитель командира тылового взвода':1,
        'Отделение обслуживания (хлебозавод)':3,
        }

metadict_army['Отделение обслуживания (хлебозавод)'] = {
        'Командир тылового отделения':1,
        'Пекарь':8,
        'Водитель грузовика':3,
        'Военный грузовик (КУНГ)':1,
        'Военный грузовик (продовольствие)':1,
        'Военный грузовик (полевой хлебозавод)':1,
        }

metadict_army['Взвод обслуживания (автомобильные кухни)'] = {
        'Командир тылового взвода':1,
        'Заместитель командира тылового взвода':1,
        'Отделение обслуживания (автомобильные кухни)':3,
        }

metadict_army['Отделение обслуживания (автомобильные кухни)'] = {
        'Командир тылового отделения':1,
        'Повар':3,
        'Водитель грузовика':3,
        'Военный грузовик (полевая кухня)':3,
        }

metadict_army['Взвод обслуживания (прачечные)'] = {
        'Командир тылового взвода':1,
        'Заместитель командира тылового взвода':1,
        'Отделение обслуживания (прачечные)':3,
        }

metadict_army['Отделение обслуживания (прачечные)'] = {
        'Командир тылового отделения':1,
        'Водитель грузовика':5,
        'Обслуживающий персонал':11,
        'Военный грузовик (водная цистерна)':1,
        'Военный грузовик (полевая прачечная)':4,
        }

metadict_army['Взвод обслуживания (бани)'] = {
        'Командир тылового взвода':1,
        'Заместитель командира тылового взвода':1,
        'Отделение обслуживания (бани)':3,
        }

metadict_army['Отделение обслуживания (бани)'] = {
        'Командир тылового отделения':1,
        'Водитель грузовика':3,
        'Обслуживающий персонал':2,
        'Военный грузовик (КУНГ)':1,
        'Военный грузовик (водная цистерна)':1,
        'Военный грузовик (полевая баня)':2,
        }

metadict_army['Отделение обслуживания (кухни)'] = {
        'Командир тылового отделения':1,
        'Повар':3,
        'Прицеп (полевая кухня)':3,
        }

metadict_army['Отделение обслуживания (душ и дезинфекция)'] = {
        'Командир тылового отделения':1,
        'Водитель грузовика':3,
        'Обслуживающий персонал':2,
        'Военный грузовик (КУНГ)':1,
        'Военный грузовик (водная цистерна)':1,
        'Военный грузовик (дезинфекционно-душевой комплекс)':1,
        }

metadict_army['Взвод плавающих транспортёров'] = {
        'Командир инженерного взвода':1,
        'Отделение плавающих транспортёров':1,
        }

metadict_army['Отделение плавающих транспортёров'] = {
        'Командир инженерного отделения':1,
        'Инженер-разведчик':5,
        'Плавающий гусеничный транспортёр':6,
        }

metadict_army['Взвод разграждения'] = {
        'Командир инженерного взвода':1,
        'Отделение разграждения':1,
        'Отделение разминирования':1,
        }

metadict_army['Отделение разграждения'] = {
        'Командир инженерного отделения':1,
        'Оператор инженерной машины':7,
        'Инженерная машина разграждения':3,
        'Колёсный трактор (грейдер)':1,
        }

metadict_army['Взвод радиоразведки'] = {
        'Командир взвода РЭР':1,
        'Отделение радиоперехвата и радиопеленгации КВ-диапазона':1,
        'Отделение радиоперехвата и радиопеленгации УКВ-диапазона':1,
        'Отделение радиоперехвата и радиопеленгации радиорелейных линий связи':1,
        }

metadict_army['Отделение радиоперехвата и радиопеленгации КВ-диапазона'] = {
        'Командир отделения РЭР':1,
        'Оператор-радиотехник':2,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (станция радиоразведки)':1,
        }

metadict_army['Отделение радиоперехвата и радиопеленгации УКВ-диапазона'] = {
        'Командир отделения РЭР':1,
        'Оператор-радиотехник':2,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (станция радиоразведки)':1,
        }

metadict_army['Отделение радиоперехвата и радиопеленгации радиорелейных линий связи'] = {
        'Командир отделения РЭР':1,
        'Оператор-радиотехник':2,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (станция радиоразведки)':1,
        }

metadict_army['Взвод радиоперехвата и радиопеленгации УКВ-диапазона (аэромобильный)'] = {
        'Командир взвода РЭР (пегас)':1,
        'Отделение радиоперехвата и радиопеленгации УКВ-диапазона (аэромобильное)':3,
        }

metadict_army['Отделение радиоперехвата и радиопеленгации УКВ-диапазона (аэромобильное)'] = {
        'Командир отделения РЭР (пегас)':1,
        'Разведчик-радиотехник (пегас)':3,
        'Пегасо-переносимое устройство радиоразведки':1,
        }

metadict_army['Взвод перевода и обработки информации'] = {
        'Командир взвода связи':1,
        'Отделение обработки данных':1,
        'Отделение переводчиков':3,
        }

metadict_army['Отделение переводчиков'] = {
        'Командир отделения связи':1,
        'Переводчик':4,
        'Водитель грузовика':1,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Взвод радиотехнической разведки'] = {
        'Командир взвода РТР':1,
        'Отделение обработки данных':1,
        'Отделение радиотехнической разведки':3,
        }

metadict_army['Отделение радиотехнической разведки'] = {
        'Командир отделения РТР':1,
        'Оператор-радиотехник':3,
        'Бронетранспортёр (станция радиотехнической разведки)':1,
        }

metadict_army['Взвод помех радиовзрывателям'] = {
        'Командир взвода РЭБ':1,
        'Отделение помех радиовзрывателям':3,
        }

metadict_army['Отделение помех радиовзрывателям'] = {
        'Командир отделения РЭБ':1,
        'Оператор-радиотехник':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (радиоподавление)':1,
        }

metadict_army['Взвод радиопомех КВ-диапазона'] = {
        'Командир взвода РЭБ':1,
        'Отделение радиопомех КВ-диапазона':3,
        }

metadict_army['Отделение радиопомех КВ-диапазона'] = {
        'Командир отделения РЭБ':1,
        'Оператор-радиотехник':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (радиоподавление)':1,
        }

metadict_army['Взвод радиопомех УКВ-диапазона'] = {
        'Командир взвода РЭБ':1,
        'Отделение радиопомех УКВ-диапазона':3,
        }

metadict_army['Отделение радиопомех УКВ-диапазона'] = {
        'Командир отделения РЭБ':1,
        'Оператор-радиотехник':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (радиоподавление)':1,
        }

metadict_army['Взвод радиопомех УКВ-диапазона (аэромобильный)'] = {
        'Командир взвода РЭБ (пегас)':1,
        'Отделение радиопомех УКВ-диапазона (аэромобильное)':3,
        }

metadict_army['Отделение радиопомех УКВ-диапазона (аэромобильное)'] = {
        'Командир отделения РЭБ (пегас)':1,
        'Оператор-радиотехник (пегас)':3,
        'Пегасо-переносимое устройство радиоподавления':1,
        }

metadict_army['Взвод связи (передовой пункт управления)'] = {
        'Командир взвода связи':1,
        'Отделение командно-штабной машины':2,
        'Отделение обеспечения связи (передовое)':1,
        }

metadict_army['Отделение командно-штабной машины'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Отделение обеспечения связи (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':3,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КВ-радиостанция)':1,
        }

metadict_army['Взвод связи (передовой пункт управления батальона)'] = {
        'Командир взвода связи':1,
        'Отделение КШМ командира батальона (передовое)':1,
        'Отделение КШМ начальника штаба батальона (передовое)':1,
        'Отделение обеспечения связи (передовое)':1,
        }

metadict_army['Отделение КШМ командира батальона (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Отделение КШМ начальника штаба батальона (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Взвод связи (тыловой пункт управления батальона)'] = {
        'Командир взвода связи':1,
        'Отделение КШМ командира батальона (тыловое)':1,
        'Отделение обеспечения связи (тыловое)':1,
        }

metadict_army['Отделение КШМ командира батальона (тыловое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Водитель грузовика':1,
        'Военный грузовик (КШМ)':1,
        }

metadict_army['Взвод связи (передовой пункт управления полка)'] = {
        'Командир взвода связи':1,
        'Отделение КШМ командира полка (передовое)':1,
        'Отделение КШМ заместителя командира полка (передовое)':1,
        'Отделение КШМ начальника штаба полка (передовое)':1,
        'Отделение КШМ заместителя начальника штаба полка (передовое)':1,
        'Отделение спутниковой связи (передовое)':1,
        }

metadict_army['Отделение КШМ командира полка (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Отделение КШМ заместителя командира полка (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Отделение КШМ начальника штаба полка (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Отделение КШМ заместителя начальника штаба полка (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Отделение спутниковой связи (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':3,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (спутниковая связь)':1,
        }

metadict_army['Взвод связи (передовой пункт управления дивизии)'] = {
        'Командир взвода связи':1,
        'Отделение КШМ командира дивизии (передовое)':1,
        'Отделение КШМ заместителя командира дивизии (передовое)':1,
        'Отделение КШМ начальника штаба дивизии (передовое)':1,
        'Отделение КШМ заместителя начальника штаба дивизии (передовое)':1,
        'Отделение спутниковой связи (передовое)':1,
        }

metadict_army['Взвод связи (запасной пункт управления дивизии)'] = {
        'Командир взвода связи':1,
        'Отделение КШМ командира дивизии (передовое)':1,
        'Отделение КШМ заместителя командира дивизии (передовое)':1,
        'Отделение КШМ начальника штаба дивизии (передовое)':1,
        'Отделение КШМ заместителя начальника штаба дивизии (передовое)':1,
        'Отделение спутниковой связи (передовое)':1,
        }

metadict_army['Отделение КШМ командира дивизии (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Отделение КШМ заместителя командира дивизии (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Отделение КШМ начальника штаба дивизии (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Отделение КШМ заместителя начальника штаба дивизии (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Взвод управления артиллерией'] = {
        'Командир взвода связи':1,
        'Артиллерийский командный пункт':1,
        'Отделение управления огнём артиллерии':1,
        'Отделение артиллерийской разведки (аэромобильное)':1,
        'Отделение обеспечения связи (передовое)':1,
        }

metadict_army['Взвод обеспечения связи'] = {
        'Командир тылового взвода':1,
        'Аккумуляторное отделение':1,
        'Ремонтное отделение (радиоэлектроника)':1,
        'Отделение обеспечения связи (тыловое)':1,
        }

metadict_army['Аккумуляторное отделение'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Водитель грузовика':1,
        'Военный грузовик (снаряжение)':1,
        }

metadict_army['Отделение обеспечения связи (передовое)'] = {
        'Командир отделения связи':1,
        'Связист':3,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КВ-радиостанция)':1,
        }

metadict_army['Отделение обеспечения связи (тыловое)'] = {
        'Командир отделения связи':1,
        'Связист':2,
        'Водитель грузовика':2,
        'Военный грузовик (КВ-радиостанция)':1,
        'Военный грузовик (снаряжение)':1,
        }

metadict_army['Взвод связи (аэромобильный)'] = {
        'Командир взвода связи (пегас)':1,
        'Отделение связи (аэромобильное)':3,
        }

metadict_army['Отделение связи (аэромобильное)'] = {
        'Командир отделения связи (пегас)':1,
        'Связист (пегас)':3,
        'КВ-радиостанция переносная':1,
        'Лёгкий планёр (перевозка снаряжения)':4,
        }

metadict_army['Взвод связи (радиорелейный)'] = {
        'Командир взвода связи (пегас)':1,
        'Отделение радиорелейных станций (аэромобильное)':2,
        'Отделение связи (ретрансляторы)':1,
        }

metadict_army['Отделение радиорелейных станций (аэромобильное)'] = {
        'Командир отделения связи (пегас)':1,
        'Связист (пегас)':3,
        'Пегасо-переносимая радиорелейная станция':1,
        'Лёгкий планёр (перевозка снаряжения)':4,
        }

metadict_army['Отделение связи (ретрансляторы)'] = {
        'Командир отделения связи':1,
        'Связист':2,
        'Водитель грузовика':2,
        'Военный грузовик (снаряжение)':1,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Взвод связи (проводная связь)'] = {
        'Командир взвода связи':1,
        'Отделение связи (проводная связь)':3,
        }

metadict_army['Взвод связи (тыловой пункт управления)'] = {
        'Командир взвода связи':1,
        'Отделение связи (радиосвязь)':1,
        'Отделение связи (проводная связь)':1,
        'Отделение связи (ретрансляторы)':1,
        }

metadict_army['Отделение связи (радиосвязь)'] = {
        'Командир отделения связи':1,
        'Связист':2,
        'Водитель грузовика':1,
        'Военный грузовик (КВ-радиостанция)':1,
        }

metadict_army['Отделение связи (ретрансляторы)'] = {
        'Командир отделения связи':1,
        'Связист':2,
        'Водитель грузовика':1,
        'Военный грузовик (снаряжение)':1,
        }

metadict_army['Отделение спутниковой связи (тыловое)'] = {
        'Командир отделения связи':1,
        'Связист':3,
        'Водитель грузовика':1,
        'Военный грузовик (спутниковая связь)':1,
        }

metadict_army['Взвод дальней радиотехнической разведки'] = {
        # https://topwar.ru/46880-kompleks-radiotehnicheskoy-razvedki-85v6-a-vega.html
        'Командир взвода РТР':1,
        'Отделение обработки данных':1,
        'Отделение связи (радиосвязь)':1,
        'Отделение станции РТР':3,
        }

metadict_army['Взвод дальней радиотехнической разведки (аэромобильный)'] = {
        'Командир взвода РТР':1,
        'Отделение обработки данных':1,
        'Отделение связи (радиосвязь)':1,
        'Отделение станции РТР (аэромобильное)':3,
        'Отделение транспортировки (авиация)':1,
        }

metadict_army['Пожарный взвод'] = {
        'Командир инженерного взвода':1,
        'Пожарное отделение':3,
        }

metadict_army['Пожарное отделение'] = {
        'Командир инженерного отделения':1,
        'Пожарный':6,
        'Военный грузовик (авторазливочная станция)':1,
        'Военный грузовик (пожарная машина)':1,
        }

metadict_army['Диспечерская пожарной роты'] = {
        'Командир тылового взвода':1,
        'Отделение связи (проводная связь)':1,
        'Отделение обработки данных':1,
        }

metadict_army['Отделение связи (проводная связь)'] = {
        'Командир отделения связи':1,
        'Связист':3,
        'Водитель грузовика':2,
        'Военный грузовик (снаряжение)':1,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Взвод обработки данных'] = {
        'Командир взвода связи':1,
        'Отделение обработки данных':3,
        }

metadict_army['Отделение обработки данных'] = {
        'Командир отделения связи':1,
        'Оператор ЭВМ':3,
        'Водитель грузовика':1,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Взвод сервера АСУ'] = {
        'Командир взвода связи':1,
        'Отделение сервера АСУ':1,
        'Отделение резервного сервера АСУ':1,
        'Отделение спутниковой связи (тыловое)':1,
        'Отделение обеспечения связи (тыловое)':1,
        }

metadict_army['Отделение сервера АСУ'] = {
        'Командир отделения связи':1,
        'Оператор ЭВМ':3,
        'Водитель грузовика':1,
        'Военный грузовик (сервер АСУ)':1,
        }

metadict_army['Отделение резервного сервера АСУ'] = {
        'Командир отделения связи':1,
        'Оператор ЭВМ':3,
        'Водитель грузовика':1,
        'Военный грузовик (сервер АСУ)':1,
        }

metadict_army['Отделение станции РТР'] = {
        'Командир отделения РТР':1,
        'Связист':5,
        'Водитель грузовика':3,
        'Военный грузовик (КШМ)':1,
        'Военный грузовик (станция РТР)':1,
        'Военный грузовик (снаряжение)':1,
        }

metadict_army['Отделение станции РТР (аэромобильное)'] = {
        'Командир отделения РТР':1,
        'Связист':3,
        'Лётчик (пегас)':12,
        'Тяжёлый планёр (станция РТР)':1,
        }

metadict_army['Взвод радиопомех самолётным средствам'] = {
        'Командир взвода РЭБ':1,
        'Отделение радиопомех самолётным средствам':3,
        }

metadict_army['Отделение радиопомех самолётным средствам'] = {
        'Командир отделения РЭБ':1,
        'Связист':3,
        'Водитель грузовика':2,
        'Военный грузовик (КУНГ)':1,
        'Военный грузовик (станция помех наведению)':1,
        }

metadict_army['Взвод технических средств разведки'] = {
        'Командир тылового взвода':1,
        'Отделение сторожевых роботов':1,
        'Отделение разведывательно-сигнальных средств':1,
        }

metadict_army['Отделение разведывательно-сигнальных средств'] = {
        'Командир тылового отделения':1,
        'Связист':3,
        'Водитель грузовика':2,
        'Военный грузовик (КУНГ)':1,
        'Военный грузовик (снаряжение)':1,
        }

metadict_army['Взвод тылового обеспечения'] = {
        'Командир тылового взвода':1,
        'Отделение снабжения (топливо)':1,
        'Отделение снабжения (боеприпасы)':1,
        'Отделение снабжения (продовольствие и снаряжение)':1,
        'Отделение обслуживания (кухни)':1,
        'Отделение обслуживания (душ и дезинфекция)':1,
        'Ремонтное отделение (автомобили)':1,
        }

metadict_army['Взвод снабжения (маховики)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения (маховики)':3,
        }

metadict_army['Отделение снабжения (маховики)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (маховики)':6,
        }

metadict_army['Взвод снабжения (продовольствие и снаряжение)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения (снаряжение)':2,
        'Отделение снабжения (продовольствие)':1,
        }

metadict_army['Взвод снабжения (продовольствие)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения (продовольствие)':2,
        'Отделение снабжения (вода)':1,
        }

metadict_army['Отделение снабжения (продовольствие)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (продовольствие)':6,
        }

metadict_army['Отделение снабжения (продовольствие и снаряжение)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (снаряжение)':4,
        'Военный грузовик (продовольствие)':2,
        }

metadict_army['Отделение снабжения (вода)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (водная цистерна)':6,
        }

metadict_army['Взвод снабжения (боеприпасы)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения (боеприпасы)':3,
        }

metadict_army['Отделение снабжения (боеприпасы)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (боеприпасы)':6,
        }

metadict_army['Взвод снабжения (зенитные ракеты)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения (зенитные ракеты)':3,
        }

metadict_army['Отделение снабжения (зенитные ракеты)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (зенитные ракеты)':6,
        }

metadict_army['Взвод снабжения (снаряжение)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения (снаряжение)':3,
        }

metadict_army['Отделение снабжения (снаряжение)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (снаряжение)':6,
        }

metadict_army['Взвод снабжения (топливо и боеприпасы)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения (жидкое топливо)':1,
        'Отделение снабжения (твёрдое топливо)':1,
        'Отделение снабжения (боеприпасы)':1,
        }

metadict_army['Взвод снабжения (топливо)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения (жидкое топливо)':2,
        'Отделение снабжения (твёрдое топливо)':1,
        }

metadict_army['Взвод снабжения (жидкое топливо)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения (жидкое топливо)':3,
        }

metadict_army['Отделение снабжения (жидкое топливо)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (топливная цистерна)':6,
        }

metadict_army['Отделение снабжения (твёрдое топливо)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (твёрдое топливо)':6,
        }

metadict_army['Отделение снабжения (топливо)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (топливная цистерна)':4,
        'Военный грузовик (твёрдое топливо)':2,
        }

metadict_army['Взвод снабжения с прицепами (маховики)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения с прицепами (маховики)':3,
        }

metadict_army['Отделение снабжения с прицепами (маховики)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (маховики)':6,
        'Прицеп (маховики)':6,
        }

metadict_army['Взвод снабжения с прицепами (продовольствие)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения с прицепами (продовольствие)':2,
        'Отделение снабжения с прицепами (вода)':1,
        }

metadict_army['Отделение снабжения с прицепами (продовольствие)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (продовольствие)':6,
        'Прицеп (продовольствие)':6,
        }

metadict_army['Отделение снабжения с прицепами (вода)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (водная цистерна)':6,
        'Прицеп (водная цистерна)':6,
        }

metadict_army['Взвод снабжения с прицепами (боеприпасы)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения с прицепами (боеприпасы)':3,
        }

metadict_army['Отделение снабжения с прицепами (боеприпасы)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (боеприпасы)':6,
        'Прицеп (боеприпасы)':6,
        }

metadict_army['Взвод снабжения с прицепами (зенитные ракеты)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения с прицепами (зенитные ракеты)':3,
        }

metadict_army['Отделение снабжения с прицепами (зенитные ракеты)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (зенитные ракеты)':6,
        'Прицеп (зенитные ракеты)':6,
        }

metadict_army['Взвод снабжения с прицепами (снаряжение)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения с прицепами (снаряжение)':3,
        }

metadict_army['Отделение снабжения с прицепами (снаряжение)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (снаряжение)':6,
        'Прицеп (снаряжение)':6,
        }

metadict_army['Взвод снабжения с прицепами (топливо)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения с прицепами (топливо)':3,
        }

metadict_army['Отделение снабжения с прицепами (топливо)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (топливная цистерна)':4,
        'Военный грузовик (твёрдое топливо)':2,
        'Прицеп (топливная цистерна)':4,
        'Прицеп (твёрдое топливо)':2,
        }

metadict_army['Взвод снабжения с прицепами (жидкое топливо)'] = {
        'Командир взвода снабжения':1,
        'Отделение снабжения с прицепами (жидкое топливо)':3,
        }

metadict_army['Отделение снабжения с прицепами (жидкое топливо)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (топливная цистерна)':6,
        'Прицеп (топливная цистерна)':6,
        }

metadict_army['Взвод транспортировки (авиация)'] = {
        'Командир взвода снабжения':1,
        'Отделение транспортировки (авиация)':2,
        }

metadict_army['Отделение транспортировки (авиация)'] = {
        'Командир отделения снабжения':1,
        'Водитель грузовика':5,
        'Военный грузовик (перевозчик авиации)':6,
        }

metadict_army['Взвод транспортировки (стратегические ракеты)'] = {
        'Командир тылового взвода':1,
        'Оператор инженерной машины':6,
        'Тяжёлый седельный тягач':3,
        }

metadict_army['Взвод мобильного энергоблока'] = {
        'Командир взвода мобильного энергоблока':1,
        'Оператор мобильной АЭС':3,
        'Водитель грузовика':2,
        'Военный грузовик (КШМ)':1,
        'Тяжёлый седельный тягач (мобильная АЭС)':1,
        }

metadict_army['Взвод эвакуации тяжёлой техники'] = {
        'Командир ремонтного взвода':1,
        'Экипаж ремонтно-эвакуационной машины':5,
        'Оператор инженерной машины':1,
        'Тяжёлый седельный тягач':1,
        }

metadict_army['Взвод эвакуации авиатехники'] = {
        'Командир ремонтного взвода':1,
        'Экипаж ремонтно-эвакуационной машины':2,
        'Оператор инженерной машины':1,
        'Тяжёлый седельный тягач':1,
        }

metadict_army['Экипаж ремонтно-эвакуационной машины'] = {
        'Командир ремонтно-эвакуационной машины':1,
        'Механик-водитель ОБТ':1,
        'Сцепщик-такелажник':1,
        'Бронированная ремонтно-эвакуационная машина':1,
        }

metadict_army['Десантно-штурмовой взвод'] = {
        'Командир десантно-штурмового взвода':1,
        'Группа боевых машин десанта':1,
        'Отделение лёгкой пехоты':3,
        }

metadict_army['Группа боевых машин десанта'] = {
        'Заместитель командира передового взвода':1,
        'Экипаж БМД':3,
        }

metadict_army['Мотострелковый взвод'] = {
        'Командир мотострелкового взвода':1,
        'Группа боевых машин пехоты':1,
        'Отделение лёгкой пехоты':3,
        }

metadict_army['Группа боевых машин пехоты'] = {
        'Заместитель командира передового взвода':1,
        'Экипаж БМП':3,
        }

metadict_army['Механизированный взвод'] = {
        'Командир механизированного взвода':1,
        'Группа бронетранспортёров':1,
        'Отделение лёгкой пехоты':3,
        }

metadict_army['Группа бронетранспортёров'] = {
        'Заместитель командира передового взвода':1,
        'Экипаж БТР':3,
        }

metadict_army['Отделение транспортных автомобилей'] = {
        'Заместитель командира передового взвода':1,
        'Водитель грузовика':3,
        'Военный грузовик (КУНГ)':3,
        }

metadict_army['Пегасо-десантный взвод'] = {
        'Командир пегасо-десантного взвода':1,
        'Заместитель командира передового взвода':1,
        'Отделение лёгкой пехоты':3,
        }

metadict_army['Отделение лёгкой пехоты'] = {
        'Командир отделения лёгкой пехоты':1,
        'Огневая команда':1,
        'Маневровая команда':1,
        }

metadict_army['Огневая команда'] = {
        'Боец (гранатомётчик)':1,
        'Боец (помощник гранатомётчика)':1,
        'Боец (пулемётчик)':1,
        'Боец (помощник пулемётчика)':1,
        }

metadict_army['Маневровая команда'] = {
        'Боец (старший стрелок)':1,
        'Боец (гренадер)':2,
        }

metadict_army['Танковый взвод'] = {
        'Командир танкового взвода':1,
        'Экипаж первого танка взвода':1,
        'Экипаж основного боевого танка':2,
        }

metadict_army['Экипаж основного боевого танка'] = {
        'Командир ОБТ':1,
        'Наводчик-оператор ОБТ':1,
        'Механик-водитель ОБТ':1,
        'Основной боевой танк':1,
        'Сторожевой робот':1,
        }

metadict_army['Экипаж первого танка взвода'] = {
        'Наводчик-оператор ОБТ':1,
        'Механик-водитель ОБТ':1,
        'Основной боевой танк':1,
        'Сторожевой робот':1,
        }

metadict_army['Экипаж командирского танка'] = {
        'Наводчик-оператор ОБТ':1,
        'Механик-водитель ОБТ':1,
        'Основной боевой танк (КШМ)':1,
        'Сторожевой робот':1,
        }

metadict_army['Экипаж БМД'] = {
        'Командир БМД':1,
        'Наводчик-оператор БМД':1,
        'Механик-водитель БМД':1,
        'Боевая машина десанта':1,
        }

metadict_army['Экипаж командирского БМД'] = {
        'Наводчик-оператор БМД':1,
        'Механик-водитель БМД':1,
        'Боевая машина десанта (КШМ)':1,
        'Сторожевой робот':1,
        }

metadict_army['Экипаж БМП'] = {
        'Командир БМП':1,
        'Наводчик-оператор БМП':1,
        'Механик-водитель БМП':1,
        'Боевая машина пехоты':1,
        }

metadict_army['Экипаж командирского БМП'] = {
        'Наводчик-оператор БМП':1,
        'Механик-водитель БМП':1,
        'Боевая машина пехоты (КШМ)':1,
        'Сторожевой робот':1,
        }

metadict_army['Экипаж БТР'] = {
        'Наводчик-оператор БТР':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр':1,
        }

metadict_army['Экипаж командирского БТР'] = {
        'Наводчик-оператор БТР':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр':1,
        'Сторожевой робот':1,
        }

metadict_army['Пара истребителей-бомбардировщиков'] = {
        'Экипаж ведущего истребителя-бомбардировщика':1,
        'Экипаж ведомого истребителя-бомбардировщика':1,
        }

metadict_army['Экипаж ведущего истребителя-бомбардировщика'] = {
        'Пилот ведущего истребителя-бомбардировщика (пегас)':1,
        'Второй пилот (пегас)':1,
        'Истребитель-бомбардировщик':1,
        }

metadict_army['Экипаж ведомого истребителя-бомбардировщика'] = {
        'Пилот ведомого истребителя-бомбардировщика (пегас)':1,
        'Второй пилот (пегас)':1,
        'Истребитель-бомбардировщик':1,
        }

metadict_army['Экипаж транспортного экранолёта'] = {
        'Командир транспортного экранолёта (пегас)':1,
        'Второй пилот (пегас)':2,
        'Оператор мобильной АЭС':3,
        'Старший механик (авиатехника)':3,
        'Транспортный экранолёт':1,
        }

metadict_army['Взвод боевых планёров (реактивные снаряды)'] = {
        'Командир взвода ракетных планёров (пегас)':1,
        'Отделение боевых планёров (реактивные снаряды)':3,
        }

metadict_army['Отделение боевых планёров (реактивные снаряды)'] = {
        'Командир отделения ракетных планёров (пегас)':1,
        'Лётчик (пегас)':11,
        'Боевой планёр (реактивные снаряды)':12,
        }

metadict_army['Взвод боевых планёров (управляемые ракеты)'] = {
        'Командир взвода противотанковых планёров (пегас)':1,
        'Отделение боевых планёров (управляемые ракеты)':3,
        }

metadict_army['Отделение боевых планёров (управляемые ракеты)'] = {
        'Командир отделения противотанковых планёров (пегас)':1,
        'Лётчик (пегас)':11,
        'Боевой планёр (управляемые ракеты)':12,
        }

metadict_army['Взвод боевых планёров (зенитные ракеты)'] = {
        'Командир взвода противовоздушных планёров (пегас)':1,
        'Отделение боевых планёров (зенитные ракеты)':3,
        }

metadict_army['Отделение боевых планёров (зенитные ракеты)'] = {
        'Командир отделения противовоздушных планёров (пегас)':1,
        'Лётчик (пегас)':11,
        'Боевой планёр (зенитные ракеты)':12,
        }

metadict_army['Взвод боевых планёров (авиабомбы)'] = {
        'Командир взвода планёров-бомбардировщиков (пегас)':1,
        'Отделение боевых планёров (авиабомбы)':3,
        }

metadict_army['Отделение боевых планёров (авиабомбы)'] = {
        'Командир отделения планёров-бомбардировщиков (пегас)':1,
        'Лётчик (пегас)':11,
        'Боевой планёр (авиабомбы)':12,
        }

metadict_army['Взвод транспортных планёров'] = {
        'Командир взвода транспортных планёров (пегас)':1,
        'Отделение транспортных планёров':3,
        }

metadict_army['Отделение транспортных планёров'] = {
        'Командир отделения транспортных планёров (пегас)':1,
        'Снабженец (пегас)':11,
        'Лёгкий планёр (перевозка боеприпасов)':12,
        }

metadict_army['Взвод ЗРК ближнего действия'] = {
        'Расчёт ЗРК ближнего действия':2,
        }

metadict_army['Расчёт ЗРК ближнего действия'] = {
        'Командир ЗРК ближнего действия':1,
        'Оператор ЗРК':2,
        'Водитель ЗРК':1,
        'Заряжающий (пегас)':1,
        'Зенитный ракетный комплекс ближнего действия':1,
        }

metadict_army['Расчёт ЗРК малой дальности'] = {
        'Командир ЗРК малой дальности':1,
        'Оператор ЗРК':2,
        'Водитель ЗРК':1,
        'Зенитный ракетный комплекс малой дальности':1,
        }

metadict_army['Расчёт ЗРК средней дальности'] = {
        'Командир ЗРК средней дальности':1,
        'Оператор ЗРК':2,
        'Водитель ЗРК':1,
        'Зенитный ракетный комплекс средней дальности':1,
        }

metadict_army['Расчёт ЗРК большой дальности'] = {
        'Командир расчёта ЗРК большой дальности':1,
        'Водитель грузовика':4,
        'Прицеп (пусковая установка ЗРК большой дальности)':1,
        'Военный грузовик (перевозчик пусковой установки ЗРК)':1,
        'Военный грузовик (перевозчик зенитных ракет большой дальности)':2,
        'Заряжающая машина ЗРК большой дальности':2,
        'Военный грузовик (снаряжение)':1,
        }

metadict_army['Сапёрный взвод'] = {
        'Командир сапёрного взвода':1,
        'Сапёрное отделение':3,
        'Отделение разминирования':1,
        }

metadict_army['Сапёрное отделение'] = {
        'Командир отделения сапёров':1,
        'Сапёр-специалист':1,
        'Сапёр (единорог)':3,
        'Водитель грузовика':1,
        'Военный грузовик (взрывчатка и мины)':1,
        }

metadict_army['Отделение разминирования'] = {
        'Командир отделения сапёров':1,
        'Сапёр-специалист':2,
        'Сапёр (единорог)':3,
        'Водитель грузовика':3,
        'Установка разминирования':3,
        'Военный грузовик (взрывчатка и мины)':3,
        }

metadict_army['Сапёрный взвод (аэромобильный)'] = {
        'Командир сапёрного взвода':1,
        'Сапёрное отделение (аэромобильное)':3,
        }

metadict_army['Сапёрное отделение (аэромобильное)'] = {
        'Командир отделения сапёров (пегас)':1,
        'Сапёр-специалист':2,
        'Сапёр (единорог)':3,
        'Извозчик (пегас)':6,
        'Лёгкий планёр (перевозка снаряжения)':6,
        }

metadict_army['Взвод полевого водоснабжения'] = {
        'Командир инженерного взвода':1,
        'Отделение полевого водоснабжения':3,
        }

metadict_army['Отделение полевого водоснабжения'] = {
        'Командир инженерного отделения':1,
        'Сапёр-специалист':2,
        'Сапёр (единорог)':4,
        'Водитель грузовика':2,
        'Военный грузовик (автомобильная фильтровальная станция)':2,
        }

metadict_army['Инженерно-технический взвод'] = {
        'Командир инженерного взвода':1,
        'Отделение полевого водоснабжения':1,
        'Отделение землеройных машин':1,
        'Отделение оборудования позиций':1,
        'Инженерно-строительное отделение':1,
        }

metadict_army['Инженерно-строительное отделение'] = {
        'Командир инженерного отделения':1,
        'Оператор инженерной машины':2,
        'Инженер-строитель (пегас)':3,
        'Водитель грузовика':2,
        'Военный грузовик (автокран)':1,
        'Прицеп (лесопильная рама)':1,
        'Военный грузовик (строительные материалы)':2,
        }

metadict_army['Отделение землеройных машин'] = {
        'Командир инженерного отделения':1,
        'Оператор инженерной машины':7,
        'Водитель грузовика':3,
        'Машина для отрывки котлована':1,
        'Быстроходная траншейная машина':2,
        'Военный грузовик (самосвал)':1,
        'Военный грузовик (экскаватор)':1,
        'Военный грузовик (автокран)':1,
        }

metadict_army['Отделение оборудования позиций'] = {
        'Командир инженерного отделения':1,
        'Оператор инженерной машины':2,
        'Инженер-строитель (пегас)':2,
        'Водитель грузовика':2,
        'Инженерная машина разграждения':1,
        'Военный грузовик (автокран)':1,
        'Военный грузовик (строительные материалы)':2,
        'Комплект КФУ':4,
        }

metadict_army['Инженерно-строительный взвод'] = {
        'Командир инженерного взвода':1,
        'Инженерно-строительное отделение':2,
        }

metadict_army['Медицинский взвод'] = {
        'Командир медицинского взвода':1,
        'Врач (единорог)':4,
        'Санитар (единорог)':14,
        'Водитель-санитар':5,
        'Военный грузовик (КУНГ)':3,
        'Военный грузовик (снаряжение)':2,
        }

metadict_army['Санитарно-эпидемиологическая лаборатория'] = {
        'Командир медицинского взвода':1,
        'Врач (единорог)':4,
        'Санитар (единорог)':3,
        'Водитель-санитар':3,
        'Военный грузовик (КУНГ)':1,
        'Военный грузовик (водная цистерна)':1,
        'Военный грузовик (дезинфекционно-душевой комплекс)':1,
        }

metadict_army['Приёмно-сортировочный взвод'] = {
        'Командир медицинского взвода':1,
        'Врач (единорог)':4,
        'Санитар (единорог)':10,
        'Водитель-санитар':2,
        'Военный грузовик (КУНГ)':1,
        'Военный грузовик (снаряжение)':1,
        }

metadict_army['Операционно-перевязочный взвод'] = {
        'Командир медицинского взвода':1,
        'Врач (единорог)':5,
        'Санитар (единорог)':13,
        'Водитель-санитар':4,
        'Военный грузовик (КУНГ)':2,
        'Военный грузовик (снаряжение)':2,
        }

metadict_army['Госпитальный взвод'] = {
        'Командир медицинского взвода':1,
        'Санитар (единорог)':13,
        'Водитель-санитар':3,
        'Военный грузовик (КУНГ)':2,
        'Военный грузовик (снаряжение)':1,
        }

metadict_army['Отделение анестезиологии и реанимации'] = {
        'Врач (единорог)':2,
        'Санитар (единорог)':6,
        'Водитель-санитар':3,
        'Военный грузовик (КУНГ)':1,
        'Военный грузовик (снаряжение)':2,
        }

metadict_army['Стоматологический кабинет'] = {
        'Врач (единорог)':1,
        'Водитель-санитар':1,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Рентгенологический кабинет'] = {
        'Врач (единорог)':1,
        'Водитель-санитар':1,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Клиническая лаборатория'] = {
        'Врач (единорог)':1,
        'Водитель-санитар':1,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Отделение медицинского снабжения'] = {
        'Врач (единорог)':1,
        'Водитель-санитар':3,
        'Военный грузовик (КУНГ)':1,
        'Военный грузовик (снаряжение)':2,
        }

metadict_army['Огневой взвод станковых 80-мм миномётов (аэромобильный)'] = {
        'Командир миномётного взвода (пегас)':1,
        'Расчёт станкового 80-мм миномёта (аэромобильный)':3,
        }

metadict_army['Расчёт станкового 80-мм миномёта (аэромобильный)'] = {
        'Командир расчёта 120-мм миномёта (пегас)':1,
        'Артиллерист (пегас)':5,
        'Станковый 80-мм миномёт':1,
        'Лёгкий планёр (перевозка оружия)':1,
        'Лёгкий планёр (перевозка боеприпасов)':5,
        }

metadict_army['Огневой взвод автоматических 80-мм миномётов'] = {
        'Командир миномётного взвода (бронетехника)':1,
        'Расчёт автоматического 80-мм миномёта':3,
        }

metadict_army['Расчёт автоматического 80-мм миномёта'] = {
        'Командир расчёта 120-мм миномёта':1,
        'Артиллерист':1,
        'Механик-водитель БТР':1,
        'Наводчик-оператор БТР':1,
        'Бронетранспортёр (автоматический 80-мм миномёт)':1,
        }

metadict_army['Огневой взвод 210-мм РСЗО'] = {
        'Командир огневого взвода 210-мм РСЗО':1,
        'Отделение управления огнём взвода РСЗО':1,
        'Расчёт 210-мм РСЗО':2,
        }

metadict_army['Отделение управления огнём взвода РСЗО'] = {
        'Командир отделения связи':1,
        'Связист':2,
        'Водитель грузовика':1,
        'Военный грузовик (КШМ)':1,
        }

metadict_army['Расчёт 210-мм РСЗО'] = {
        'Командир расчёта 210-мм РСЗО':1,
        'Артиллерист':2,
        'Заряжающий (пегас)':2,
        'Дивизионная 210-мм РСЗО':1,
        }

metadict_army['Расчёт тактических ракет'] = {
        'Командир расчёта тактических ракет':1,
        'Старший ракетчик':1,
        'Оператор инженерной машины':1,
        'Водитель грузовика':2,
        'Самоходная пусковая установка тактических ракет':1,
        'Транспортно-заряжающая машина тактических ракет':1,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Расчёт оперативно-тактических ракет'] = {
        'Командир расчёта оперативно-тактических ракет':1,
        'Старший ракетчик':1,
        'Оператор инженерной машины':1,
        'Водитель грузовика':3,
        'Самоходная пусковая установка оперативно-тактических ракет':1,
        'Транспортно-заряжающая машина оперативно-тактических ракет':2,
        'Военный грузовик (КУНГ)':1,
        }

metadict_army['Группа управления (шахтная МБР)'] = {
        'Командир группы управления (шахтная МБР)':1,
        'Отделение боевого управления':1,
        }

metadict_army['Отделение боевого управления'] = {
        'Командир отделения связи':1,
        'Связист':4,
        }

metadict_army['Группа подготовки и запуска (шахтная МБР)'] = {
        'Командир расчёта МБР':1,
        'Отделение подготовки и запуска (шахтная МБР)':1,
        }

metadict_army['Отделение подготовки и запуска (шахтная МБР)'] = {
        'Командир отделения подготовки и запуска (шахтная МБР)':1,
        'Старший ракетчик':2,
        'Ракетчик':3,
        'Шахтная пусковая установка МБР':1,
        }

metadict_army['Огневой взвод 120-мм гаубиц'] = {
        'Командир огневого взвода 120-мм гаубиц':1,
        'Отделение управления огнём взвода 120-мм гаубиц':1,
        'Расчёт 120-мм гаубицы':3,
        }

metadict_army['Отделение управления огнём взвода 120-мм гаубиц'] = {
        'Командир отделения связи':1,
        'Связист':2,
        'Водитель грузовика':1,
        'Военный грузовик (КШМ)':1,
        }

metadict_army['Расчёт 120-мм гаубицы'] = {
        'Командир расчёта 120-мм гаубицы':1,
        'Артиллерист':3,
        'Заряжающий (пегас)':1,
        'Водитель грузовика':1,
        'Военный грузовик (перевозчик артиллерии)':1,
        'Полковая 120-мм гаубица':1,
        }

metadict_army['Огневой взвод 150-мм гаубиц'] = {
        'Командир огневого взвода 150-мм гаубиц':1,
        'Отделение управления огнём взвода 150-мм гаубиц':1,
        'Расчёт 150-мм гаубицы':3,
        }

metadict_army['Отделение управления огнём взвода 150-мм гаубиц'] = {
        'Командир отделения связи':1,
        'Связист':2,
        'Водитель грузовика':1,
        'Военный грузовик (КШМ)':1,
        }

metadict_army['Расчёт 150-мм гаубицы'] = {
        'Командир расчёта 150-мм гаубицы':1,
        'Артиллерист':4,
        'Заряжающий (пегас)':2,
        'Водитель грузовика':1,
        'Военный грузовик (перевозчик артиллерии)':1,
        'Дивизионная 150-мм гаубица':1,
        }

metadict_army['Огневой взвод 150-мм САУ'] = {
        'Командир огневого взвода 150-мм САУ':1,
        'Расчёт 150-мм САУ':3,
        }

metadict_army['Расчёт 150-мм САУ'] = {
        'Командир расчёта 150-мм САУ':1,
        'Артиллерист':2,
        'Заряжающий (пегас)':1,
        'Дивизионная 150-мм САУ':1,
        }

metadict_army['Огневой взвод 120-мм САУ'] = {
        'Командир огневого взвода 120-мм САУ':1,
        'Расчёт 120-мм САУ':3,
        }

metadict_army['Расчёт 120-мм САУ'] = {
        'Командир расчёта 120-мм САУ':1,
        'Артиллерист':2,
        'Полковая 120-мм САУ':1,
        }

metadict_army['Огнемётный взвод'] = {
        'Командир взвода специального назначения':1,
        'Отделение боевых машин огнемётчиков':1,
        'Огнемётное отделение':3,
        }

metadict_army['Огнемётное отделение'] = {
        'Командир отделения специального назначения':1,
        'Оперативник (огнемётчик)':3,
        }

metadict_army['Отделение боевых машин огнемётчиков'] = {
        'Заместитель командира передового взвода':1,
        'Командир БМП':3,
        'Механик-водитель БМП':3,
        'Наводчик-оператор БМП':3,
        'Боевая машина пехоты':3,
        }

metadict_army['Взвод аэрозольных завес'] = {
        'Командир взвода РХБ защиты':1,
        'Боец войск РХБ защиты':11,
        'Военный грузовик (КУНГ)':1,
        'Прицеп (водная цистерна)':1,
        'Военный грузовик (тепловая машина специальной обработки)':1,
        }

metadict_army['Взвод военной полиции'] = {
        'Командир взвода военной полиции':1,
        'Отделение военной полиции':3,
        'Отделение разведывательно-сигнальных средств':1,
        'Группа бронетранспортёров':1,
        }

metadict_army['Взвод ведомственной охраны'] = {
        'Командир взвода ведомственной охраны':1,
        'Отделение ведомственной охраны':3,
        'Отделение разведывательно-сигнальных средств':1,
        'Отделение транспортных автомобилей':1,
        }

metadict_army['Отделение военной полиции'] = {
        'Командир отделения военной полиции':1,
        'Военный полицейский':7,
        }

metadict_army['Отделение ведомственной охраны'] = {
        'Командир отделения ведомственной охраны':1,
        'Ведомственный охранник':7,
        }

metadict_army['Взвод стальных рейнджеров'] = {
        'Командир взвода специального назначения':1,
        'Отделение стальных рейнджеров':3,
        'Группа бронетранспортёров':1,
        }

metadict_army['Отделение стальных рейнджеров'] = {
        'Командир отделения специального назначения':1,
        'Оперативник (электролазер)':1,
        'Оперативник (пулемётчик)':1,
        'Оперативник (сапёр)':1,
        }

metadict_army['Диверсионно-разведывательный взвод (аэромобильный)'] = {
        'Командир диверсионно-разведывательного взвода (пегас)':1,
        'Диверсионно-разведывательная группа (аэромобильная)':3,
        }

metadict_army['Диверсионно-разведывательная группа (аэромобильная)'] = {
        'Командир диверсионно-разведывательной группы (пегас)':1,
        'Сапёр диверсионно-разведывательной группы (единорог)':1,
        'Наводчик ПТРК диверсионно-разведывательной группы (пегас)':1,
        'Связист диверсионно-разведывательной группы (пегас)':1,
        'Переносной противотанковый ракетный комплекс':1,
        'Тепловизионный прибор разведки':1,
        'Лазерный прибор разведки':1,
        'Станция ближней разведки':1,
        'Лёгкий планёр (перевозка оружия)':2,
        'Лёгкий планёр (перевозка боеприпасов)':2,
        }

metadict_army['Снайперский взвод (аэромобильный)'] = {
        'Командир снайперского взвода (пегас)':1,
        'Снайперская группа (аэромобильная)':3,
        }

metadict_army['Снайперская группа (аэромобильная)'] = {
        'Командир снайперской группы (пегас)':1,
        'Наблюдатель снайперской группы (пегас)':1,
        'Исполнитель снайперской группы (единорог)':1,
        'Связист снайперской группы (пегас)':1,
        'Тепловизионный прибор разведки':1,
        'Лазерный прибор разведки':1,
        'Станция ближней разведки':1,
        'Лёгкий планёр (перевозка оружия)':2,
        'Лёгкий планёр (перевозка боеприпасов)':2,
        }

metadict_army['Разведывательный взвод (бронетехника)'] = {
        'Командир разведывательного взвода (бронетехника)':1,
        'Разведывательное отделение (бронетехника)':3,
        }

metadict_army['Разведывательное отделение (бронетехника)'] = {
        'Командир разведывательного отделения':1,
        'Оператор БПЛА':1,
        'Оператор-радиотехник':2,
        'Боевая машина пехоты (БРМ)':1,
        'Сторожевой робот':1,
        }

metadict_army['Разведывательный взвод (аэромобильный)'] = {
        'Командир разведывательного взвода (пегас)':1,
        'Разведывательное отделение (аэромобильное)':3,
        }

metadict_army['Разведывательное отделение (аэромобильное)'] = {
        'Командир разведывательного отделения (пегас)':1,
        'Оператор станции ближней разведки (пегас)':1,
        'Разведчик (пегас)':2,
        'Тепловизионный прибор разведки':1,
        'Лазерный прибор разведки':1,
        'Станция ближней разведки':1,
        'Лёгкий планёр (перевозка боеприпасов)':4,
        }

metadict_army['Разведывательный взвод РХБ разведки (аэромобильный)'] = {
        'Командир взвода РХБ разведки (пегас)':1,
        'Разведывательное отделение (аэромобильное)':3,
        }

metadict_army['Отделение артиллерийской разведки (аэромобильное)'] = {
        'Командир разведывательного отделения (пегас)':1,
        'Оператор станции ближней разведки':1,
        'Разведчик (пегас)':1,
        'Топогеодезист (пегас)':1,
        'Станция ближней разведки':1,
        'Лазерный прибор разведки':1,
        'Лёгкий планёр (перевозка боеприпасов)':4,
        }

metadict_army['Отделение управления огнём артиллерии'] = {
        'Командир отделения связи':1,
        'Связист':2,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Артиллерийский командный пункт'] = {
        'Командир отделения связи':1,
        'Связист':1,
        'Механик-водитель БТР':1,
        'Бронетранспортёр (КШМ)':1,
        }

metadict_army['Ремонтный взвод (аэромобильный)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (передовое)':2,
        'Отделение транспортных планёров':1,
        }

metadict_army['Ремонтное отделение (передовое)'] = {
        'Старший механик (автотехника)':1,
        'Механик (слесарные работы)':1,
        'Механик (сварочные работы)':1,
        'Механик (сборочно-разборочные работы)':1,
        }

metadict_army['Взвод обеспечения авиации'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (передовое)':2,
        'Отделение транспортных планёров':1,
        }

metadict_army['Ремонтный взвод (БПЛА)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (БПЛА)':3,
        }

metadict_army['Ремонтное отделение (БПЛА)'] = {
        'Старший механик (оптитроника)':1,
        'Механик (пайка и монтаж)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская)':1,
        }

metadict_army['Ремонтный взвод (боевая экипировка)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (боевая экипировка)':3,
        }

metadict_army['Ремонтное отделение (боевая экипировка)'] = {
        'Старший механик (радиоэлектроника)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (шитьё и обработка)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская)':1,
        }

metadict_army['Ремонтный взвод (вариаторы и маховики)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (вариаторы и маховики)':3,
        'Отделение автокрана':1,
        }

metadict_army['Ремонтное отделение (вариаторы и маховики)'] = {
        'Старший механик (монокристаллы)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (слесарные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (слесарная мастерская)':1,
        }

metadict_army['Отделение автокрана'] = {
        'Оператор инженерной машины':1,
        'Механик (пегас)':1,
        'Военный грузовик (автокран)':1,
        }

metadict_army['Ремонтный взвод (гусеничная ходовая)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (гусеничная ходовая)':3,
        'Отделение автокрана':1,
        }

metadict_army['Ремонтное отделение (гусеничная ходовая)'] = {
        'Старший механик (автотехника)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (сварочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская бронетехники)':1,
        }

metadict_army['Ремонтный взвод (двигатели и генераторы)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (двигатели и генераторы)':3,
        }

metadict_army['Ремонтное отделение (двигатели и генераторы)'] = {
        'Старший механик (ДВС)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (сварочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (автомастерская)':1,
        }

metadict_army['Ремонтный взвод (газотурбинные двигатели)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (газотурбинные двигатели)':3,
        'Отделение автокрана':1,
        }

metadict_army['Ремонтное отделение (газотурбинные двигатели)'] = {
        'Старший механик (ДВС)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (сварочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (автомастерская)':1,
        }

metadict_army['Ремонтный взвод (зенитные ракеты)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (зенитные ракеты)':3,
        }

metadict_army['Ремонтное отделение (зенитные ракеты)'] = {
        'Старший механик (оптитроника)':1,
        'Механик (пайка и монтаж)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (автомастерская)':1,
        }

metadict_army['Ремонтный взвод (колёсная ходовая)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (колёсная ходовая)':3,
        'Отделение автокрана':1,
        }

metadict_army['Ремонтное отделение (колёсная ходовая)'] = {
        'Старший механик (автотехника)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (сварочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская бронетехники)':1,
        }

metadict_army['Ремонтный взвод (оптитроника)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (оптитроника)':3,
        }

metadict_army['Ремонтное отделение (оптитроника)'] = {
        'Старший механик (оптитроника)':1,
        'Механик (пайка и монтаж)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская)':1,
        }

metadict_army['Ремонтный взвод (оптические приборы)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (оптические приборы)':3,
        }

metadict_army['Ремонтное отделение (оптические приборы)'] = {
        'Старший механик (монокристаллы)':1,
        'Механик (пайка и монтаж)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская)':1,
        }

metadict_army['Ремонтный взвод (радиоэлектроника)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (радиоэлектроника)':3,
        }

metadict_army['Ремонтное отделение (радиоэлектроника)'] = {
        'Старший механик (радиоэлектроника)':1,
        'Механик (пайка и монтаж)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская)':1,
        }

metadict_army['Ремонтный взвод (системы наведения)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (системы наведения)':3,
        }

metadict_army['Ремонтное отделение (системы наведения)'] = {
        'Старший механик (радиоэлектроника)':1,
        'Механик (пайка и монтаж)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская)':1,
        }

metadict_army['Ремонтный взвод (баллистические ракеты)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (баллистические ракеты)':3,
        'Отделение автокрана':1,
        }

metadict_army['Ремонтное отделение (баллистические ракеты)'] = {
        'Старший механик (оптитроника)':1,
        'Механик (пайка и монтаж)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская)':1,
        }

metadict_army['Ремонтный взвод (противотанковые ракеты)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (противотанковые ракеты)':3,
        }

metadict_army['Ремонтное отделение (противотанковые ракеты)'] = {
        'Старший механик (оптитроника)':1,
        'Механик (пайка и монтаж)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская)':1,
        }

metadict_army['Ремонтный взвод (лёгкие планёры)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (лёгкие планёры)':3,
        }

metadict_army['Ремонтное отделение (лёгкие планёры)'] = {
        'Старший механик (авиатехника)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (шитьё и обработка)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская)':1,
        }

metadict_army['Ремонтный взвод (тяжёлые планёры)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (лёгкие планёры)':3,
        'Отделение автокрана':1,
        }

metadict_army['Ремонтное отделение (тяжёлые планёры)'] = {
        'Старший механик (авиатехника)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (шитьё и обработка)':1,
        'Водитель-механик':1,
        'Военный грузовик (мастерская)':1,
        }

metadict_army['Ремонтный взвод (пушки и гаубицы)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (пушки и гаубицы)':3,
        'Отделение автокрана':1,
        }

metadict_army['Ремонтное отделение (пушки и гаубицы)'] = {
        'Старший механик (калибровка)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (слесарные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (слесарная мастерская)':1,
        }

metadict_army['Ремонтный взвод (реактивная артиллерия)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (реактивная артиллерия)':3,
        'Отделение автокрана':1,
        }

metadict_army['Ремонтное отделение (реактивная артиллерия)'] = {
        'Старший механик (калибровка)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (слесарные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (слесарная мастерская)':1,
        }

metadict_army['Ремонтный взвод (стрелковое оружие)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (стрелковое оружие)':3,
        }

metadict_army['Ремонтное отделение (стрелковое оружие)'] = {
        'Старший механик (калибровка)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (слесарные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (слесарная мастерская)':1,
        }

metadict_army['Ремонтный взвод (автомобили)'] = {
        'Командир ремонтного взвода':1,
        'Ремонтное отделение (автомобили)':2,
        'Ремонтное отделение (колёсная ходовая)':1,
        'Отделение автокрана':1,
        }

metadict_army['Ремонтное отделение (автомобили)'] = {
        'Старший механик (автотехника)':1,
        'Механик (сборочно-разборочные работы)':1,
        'Механик (сварочные работы)':1,
        'Водитель-механик':1,
        'Военный грузовик (автомастерская)':1,
        }

metadict_army['Взвод эвакуации раненых (аэромобильный)'] = {
        'Командир медицинского взвода (пегас)':1,
        'Отделение эвакуации раненых (аэромобильное)':3,
        }

metadict_army['Отделение эвакуации раненых (аэромобильное)'] = {
        'Командир отделения эвакуации раненых (пегас)':1,
        'Помощник санитара (пегас)':3,
        'Лёгкий планёр (перевозка снаряжения)':4,
        }

metadict_army['Взвод тяжёлого оружия'] = {
        'Командир взвода тяжёлого оружия':1,
        'Пулемётное отделение':1,
        'Гранатомётное отделение':1,
        }

metadict_army['Пулемётное отделение'] = {
        'Командир пулемётного отделения':1,
        'Расчёт крупнокалиберного пулемёта':3,
        }

metadict_army['Расчёт крупнокалиберного пулемёта'] = {
        'Командир пулемётного расчёта':1,
        'Наводчик пулемётного расчёта':1,
        'Подносчик БК пулемётного расчёта':1,
        'Станковый 12-мм пехотный пулемёт':1,
        }

metadict_army['Гранатомётное отделение'] = {
        'Командир гранатомётного отделения':1,
        'Расчёт АГС':3,
        }

metadict_army['Расчёт АГС'] = {
        'Командир расчёта АГС':1,
        'Наводчик расчёта АГС':1,
        'Подносчик БК расчёта АГС':2,
        'Станковый 40-мм автоматический гранатомёт':1,
        }

metadict_army['Гранатомётный взвод (аэромобильный)'] = {
        'Командир гранатомётного взвода (пегас)':1,
        'Гранатомётное отделение (аэромобильное)':3,
        }

metadict_army['Гранатомётное отделение (аэромобильное)'] = {
        'Командир гранатомётного отделения (пегас)':1,
        'Расчёт АГС (аэромобильный)':3,
        }

metadict_army['Расчёт АГС (аэромобильный)'] = {
        'Командир расчёта АГС (пегас)':1,
        'Наводчик расчёта АГС (пегас)':1,
        'Подносчик БК расчёта АГС (пегас)':1,
        'Станковый 40-мм автоматический гранатомёт':1,
        'Лёгкий планёр (перевозка оружия)':1,
        'Лёгкий планёр (перевозка боеприпасов)':2,
        }

metadict_army['Пулемётный взвод (аэромобильный)'] = {
        'Командир пулемётного взвода (пегас)':1,
        'Пулемётное отделение (аэромобильное)':3,
        }

metadict_army['Пулемётное отделение (аэромобильное)'] = {
        'Командир пулемётного отделения (пегас)':1,
        'Расчёт крупнокалиберного пулемёта (аэромобильный)':3,
        }

metadict_army['Расчёт крупнокалиберного пулемёта (аэромобильный)'] = {
        'Командир пулемётного расчёта (пегас)':1,
        'Наводчик пулемётного расчёта (пегас)':1,
        'Подносчик БК пулемётного расчёта (пегас)':1,
        'Станковый 12-мм пехотный пулемёт':1,
        'Лёгкий планёр (перевозка оружия)':1,
        'Лёгкий планёр (перевозка боеприпасов)':2,
        }

metadict_army['Противотанковый взвод (аэромобильный)'] = {
        'Командир противотанкового взвода (пегас)':1,
        'Противотанковое отделение (аэромобильное)':3,
        }

metadict_army['Противотанковое отделение (аэромобильное)'] = {
        'Командир противотанкового отделения (пегас)':1,
        'Противотанковый расчёт (аэромобильный)':3,
        }

metadict_army['Противотанковый расчёт (аэромобильный)'] = {
        'Командир расчёта ПТРК (пегас)':1,
        'Наводчик расчёта ПТРК (единорог)':1,
        'Переносной противотанковый ракетный комплекс':1,
        'Лёгкий планёр (перевозка оружия)':1,
        }

metadict_army['Противотанковый взвод (бронетехника)'] = {
        'Командир противотанкового взвода':1,
        'Группа бронетранспортёров':1,
        'Противотанковое отделение':3,
        }

metadict_army['Противотанковое отделение'] = {
        'Командир противотанкового отделения':1,
        'Противотанковый расчёт':3,
        }

metadict_army['Противотанковый расчёт'] = {
        'Командир расчёта ПТРК':1,
        'Наводчик расчёта ПТРК (единорог)':1,
        'Переносной противотанковый ракетный комплекс':1,
        }

#----
# Военные объекты:

metadict_army['Спутниковая система обнаружения стартов МБР'] = {
        'Спутник радиотехнической разведки (активный)':3,
        'Спутник радиотехнической разведки (выбывший)':30,
        }

metadict_army['Спутниковая система радиотехнической разведки'] = {
        'Спутник оптико-электронной разведки (активный)':3,
        'Спутник оптико-электронной разведки (выбывший)':30,
        }

metadict_army['Спутниковая система оптико-электронной разведки'] = {
        'Спутник оптико-электронной разведки (активный)':3,
        'Спутник оптико-электронной разведки (выбывший)':120,
        }

metadict_army['Спутниковая система навигации'] = {
        'Спутник системы навигации (активный)':24,
        'Спутник системы навигации (выбывший)':48,
        }

metadict_army['Спутниковая система ретрансляции'] = {
        'Спутник-ретранслятор (активный)':2,
        'Спутник-ретранслятор (выбывший)':4,
        }

metadict_army['Спутниковая система связи'] = {
        'Спутник связи (активный)':20,
        'Спутник связи (выбывший)':80,
        }

metadict_army['Складской терминал снаряжения'] = {
        'Управление складского терминала':1,
        'Склад ремонтного оборудования':2,
        'Склад расходных материалов':3,
        'Склад оружия и экипировки':2,
        }

metadict_army['Складской терминал боеприпасов'] = {
        'Управление складского терминала':1,
        'Склад лёгких боеприпасов':1,
        'Склад артиллерийских боеприпасов':5,
        'Склад тяжёлых боеприпасов':2,
        }

metadict_army['Складкской терминал продовольствия'] = {
        'Управление складского терминала':1,
        # На месяц для 15 тысяч солдат.
        'Склад продовольствия':5,
        'Склад скоропортящейся еды':1,
        'Склад питьевой воды':1,
        }

metadict_army['Складской терминал твёрдого топлива'] = {
        'Управление складского терминала':1,
        # На 25 дней обогрева буржуйками 15 000 солдат.
        'Склад угля':5,
        }

metadict_army['Складской терминал жидкого топлива'] = {
        'Управление складского терминала':1,
        # На 16 вылетов авиаполка истребителей.
        'Склад ГСМ':5,
        }

metadict_army['Складской терминал строительных материалов'] = {
        'Управление складского терминала':1,
        'Склад расходных материалов':3,
        'Склад металлоконструкций':2,
        'Склад понтонных мостов':2,
        }

metadict_army['Склады ракетной базы'] = {
        'Управление складского терминала':1,
        'Склад компонентов баллистических ракет':1,
        'Склад ремонтного оборудования':1,
        'Склад расходных материалов':1,
        'Склад ядерных боеголовок':1,
        }

metadict_army['Склады военного аэродрома'] = {
        'Управление складского терминала':1,
        'Склад ГСМ':3,
        'Склад тяжёлых боеприпасов':2,
        'Склад расходных материалов':1,
        }

metadict_army['Склад угля'] = {
        'Контейнер для угля (70 кубометров)':9,
        }

metadict_army['Склад ГСМ'] = {
        # На четыре вылета авиаполка истребителей.
        'Топливный резервуар (50 кубометров)':12,
        }

metadict_army['Склад питьевой воды'] = {
        'Водный резервуар (50 кубометров)':9,
        }

metadict_army['Склад продовольствия'] = {
        # На неделю для 15 тысяч солдат.
        'Контейнер для продовольствия (70 кубометров)':9,
        }

metadict_army['Склад скоропортящейся еды'] = {
        'Рефрижератор (70 кубометров)':9,
        }

metadict_army['Склад артиллерийских боеприпасов'] = {
        'Контейнер для боеприпасов (70 кубометров)':9,
        }

metadict_army['Склад тяжёлых боеприпасов'] = {
        'Контейнер для боеприпасов (70 кубометров)':9,
        }

metadict_army['Склад лёгких боеприпасов'] = {
        'Контейнер для боеприпасов (70 кубометров)':9,
        }

metadict_army['Склад ремонтного оборудования'] = {
        'Контейнер для снаряжения (70 кубометров)':9,
        }

metadict_army['Склад расходных материалов'] = {
        'Контейнер для снаряжения (70 кубометров)':9,
        }

metadict_army['Склад металлоконструкций'] = {
        'Контейнер для строительных материалов (70 кубометров)':9,
        }

metadict_army['Склад понтонных мостов'] = {
        'Понтонно-мостовой парк':2,
        }

metadict_army['Склад оружия и экипировки'] = {
        'Контейнер для снаряжения (70 кубометров)':9,
        }
