#----
# Военная техника:

metadict_detail['Автогрейдер'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':30,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':300000,
        }

metadict_detail['Военный грузовик'] = {
        '|-Проект военные грузовики (выпущено штук)':1,
        'Сборка бронетехники (нормо-часов)':300,
        'Шасси военного грузовика':1,
        'Корпус военного грузовика':1,
        }

metadict_detail['Военный грузовик (автомобильная фильтровальная станция)'] = {
        'Военные грузовики':1,
        'Автомобильная фильтровальная станция':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '-Очистка/дезактивация, опреснение воды (тонн/час)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':300000,
        }

metadict_detail['Боевая машина десанта'] = {
        'Боевые машины десанта':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Боевая скорострельность (выстрелов/минуту)':250,
        '-Заградительный огонь (метров фронта)':25,
        '--Противотанковые возможности (в обороне)':1.75,
        '--Противотанковые возможности (в наступлении)':0.4,
        '--Противотанковые возможности (во встречном бою)':1.5,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'Снаряды 30x165':500,
        'Патроны 6x48':2000,
        'Управляемые ракеты ПТРК':4,
        'wpn_cost':3000000,
        }

metadict_detail['Боевая машина десанта (КШМ)'] = {
        'Боевые машины десанта':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Боевая скорострельность (выстрелов/минуту)':250,
        '-Заградительный огонь (метров фронта)':25,
        '--Противотанковые возможности (в обороне)':1.75,
        '--Противотанковые возможности (в наступлении)':0.4,
        '--Противотанковые возможности (во встречном бою)':1.5,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'Снаряды 30x165':500,
        'Патроны 6x48':2000,
        'Управляемые ракеты ПТРК':4,
        'wpn_cost':3500000,
        }

metadict_detail['Боевая машина пехоты'] = {
        'Боевые машины пехоты':1,
        'Шасси БМП':1,
        'Корпус БМП':1,
        'Боевой модуль БМП':1,
        'Электрооборудование и средства связи БМП':1,
        }

metadict_detail['Боевая машина пехоты (БРМ)'] = {
        'Боевые машины пехоты':1,
        'Шасси БМП':1,
        'Корпус БМП':1,
        'Боевой модуль БМП':1,
        'Электрооборудование и средства связи БМП':1,
        }

metadict_detail['Боевая машина пехоты (КШМ)'] = {
        'Боевые машины пехоты':1,
        'Шасси БМП':1,
        'Корпус БМП':1,
        'Боевой модуль БМП':1,
        'Электрооборудование и средства связи БМП':1,
        }

metadict_detail['Бронетранспортёр'] = {
        'Бронетранспортёры':1,
        'Шасси БТР':1,
        'Корпус БТР':1,
        'Боевой модуль БТР':1,
        'Электрооборудование и средства связи БТР':1,
        }

metadict_detail['Бронетранспортёр (ИРМ)'] = {
        'Бронетранспортёры':1,
        'Шасси БТР':1,
        'Корпус БТР':1,
        'Боевой модуль БТР':1,
        'Электрооборудование и средства связи БТР':1,
        'Оборудование инженерной разведки':1,
        }

metadict_detail['Бронетранспортёр (КШМ)'] = {
        'Бронетранспортёры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'Патроны 6x48':2000,
        'wpn_cost':1500000,
        }

metadict_detail['Бронетранспортёр (спутниковая связь)'] = {
        'Бронетранспортёры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'Патроны 6x48':2000,
        'wpn_cost':1500000,
        }

metadict_detail['Бронетранспортёр (КВ-радиостанция)'] = {
        'Бронетранспортёры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'Патроны 6x48':2000,
        'wpn_cost':1000000,
        }

metadict_detail['Бронетранспортёр (радиоподавление)'] = {
        'Бронетранспортёры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'Патроны 6x48':2000,
        'wpn_cost':1500000,
        }

metadict_detail['Бронетранспортёр (звукометрическая разведка)'] = {
        'Бронетранспортёры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'Патроны 6x48':2000,
        'wpn_cost':1500000,
        }

metadict_detail['Бронетранспортёр (РХБ разведка)'] = {
        'Бронетранспортёры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'Патроны 15x120':500,
        'Патроны 6x48':2000,
        'Выстрелы АГС':400,
        'wpn_cost':1500000,
        }

metadict_detail['Бронетранспортёр (120-мм миномёт)'] = {
        'Бронетранспортёры':1,
        'Станковые 120-мм миномёты':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Заградительный огонь (метров фронта)':30,
        '--Артиллерия (РОС)':0.5,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'Миномётные мины 120-мм':30,
        'Патроны 6x48':2000,
        'wpn_cost':1100000,
        }

metadict_detail['Основной боевой танк'] = {
        'Основные боевые танки':1,
        'Шасси ОБТ':1,
        'Корпус ОБТ':1,
        'Боевой модуль ОБТ':1,
        'Электрооборудование и средства связи ОБТ':1,
        'Лазерная система активной защиты':1,
        }

metadict_detail['Основной боевой танк (КШМ)'] = {
        'Основные боевые танки':1,
        'Шасси ОБТ':1,
        'Корпус ОБТ':1,
        'Боевой модуль ОБТ':1,
        'Электрооборудование и средства связи ОБТ':1,
        'Лазерная система активной защиты':1,
        }

metadict_detail['Истребитель-бомбардировщик'] = {
        'Многоцелевые истребители':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':5,
        '-Место под жидкое топливо (литры)':4000,
        '--Противовоздушные возможности (по вертолётам)':1.44,
        '--Противовоздушные возможности (по самолётам)':0.72,
        '--Противотанковые возможности (в обороне)':2,
        '--Противотанковые возможности (в наступлении)':1,
        '--Противотанковые возможности (во встречном бою)':2,
        '--Потребление энергии (кВт)':20000,
        'Снаряды 30x165':200,
        'Спарк-батареи':200,
        'Зенитные ракеты средней дальности':2,
        'Авиационные управляемые ракеты':2,
        'wpn_cost':20000000,
        }

metadict_detail['Транспортный экранолёт'] = {
        'Транспортные экранолёты':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':500,
        '-Готовка горячей пищи и хлеба (суточных пайков)':10,
        '--Потребление энергии (кВт)':100000,
        '--Производство энергии (кВт)':100000,
        '--Запас энергии (МДж)':100000,
        'Снаряды 30x165':1000,
        'Спарк-батареи':800,
        'wpn_cost':600000000,
        }

metadict_detail['Полковая 120-мм САУ'] = {
        'Самоходные 120-мм гаубицы':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Заградительный огонь (метров фронта)':30,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        '--Артиллерия (РОС)':0.7,
        'Осколочно-фугасные снаряды 120-мм':30,
        'wpn_cost':2000000,
        }

metadict_detail['Дивизионная 150-мм гаубица'] = {
        'Буксируемые 150-мм гаубицы':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':5,
        '-Заградительный огонь (метров фронта)':50,
        '--Устойчивость к подавлению (в наступлении, РБ)':100,
        '--Устойчивость к подавлению (в окопах, РБ)':50,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':50,
        '--Запас энергии (МДж)':1000,
        '--Артиллерия (РОС)':0.85,
        'Осколочно-фугасные 150-мм':50,
        'wpn_cost':500000,
        }

metadict_detail['Дивизионная 150-мм САУ'] = {
        'Самоходные 150-мм гаубицы':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':40,
        '-Заградительный огонь (метров фронта)':50,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        '--Артиллерия (РОС)':1,
        'Осколочно-фугасные 150-мм':50,
        'wpn_cost':4000000,
        }

metadict_detail['Дивизионная 210-мм РСЗО'] = {
        'Реактивная 210-мм артиллерия':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':15,
        '-Заградительный огонь (метров фронта)':75,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        '--Артиллерия (РОС)':2,
        'Реактивные снаряды 210-мм':16,
        'wpn_cost':2000000,
        }

metadict_detail['Самоходная пусковая установка тактических ракет'] = {
        'Тактические ракетные комплексы':0.8,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        '--Артиллерия (РОС)':3,
        'Тактические ракеты':1,
        'wpn_cost':2000000,
        }

metadict_detail['Транспортно-заряжающая машина тактических ракет'] = {
        'Тактические ракетные комплексы':0.2,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'Тактические ракеты':2,
        'wpn_cost':1000000,
        }

metadict_detail['Самоходная пусковая установка оперативно-тактических ракет'] = {
        'Оперативно-тактические ракетные комплексы':0.6,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':30,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        '--Артиллерия (РОС)':5.8,
        'Оперативно-тактические ракеты':1,
        'wpn_cost':4000000,
        }

metadict_detail['Транспортно-заряжающая машина оперативно-тактических ракет'] = {
        'Оперативно-тактические ракетные комплексы':0.2,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'Оперативно-тактические ракеты':1,
        'wpn_cost':1000000,
        }

metadict_detail['Мобильная пусковая установка МБР'] = {
        'Стратегические ракетные комплексы':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':50,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':800,
        '--Запас энергии (МДж)':40000,
        'Стратегические ядерные ракеты':1,
        'wpn_cost':6000000,
        }

metadict_detail['Машина обеспечения боевого дежурства'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':50,
        '-Готовка горячей пищи и хлеба (суточных пайков)':10,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':800,
        '--Запас энергии (МДж)':40000,
        'wpn_cost':2000000,
        }

metadict_detail['Зенитный ракетно-пушечный комплекс'] = {
        'ЗРПК малой дальности':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':30,
        '-Боевая скорострельность (выстрелов/минуту)':500,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Противовоздушные возможности (по вертолётам)':1.44,
        '--Противовоздушные возможности (по самолётам)':0.36,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'Зенитные ракеты малой дальности':8,
        'Снаряды 30x165':2000,
        'Спарк-батареи':200,
        'wpn_cost':10000000,
        }

metadict_detail['Зенитный ракетный комплекс средней дальности'] = {
        'ЗРК средней дальности':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':30,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Противовоздушные возможности (по вертолётам)':1.44,
        '--Противовоздушные возможности (по самолётам)':0.72,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'Зенитные ракеты средней дальности':8,
        'wpn_cost':10000000,
        }

metadict_detail['Пусковая установка ЗРК большой дальности'] = {
        'ЗРК большой дальности':0.4,
        'Зенитные ракеты большой дальности':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':3,
        '--Противовоздушные возможности (по самолётам)':0.8,
        'wpn_cost':200000,
        }

metadict_detail['Транспортно-заряжающая машина ЗРК большой дальности'] = {
        'ЗРК большой дальности':0.3,
        'Зенитные ракеты большой дальности':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Противовоздушные возможности (по самолётам)':0.8,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Лёгкий планер'] = {
        'Лёгкие планеры':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.03,
        '-Место под боеприпасы (тонн)':0.2,
        'wpn_cost':10000,
        }

metadict_detail['Лёгкий планер (транспорт оружия)'] = {
        'Лёгкие планеры':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.03,
        'wpn_cost':10000,
        }

metadict_detail['Лёгкий планер (транспорт снаряжения)'] = {
        'Лёгкие планеры':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.03,
        'wpn_cost':10000,
        }

metadict_detail['Мобильная атомная электростанция'] = {
        'Мобильные атомные электростанции':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':100,
        '--Производство энергии (кВт)':50000,
        'wpn_cost':100000000,
        }

metadict_detail['РЛС обнаружения'] = {
        'Радиолокаторы ближнего обнаружения':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':25,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':10000000,
        }

metadict_detail['РЛС управления и слежения'] = {
        'Радиолокаторы ближнего обнаружения':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':15,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':5000000,
        }

metadict_detail['Сторожевой робот'] = {
        'Сторожевые роботы':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.2,
        '-Боевая скорострельность (выстрелов/минуту)':250,
        '-Заградительный огонь (метров фронта)':5,
        '--Устойчивость к подавлению (в наступлении, РБ)':50,
        '--Устойчивость к подавлению (в окопах, РБ)':25,
        '--Устойчивость к подавлению (на марше, РБ)':15,
        '--Потребление энергии (кВт)':60,
        '--Запас энергии (МДж)':300,
        'Выстрелы АГС':40,
        'Патроны 6x48':500,
        'wpn_cost':500000,
        }

metadict_detail['Штурмовой робот'] = {
        # https://ru.wikipedia.org/wiki/Wiesel
        'Штурмовые роботы':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':2,
        '-Боевая скорострельность (выстрелов/минуту)':250,
        '--Устойчивость к подавлению (в наступлении, РБ)':50,
        '--Устойчивость к подавлению (в окопах, РБ)':25,
        '--Устойчивость к подавлению (на марше, РБ)':15,
        '--Противотанковые возможности (в обороне)':1.75,
        '--Противотанковые возможности (в наступлении)':0.4,
        '--Противотанковые возможности (во встречном бою)':1.5,
        '--Потребление энергии (кВт)':30,
        '--Запас энергии (МДж)':2000,
        'Управляемые ракеты ПТРК':4,
        'Патроны 15x120':500,
        'Патроны 6x48':2000,
        'wpn_cost':1000000,
        }

metadict_detail['Разведывательный БПЛА'] = {
        # https://ru.wikipedia.org/wiki/Пчела-1Т
        'Разведывательные роботы':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.2,
        '--Потребление энергии (кВт)':30,
        '--Запас энергии (МДж)':600,
        'wpn_cost':500000,
        }

metadict_detail['БПЛА радиоподавления'] = {
        'Разведывательные роботы':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.2,
        '--Потребление энергии (кВт)':30,
        '--Запас энергии (МДж)':600,
        'wpn_cost':500000,
        }

metadict_detail['Тяжёлый транспортный планер'] = {
        'Тяжёлые транспорные планеры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':2,
        '-Место под лёгкую технику (тонн)':10,
        'wpn_cost':50000,
        }

metadict_detail['Боевой планер (реактивные гранаты)'] = {
        'Боевые планеры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.1,
        '-Боевая скорострельность (выстрелов/минуту)':150,
        '-Заградительный огонь (метров фронта)':25,
        '--Противотанковые возможности (в обороне)':0.9,
        '--Противотанковые возможности (в наступлении)':0.125,
        '--Противотанковые возможности (во встречном бою)':0.8,
        'Реактивные гранаты':24,
        'Короб на 300 патронов 6x48':2,
        'wpn_cost':200000,
        }

metadict_detail['Боевой планер (управляемые ракеты)'] = {
        'Боевые планеры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.1,
        '-Боевая скорострельность (выстрелов/минуту)':150,
        '--Противотанковые возможности (в обороне)':1.75,
        '--Противотанковые возможности (в наступлении)':0.4,
        '--Противотанковые возможности (во встречном бою)':1.5,
        'Управляемые ракеты ПТРК':4,
        'Короб на 300 патронов 6x48':2,
        'wpn_cost':200000,
        }

metadict_detail['Боевой планер (зенитные ракеты)'] = {
        'Боевые планеры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.1,
        '-Боевая скорострельность (выстрелов/минуту)':150,
        '--Противовоздушные возможности (по вертолётам)':0.315,
        '--Противовоздушные возможности (по самолётам)':0.1,
        'Зенитные ракеты малой дальности':1,
        'Короб на 300 патронов 6x48':2,
        'wpn_cost':200000,
        }

metadict_detail['Боевой планер (авиабомбы)'] = {
        'Боевые планеры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.1,
        '-Боевая скорострельность (выстрелов/минуту)':150,
        'Кассетная авиабомба (100 кг)':1,
        'Короб на 300 патронов 6x48':2,
        'wpn_cost':200000,
        }

metadict_detail['Бронированная ремонтно-эвакуационная машина'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':30,
        '--Потребление энергии (кВт)':600,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':2000000,
        }

metadict_detail['Буксируемый катер'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Быстроходная траншейная машина'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':30,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':2000000,
        }

metadict_detail['Военный грузовик (КУНГ)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (автомастерская)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (мастерская бронетехники)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (слесарная мастерская)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (КВ-радиостанция)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (КШМ)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':300000,
        }

metadict_detail['Военный грузовик (сервер АСУ)'] = {
        'Военные грузовики':1,
        'Оптические компьютеры (мейнфреймы)':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':300000,
        }

metadict_detail['Военный грузовик (спутниковая связь)'] = {
        'Военные грузовики':1,
        'Устройства спутниковой связи':1,
        'Оптические компьютеры (терминалы)':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':300000,
        }

metadict_detail['Военный грузовик (перевозчик авиации)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Военный грузовик (перевозчик ПУ ЗРК)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Военный грузовик (перевозчик артиллерии)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Военный грузовик (авторазливочная станция)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (пожарная машина)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (водная цистерна)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Место под воду (тонн)':7,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Прицеп (водная цистерна)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':3,
        '-Место под воду (тонн)':5,
        'wpn_cost':5000,
        }

metadict_detail['Военный грузовик (топливная цистерна)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Место под жидкое топливо (литры)':7000,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Прицеп (топливная цистерна)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':3,
        '-Место под жидкое топливо (литры)':5000,
        'wpn_cost':5000,
        }

metadict_detail['Военный грузовик (боеприпасы)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Место под боеприпасы (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Прицеп (боеприпасы)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':3,
        '-Место под боеприпасы (тонн)':5,
        'wpn_cost':5000,
        }

metadict_detail['Военный грузовик (зенитные ракеты)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Место под зенитные ракеты (тонн)':6,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Прицеп (зенитные ракеты)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':3,
        '-Место под зенитные ракеты (тонн)':5,
        'wpn_cost':5000,
        }

metadict_detail['Военный грузовик (маховики)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Место под маховики (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Прицеп (маховики)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':3,
        '-Место под маховики (тонн)':5,
        'wpn_cost':5000,
        }

metadict_detail['Военный грузовик (взрывчатка и мины)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Место под взрывчатку и мины (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }
metadict_detail['Прицеп (взрывчатка и мины)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':3,
        '-Место под взрывчатку и мины (тонн)':5,
        'wpn_cost':5000,
        }

metadict_detail['Военный грузовик (продовольствие)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Место под продовольствие (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Прицеп (продовольствие)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':3,
        '-Место под продовольствие (тонн)':5,
        'wpn_cost':5000,
        }

metadict_detail['Военный грузовик (снаряжение)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Место под снаряжение (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Прицеп (снаряжение)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':3,
        '-Место под снаряжение (тонн)':5,
        'wpn_cost':5000,
        }

metadict_detail['Военный грузовик (строительные материалы)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Место под стройматериалы (тонн)':5,
        '--Потребление энергии (кВт)':200,
        'wpn_cost':100000,
        }

metadict_detail['Прицеп (строительные материалы)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':3,
        '-Место под стройматериалы (тонн)':5,
        'wpn_cost':5000,
        }

metadict_detail['Военный грузовик (твёрдое топливо)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-Место под уголь (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Прицеп (твёрдое топливо)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':3,
        '-Место под уголь (тонн)':5,
        'wpn_cost':5000,
        }

metadict_detail['Войсковой экскаватор'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':20,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':300000,
        }

metadict_detail['Военный грузовик (самосвал)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':100000,
        }

metadict_detail['Инженерная машина разграждения'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':30,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':100,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':3000000,
        }

metadict_detail['Военный грузовик (комплекс дезинфекционно-душевой)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':10,
        '-Помывка/дезинфекция личного состава (солдат/час)':160,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (тепловая машина специальной обработки)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':300000,
        }

metadict_detail['Военный грузовик (полевая баня)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '-Помывка/дезинфекция личного состава (солдат/час)':32,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (полевая прачечная)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (автокран)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':15,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':300000,
        }

metadict_detail['Военный грузовик (бурильная машина)'] = {
        'Военные грузовики':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':15,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':1000000,
        }

metadict_detail['Машина для отрывки котлована'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':40,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':100,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':4000000,
        }

metadict_detail['Плавающий гусеничный транспортер'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':25,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':100,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':2000000,
        }

metadict_detail['Полевая кухня (ротная)'] = {
        'Полевые кухни':1,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':2,
        '-Готовка горячей пищи и хлеба (суточных пайков)':130,
        '--Потребление энергии (кВт)':100,
        'wpn_cost':10000,
        }

metadict_detail['Военный грузовик (полевая кухня)'] = {
        'Военные грузовики':1,
        'Полевые кухни':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '-Готовка горячей пищи и хлеба (суточных пайков)':200,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Военный грузовик (полевой хлебозавод)'] = {
        'Военные грузовики':1,
        'Полевые кухни':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':7,
        '-Готовка горячей пищи и хлеба (суточных пайков)':2000,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':200000,
        }

metadict_detail['Радиопеленгационный метеорологический комплекс'] = {
        'Радиолокаторы ближнего обнаружения':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':1000000,
        }

metadict_detail['Рама лесопильная'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '--Потребление энергии (кВт)':30,
        '--Запас энергии (МДж)':2000,
        'wpn_cost':500000,
        }

metadict_detail['Станция зарядки маховиков'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':30,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':2000000,
        }

metadict_detail['Станция радиотехнической разведки'] = {
        'Бронетранспортёры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':3000000,
        }

metadict_detail['Станция дальней радиотехнической разведки'] = {
        'Радиолокаторы ближнего обнаружения':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':25,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':10000000,
        }

metadict_detail['Станция помех наведению'] = {
        'Радиолокаторы ближнего обнаружения':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':25,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':10000000,
        }

metadict_detail['Бронетранспортёр (станция радиоразведки)'] = {
        'Бронетранспортёры':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':10,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':5,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':2000000,
        }

metadict_detail['Тяжёлый механизированный мост'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':30,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':400,
        '--Запас энергии (МДж)':20000,
        'wpn_cost':3000000,
        }

metadict_detail['Тяжёлый седельный тягач'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':30,
        '-Место под тяжёлую технику (тонн)':60,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':800,
        '--Запас энергии (МДж)':40000,
        'wpn_cost':1000000,
        }

metadict_detail['Установка разминирования'] = {
        'Инженерные машины':1,
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':15,
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Потребление энергии (кВт)':200,
        '--Запас энергии (МДж)':10000,
        'wpn_cost':1000000,
        }
