#----
# Огонь прямой наводкой (распределение по времени суток):

metadict_detail['-Вероятность поражения цели пулей (боец)'] = {
        '-Стрельба днём по цели (боец)':0.9,
        '-Стрельба ночью по цели (боец)':0.1,
        }

metadict_detail['-Вероятность поражения цели снарядом (танк)'] = {
        '-Стрельба днём по цели (танк)':0.9,
        '-Стрельба ночью по цели (танк)':0.1,
        }

metadict_detail['-Вероятность поражения цели снарядом (ББМ)'] = {
        '-Стрельба днём по цели (ББМ)':0.9,
        '-Стрельба ночью по цели (ББМ)':0.1,
        }

metadict_detail['-Вероятность поражения цели снарядом (пегас)'] = {
        '-Стрельба днём по цели (пегас)':0.7,
        '-Стрельба ночью по цели (пегас)':0.3,
        }

metadict_detail['-Вероятность поражения цели ракетой (самолёт)'] = {
        '-Стрельба днём по цели (самолёт)':0.9,
        '-Стрельба ночью по цели (самолёт)':0.1,
        }

metadict_detail['-Вероятность поражения цели ракетой (планёр)'] = {
        '-Стрельба днём по цели (планёр)':0.7,
        '-Стрельба ночью по цели (планёр)':0.3,
        }

#----
# Огонь прямой наводкой (распределение по типам боевых действий):

metadict_detail['-Стрельба днём по цели (боец)'] = {
        '-Стрельба днём по цели (боец) (встречный бой)':0.2,
        '-Стрельба днём по цели (боец) (наступление)':0.4,
        '-Стрельба днём по цели (боец) (оборона)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (боец)'] = {
        '-Стрельба ночью по цели (боец) (встречный бой)':0.2,
        '-Стрельба ночью по цели (боец) (наступление)':0.4,
        '-Стрельба ночью по цели (боец) (оборона)':0.4,
        }

metadict_detail['-Стрельба днём по цели (танк)'] = {
        '-Стрельба днём по цели (танк) (встречный бой)':0.2,
        '-Стрельба днём по цели (танк) (наступление)':0.4,
        '-Стрельба днём по цели (танк) (оборона)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (танк)'] = {
        '-Стрельба ночью по цели (танк) (встречный бой)':0.2,
        '-Стрельба ночью по цели (танк) (наступление)':0.4,
        '-Стрельба ночью по цели (танк) (оборона)':0.4,
        }

metadict_detail['-Стрельба днём по цели (ББМ)'] = {
        '-Стрельба днём по цели (ББМ) (встречный бой)':0.2,
        '-Стрельба днём по цели (ББМ) (наступление)':0.4,
        '-Стрельба днём по цели (ББМ) (оборона)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (ББМ)'] = {
        '-Стрельба ночью по цели (ББМ) (встречный бой)':0.2,
        '-Стрельба ночью по цели (ББМ) (наступление)':0.4,
        '-Стрельба ночью по цели (ББМ) (оборона)':0.4,
        }

metadict_detail['-Стрельба днём по цели (пегас)'] = {
        '-Стрельба днём по цели (пегас) (встречный бой)':0.2,
        '-Стрельба днём по цели (пегас) (наступление)':0.4,
        '-Стрельба днём по цели (пегас) (оборона)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (пегас)'] = {
        '-Стрельба ночью по цели (пегас) (встречный бой)':0.2,
        '-Стрельба ночью по цели (пегас) (наступление)':0.4,
        '-Стрельба ночью по цели (пегас) (оборона)':0.4,
        }

metadict_detail['-Стрельба днём по цели (самолёт)'] = {
        '-Стрельба днём по цели (самолёт) (наступление)':0.2,
        '-Стрельба днём по цели (самолёт) (оборона)':0.4,
        '-Стрельба днём по цели (самолёт) (марш)':0.4,
        }

metadict_detail['-Стрельба днём по цели (планёр)'] = {
        '-Стрельба днём по цели (планёр) (наступление)':0.2,
        '-Стрельба днём по цели (планёр) (оборона)':0.4,
        '-Стрельба днём по цели (планёр) (марш)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (самолёт)'] = {
        '-Стрельба ночью по цели (самолёт) (наступление)':0.2,
        '-Стрельба ночью по цели (самолёт) (оборона)':0.4,
        '-Стрельба ночью по цели (самолёт) (марш)':0.4,
        }

metadict_detail['-Стрельба ночью по цели (планёр)'] = {
        '-Стрельба ночью по цели (планёр) (наступление)':0.2,
        '-Стрельба ночью по цели (планёр) (оборона)':0.4,
        '-Стрельба ночью по цели (планёр) (марш)':0.4,
        }


#----
# Огонь прямой наводкой (ввод коэффициентов условной обстановки):

metadict_detail['-Стрельба днём по цели (ББМ) (встречный бой)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.4,
        }

metadict_detail['-Стрельба днём по цели (ББМ) (наступление)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (ББМ) (оборона)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.6,
        }

metadict_detail['-Стрельба днём по цели (боец) (встречный бой)'] = {
        '-Стрельба по цели (боец)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (боец) (наступление)'] = {
        '-Стрельба по цели (боец)':1 * 0.1,
        }

metadict_detail['-Стрельба днём по цели (боец) (оборона)'] = {
        '-Стрельба по цели (боец)':1 * 0.3,
        }

metadict_detail['-Стрельба днём по цели (пегас) (встречный бой)'] = {
        '-Стрельба по цели (пегас)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (пегас) (наступление)'] = {
        '-Стрельба по цели (пегас)':1 * 0.1,
        }

metadict_detail['-Стрельба днём по цели (пегас) (оборона)'] = {
        '-Стрельба по цели (пегас)':1 * 0.3,
        }

metadict_detail['-Стрельба днём по цели (самолёт) (марш)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.1,
        }

metadict_detail['-Стрельба днём по цели (самолёт) (наступление)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.3,
        }

metadict_detail['-Стрельба днём по цели (самолёт) (оборона)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (планёр) (марш)'] = {
        '-Стрельба по цели (планёр)':1 * 0.1,
        }

metadict_detail['-Стрельба днём по цели (планёр) (наступление)'] = {
        '-Стрельба по цели (планёр)':1 * 0.3,
        }

metadict_detail['-Стрельба днём по цели (планёр) (оборона)'] = {
        '-Стрельба по цели (планёр)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (танк) (встречный бой)'] = {
        '-Стрельба по цели (танк)':1 * 0.4,
        }

metadict_detail['-Стрельба днём по цели (танк) (наступление)'] = {
        '-Стрельба по цели (танк)':1 * 0.2,
        }

metadict_detail['-Стрельба днём по цели (танк) (оборона)'] = {
        '-Стрельба по цели (танк)':1 * 0.6,
        }

metadict_detail['-Стрельба ночью по цели (ББМ) (встречный бой)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.2,
        }

metadict_detail['-Стрельба ночью по цели (ББМ) (наступление)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (ББМ) (оборона)'] = {
        '-Стрельба по цели (ББМ)':1 * 0.3,
        }

metadict_detail['-Стрельба ночью по цели (боец) (встречный бой)'] = {
        '-Стрельба по цели (боец)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (боец) (наступление)'] = {
        '-Стрельба по цели (боец)':1 * 0.05,
        }

metadict_detail['-Стрельба ночью по цели (боец) (оборона)'] = {
        '-Стрельба по цели (боец)':1 * 0.15,
        }

metadict_detail['-Стрельба ночью по цели (пегас) (встречный бой)'] = {
        '-Стрельба по цели (пегас)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (пегас) (наступление)'] = {
        '-Стрельба по цели (пегас)':1 * 0.05,
        }

metadict_detail['-Стрельба ночью по цели (пегас) (оборона)'] = {
        '-Стрельба по цели (пегас)':1 * 0.15,
        }

metadict_detail['-Стрельба ночью по цели (самолёт) (марш)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.05,
        }

metadict_detail['-Стрельба ночью по цели (самолёт) (наступление)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.15,
        }

metadict_detail['-Стрельба ночью по цели (самолёт) (оборона)'] = {
        '-Стрельба по цели (самолёт)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (планёр) (марш)'] = {
        '-Стрельба по цели (планёр)':1 * 0.05,
        }

metadict_detail['-Стрельба ночью по цели (планёр) (наступление)'] = {
        '-Стрельба по цели (планёр)':1 * 0.15,
        }

metadict_detail['-Стрельба ночью по цели (планёр) (оборона)'] = {
        '-Стрельба по цели (планёр)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (танк) (встречный бой)'] = {
        '-Стрельба по цели (танк)':1 * 0.2,
        }

metadict_detail['-Стрельба ночью по цели (танк) (наступление)'] = {
        '-Стрельба по цели (танк)':1 * 0.1,
        }

metadict_detail['-Стрельба ночью по цели (танк) (оборона)'] = {
        '-Стрельба по цели (танк)':1 * 0.3,
        }

#----
# Огонь прямой наводкой (распределение огня в бою):

metadict_detail['-Стрельба по цели (ББМ)'] = {
        '-Прямой подавляющий огонь':0.7,
        '-Прямой огонь по бронетехнике':0.2,
        '-Прямой огонь по пехоте':0.1 * 3,
        }

metadict_detail['-Стрельба по цели (боец)'] = {
        '-Прямой подавляющий огонь':0.99,
        '-Прямой огонь по пехоте':0.01,
        }

metadict_detail['-Стрельба по цели (танк)'] = {
        '-Прямой огонь по танкам':0.7,
        '-Прямой огонь по бронетехнике':0.3 * 3,
        }

metadict_detail['-Стрельба по цели (пегас)'] = {
        '-Зенитный огонь по пегасам':1,
        }

metadict_detail['-Стрельба по цели (самолёт)'] = {
        '-Ракетный огонь по самолётам':1,
        }

metadict_detail['-Стрельба по цели (планёр)'] = {
        '-Ракетный огонь по планёрам':1,
        }

#----
# Навесной огонь (ввод коэффициентов построения):
# http://armor.kiev.ua/wiki/index.php?title=Теория_вероятностей_в_артиллерии._Часть_1._Разрушение_одиночной_ДЗОТ

metadict_detail['-Радиус поражения пехоты осколками (метров)'] = {
        # Радиус поражения, это 20% вероятность попадания осколка в цель 1.08 кв.метра:
        # http://saper.isnet.ru/mines-2/razlet-osk.html
        # Расстояние между бойцам в стрелковой цепи -- 8 метров.
        '-Вероятность поражения цели осколками (боец)':1/8,
        }

metadict_detail['-Радиус поражения бронетехники осколками (метров)'] = {
        # "О роли артиллерии в борьбе с бронецелями" Виктор Мураховский:
        # http://otvaga2004.ru/kaleydoskop/kaleydoskop-art/artillerii-v-borbe-s-br/
        # Расстояние между танками в боевом строю -- 100 метров.
        '-Вероятность поражения цели осколками (танк)':1/100,
        }

#----
# Навесной огонь (распределение по времени суток):

metadict_detail['-Вероятность поражения цели осколками (боец)'] = {
        '-Навесной огонь днём по цели (боец)':0.9,
        '-Навесной огонь ночью по цели (боец)':0.1,
        }

metadict_detail['-Вероятность поражения цели авиабомбой (боец)'] = {
        '-Навесной огонь днём по цели (боец)':0.9,
        '-Навесной огонь ночью по цели (боец)':0.1,
        }

metadict_detail['-Вероятность поражения цели осколками (танк)'] = {
        '-Навесной огонь днём по цели (танк)':0.9,
        '-Навесной огонь ночью по цели (танк)':0.1,
        }

metadict_detail['-Вероятность поражения цели авиабомбой (танк)'] = {
        '-Навесной огонь днём по цели (танк)':0.9,
        '-Навесной огонь ночью по цели (танк)':0.1,
        }

#----
# Огонь прямой наводкой (распределение по типам боевых действий):

metadict_detail['-Навесной огонь днём по цели (боец)'] = {
        '-Навесной огонь днём по цели (боец) (встречный бой)':0.2,
        '-Навесной огонь днём по цели (боец) (наступление)':0.4,
        '-Навесной огонь днём по цели (боец) (оборона)':0.4,
        }

metadict_detail['-Навесной огонь ночью по цели (боец)'] = {
        '-Навесной огонь ночью по цели (боец) (встречный бой)':0.2,
        '-Навесной огонь ночью по цели (боец) (наступление)':0.4,
        '-Навесной огонь ночью по цели (боец) (оборона)':0.4,
        }

metadict_detail['-Навесной огонь днём по цели (танк)'] = {
        '-Навесной огонь днём по цели (танк) (встречный бой)':0.2,
        '-Навесной огонь днём по цели (танк) (наступление)':0.4,
        '-Навесной огонь днём по цели (танк) (оборона)':0.4,
        }

metadict_detail['-Навесной огонь ночью по цели (танк)'] = {
        '-Навесной огонь ночью по цели (танк) (встречный бой)':0.2,
        '-Навесной огонь ночью по цели (танк) (наступление)':0.4,
        '-Навесной огонь ночью по цели (танк) (оборона)':0.4,
        }

#----
# Навесной огонь (ввод коэффициентов условной обстановки):

metadict_detail['-Навесной огонь днём по цели (боец) (встречный бой)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.2,
        }

metadict_detail['-Навесной огонь днём по цели (боец) (наступление)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.1,
        }

metadict_detail['-Навесной огонь днём по цели (боец) (оборона)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.3,
        }

metadict_detail['-Навесной огонь днём по цели (танк) (встречный бой)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.4,
        }

metadict_detail['-Навесной огонь днём по цели (танк) (наступление)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.2,
        }

metadict_detail['-Навесной огонь днём по цели (танк) (оборона)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.6,
        }

metadict_detail['-Навесной огонь ночью по цели (боец) (встречный бой)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.1,
        }

metadict_detail['-Навесной огонь ночью по цели (боец) (наступление)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.05,
        }

metadict_detail['-Навесной огонь ночью по цели (боец) (оборона)'] = {
        '-Навесной огонь по цели (боец)':1 * 0.15,
        }

metadict_detail['-Навесной огонь ночью по цели (танк) (встречный бой)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.2,
        }

metadict_detail['-Навесной огонь ночью по цели (танк) (наступление)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.1,
        }

metadict_detail['-Навесной огонь ночью по цели (танк) (оборона)'] = {
        '-Навесной огонь по цели (танк)':1 * 0.3,
        }

#----
# Навесной огонь (распределение огня в бою):

metadict_detail['-Навесной огонь по цели (танк)'] = {
        '-Навесной подавляющий огонь':0.7,
        '-Навесной огонь по бронетехнике':0.2,
        '-Навесной огонь по танкам':0.1,
        }

metadict_detail['-Навесной огонь по цели (боец)'] = {
        '-Навесной подавляющий огонь':0.9,
        '-Навесной огонь по пехоте':0.1,
        }

#----
# Артиллерия (распределение огня в бою)

metadict_detail['-Расчётный боеприпас (РБ)'] = {
        '--Боекомплект (РБ)':1,
        '-Боеприпасы (РБ) (стрельба)':1,
        }

metadict_detail['-Боеприпасы (РБ) (стрельба)'] = {
        # Лишь 20% вероятных позиций противника являются истинными.
        # Лишь 10% огня артиллерии совпадает по времени (с АСУ "Манёвр" 40%).
        '-Боеприпасы (РБ) (накрытие)':0.2 * 0.4,
        }

metadict_detail['-Боеприпасы (РБ) (накрытие)'] = {
        # Уточнить.
        # Распределение целей в работе артиллерийского дивизиона:
        '-Огонь артиллерии по противнику в боевом порядке (РБ)':0.2,
        '-Огонь артиллерии по противнику на подготовленных позициях (РБ)':0.6,
        '-Огонь артиллерии по противнику на марше (РБ)':0.2,
        }

metadict_detail['-Огонь артиллерии по противнику в боевом порядке (РБ)'] = {
        '-Огонь артиллерии по взводу мотострелков в боевом порядке (РБ)':0.4,
        '-Огонь артиллерии по взводу танков в боевом порядке (РБ)':0.6,
        }

metadict_detail['-Огонь артиллерии по противнику на подготовленных позициях (РБ)'] = {
        '-Огонь артиллерии по огневому взводу на подготовленных позициях (РБ)':0.1,
        '-Огонь артиллерии по взводу обеспечения на подготовленных позициях (РБ)':0.2,
        '-Огонь артиллерии по взводу мотострелков на подготовленных позициях (РБ)':0.4,
        '-Огонь артиллерии по взводу танков на подготовленных позициях (РБ)':0.3,
        }

metadict_detail['-Огонь артиллерии по противнику на марше (РБ)'] = {
        '-Огонь артиллерии по батарее САУ на марше (РБ)':0.2,
        '-Огонь артиллерии по роте обеспечения на марше (РБ)':0.4,
        '-Огонь артиллерии по роте мотострелков на марше (РБ)':0.2,
        '-Огонь артиллерии по роте танков на марше (РБ)':0.2,
        }

#----
# Артиллерия (нормы огня на подавление):

metadict_detail['-Огонь артиллерии по батарее САУ на марше (РБ)'] = {
        'Батарея САУ на марше (подавление)':1/330,
        }

metadict_detail['-Огонь артиллерии по взводу мотострелков в боевом порядке (РБ)'] = {
        'Мотострелковый взвод в боевом порядке (подавление)':1/1090,
        }

metadict_detail['-Огонь артиллерии по взводу мотострелков на подготовленных позициях (РБ)'] = {
        'Мотострелковый взвод на подготовленных позициях (подавление)':1/690,
        }

metadict_detail['-Огонь артиллерии по взводу обеспечения на подготовленных позициях (РБ)'] = {
        'Взвод обеспечения на подготовленных позициях (подавление)':1/360,
        }

metadict_detail['-Огонь артиллерии по взводу танков в боевом порядке (РБ)'] = {
        'Взвод танков в боевом порядке (подавление)':1/1100,
        }

metadict_detail['-Огонь артиллерии по взводу танков на подготовленных позициях (РБ)'] = {
        'Взвод танков на подготовленных позициях (подавление)':1/690,
        }

metadict_detail['-Огонь артиллерии по огневому взводу на подготовленных позициях (РБ)'] = {
        'Огневой взвод на подготовленных позициях (подавление)':1/340,
        }

metadict_detail['-Огонь артиллерии по роте мотострелков на марше (РБ)'] = {
        'Мотострелковая рота на марше (подавление)':1/220,
        }

metadict_detail['-Огонь артиллерии по роте обеспечения на марше (РБ)'] = {
        'Рота обеспечения на марше (подавление)':1/220,
        }

metadict_detail['-Огонь артиллерии по роте танков на марше (РБ)'] = {
        'Танковая рота на марше (подавление)':1/660,
        }

#----
# Артиллерия (подавление, уничтожение целей):

metadict_detail['Батарея САУ на марше (подавление)'] = {
        # Подавление, это гибель или ранение 30% личного состава и повреждение техники.
        '-Артиллерийский огонь по бронетехнике':8 * 0.3,
        '-Артиллерийский огонь по пехоте':45 * 0.3,
        }

metadict_detail['Взвод обеспечения на подготовленных позициях (подавление)'] = {
        '-Артиллерийский огонь по пехоте':33 * 0.3,
        }

metadict_detail['Взвод танков в боевом порядке (подавление)'] = {
        '-Артиллерийский огонь по танкам':4 * 0.3,
        }

metadict_detail['Взвод танков на подготовленных позициях (подавление)'] = {
        '-Артиллерийский огонь по танкам':4 * 0.3,
        }

metadict_detail['Мотострелковая рота на марше (подавление)'] = {
        '-Артиллерийский огонь по пехоте':114 * 0.3,
        '-Артиллерийский огонь по бронетехнике':10 * 0.3,
        }

metadict_detail['Мотострелковый взвод в боевом порядке (подавление)'] = {
        '-Артиллерийский огонь по пехоте':35 * 0.3,
        '-Артиллерийский огонь по бронетехнике':3 * 0.3,
        }

metadict_detail['Мотострелковый взвод на подготовленных позициях (подавление)'] = {
        '-Артиллерийский огонь по пехоте':35 * 0.3,
        '-Артиллерийский огонь по бронетехнике':3 * 0.3,
        }

metadict_detail['Огневой взвод на подготовленных позициях (подавление)'] = {
        '-Артиллерийский огонь по пехоте':13 * 0.3,
        '-Артиллерийский огонь по бронетехнике':3 * 0.3,
        }

metadict_detail['Рота обеспечения на марше (подавление)'] = {
        '-Артиллерийский огонь по пехоте':114 * 0.3,
        }

metadict_detail['Танковая рота на марше (подавление)'] = {
        '-Артиллерийский огонь по пехоте':33 * 0.3,
        '-Артиллерийский огонь по танкам':10 * 0.3,
        }

#----
# Возможности боекомплекта:

metadict_detail['-Артиллерийский огонь по бронетехнике'] = {
        '-Боекомплект (артиллерией по бронетехнике)':1,
        }

metadict_detail['-Артиллерийский огонь по пехоте'] = {
        '-Боекомплект (артиллерией по пехоте)':1,
        }

metadict_detail['-Артиллерийский огонь по танкам'] = {
        '-Боекомплект (артиллерией по танкам)':1,
        }

metadict_detail['-Навесной огонь по бронетехнике'] = {
        '-Боекомплект (навесным огнём по бронетехнике)':1,
        }

metadict_detail['-Навесной огонь по пехоте'] = {
        '-Боекомплект (навесным огнём по пехоте)':1,
        }

metadict_detail['-Навесной огонь по танкам'] = {
        '-Боекомплект (навесным огнём по танкам)':1,
        }

metadict_detail['-Прямой огонь по бронетехнике'] = {
        '-Боекомплект (прямым огнём по бронетехнике)':1,
        }

metadict_detail['-Прямой огонь по пехоте'] = {
        '-Боекомплект (прямым огнём по пехоте)':1,
        }

metadict_detail['-Прямой огонь по танкам'] = {
        '-Боекомплект (прямым огнём по танкам)':1,
        }

metadict_detail['-Зенитный огонь по пегасам'] = {
        '-Боекомплект (зенитным огнём по пегасам)':1,
        }

metadict_detail['-Ракетный огонь по самолётам'] = {
        '-Боекомплект (ракетами по самолётам)':1,
        }

metadict_detail['-Ракетный огонь по планёрам'] = {
        '-Боекомплект (зенитным огнём по пегасам)':1,
        #'-Боекомплект (ракетами по планёрам)':1,
        }

#----
# Возможности боекомплекта (подавляющий огонь):

metadict_detail['-Прямой подавляющий огонь'] = {
        }

metadict_detail['-Навесной подавляющий огонь'] = {
        }

#----
# Возможности оружия:

metadict_detail['-Расчётное огневое средство (РОС)'] = {
        # Плотность артиллерии в наступлениях второй мировой -- 200 орудий/километр
        '--Фронт огневого вала (метров)':5,
        '--Артиллерия (РОС)':1,
        }

metadict_detail['-Заградительный огонь (метров фронта)'] = {
        # Осколки от взрывов снарядов приравниваются к огню стрелкового оружия:
        '--Полоса обороны в один эшелон (5 пуль/минуту на метр)':1,
        '--Полоса наступления в один эшелон (20 пуль/минуту на метр)':0.5,
        '--Фронт заградительного огня (метров)':1,
        }

metadict_detail['-Боевая скорострельность (выстрелов/минуту)'] = {
        '--Полоса обороны в один эшелон (5 пуль/минуту на метр)':0.2,
        '--Полоса наступления в один эшелон (20 пуль/минуту на метр)':0.05,
        }

metadict_detail['--Полоса обороны в один эшелон (5 пуль/минуту на метр)'] = {
        # С учётом 33% потерь от артиллерийского огня, либо такого же резерва в полку/дивизии.
        '--Фронт в обороне (5 пуль/минуту на метр)':0.66,
        }

metadict_detail['--Полоса наступления в один эшелон (20 пуль/минуту на метр)'] = {
        '--Фронт в наступлении (20 пуль/минуту на метр)':0.66,
        }

#----
# Масса, компиляция:

metadict_detail['-Допустимая масса боеприпасов (тонн)'] = {
        '--Боекомплект (тонн)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

metadict_detail['-Допустимая масса вооружения (тонн)'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

metadict_detail['-Допустимая масса экипировки (тонн)'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

#metadict_detail['-Допустимая масса техники (тонн)'] = {
#        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':1,
#        }

#metadict_detail['-Допустимая масса деталей (тонн)'] = {
#        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':1,
#        }

metadict_detail['-Допустимая масса оборудования (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

#----
# Стоимость, компиляция:

metadict_detail['-Допустимая стоимость боеприпасов ($)'] = {
        '---Стоимость боеприпасов (оценочно)':1,
        }

metadict_detail['-Допустимая стоимость вооружения ($)'] = {
        '---Стоимость вооружения (оценочно)':1,
        }

metadict_detail['-Допустимая стоимость оборудования ($)'] = {
        '---Стоимость вооружения (оценочно)':1,
        }

metadict_detail['-Допустимая стоимость техники ($)'] = {
        '---Стоимость вооружения (оценочно)':1,
        }

metadict_detail['-Допустимая стоимость экипировки ($)'] = {
        '---Стоимость вооружения (оценочно)':1,
        }

#----
# Грузоподъёмность, упрощение:

metadict_detail['-Место под боеприпасы (тонн)'] = {
        '--Боеприпасов (тонн)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

metadict_detail['-Место под зенитные ракеты (тонн)'] = {
        '--Боеприпасов (тонн)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

metadict_detail['-Место под взрывчатку и мины (тонн)'] = {
        '--Боеприпасов (тонн)':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':1,
        }

metadict_detail['-Место под лёгкую технику (тонн)'] = {
        }

metadict_detail['-Место под тяжёлую технику (тонн)'] = {
        }

metadict_detail['-Место под жидкое топливо (литры)'] = {
        '-Место под жидкое топливо (тонн)':0.00085,
        }

metadict_detail['-Место под жидкое топливо (тонн)'] = {
        '-Потенциальная энергия биодизеля (МДж)':43000,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Потенциальная энергия биодизеля (МДж)'] = {
        '--Запас энергии (МДж)':0.5,
        }

metadict_detail['-Место под уголь (тонн)'] = {
        '-Потенциальная энергия угля (МДж)':22000,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Потенциальная энергия угля (МДж)'] = {
        '--Запас энергии (МДж)':0.25,
        }

metadict_detail['-Место под маховики (тонн)'] = {
        '-Потенциальная энергия маховиков (МДж)':10000,
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Потенциальная энергия маховиков (МДж)'] = {
        '--Запас энергии (МДж)':0.95,
        }

metadict_detail['-Место под продовольствие (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Место под воду (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Место под снаряжение (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Место под стройматериалы (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

metadict_detail['-Строительные материалы (тонн)'] = {
        '-КУНГи, прицепы, расходники, инструменты (тонн)':1,
        }

#----
# Вывод грузов в космос:

metadict_detail['-Полезная нагрузка (низкая опорная орбита) (тонн)'] = {
        'Ракета-носитель':0.05,
        }

metadict_detail['-Полезная нагрузка (геопереходная орбита) (тонн)'] = {
        'Ракета-носитель':0.2,
        }

metadict_detail['-Полезная нагрузка (геостационарная орбита) (тонн)'] = {
        'Ракета-носитель':0.3,
        }

#----
# Ремонтные работы, упрощение:

metadict_detail['-Ремонт и обработка высокопрочных тканей (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

metadict_detail['-Ремонт и обработка металлических изделий (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

metadict_detail['-Ремонт и сборка механизмов (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

metadict_detail['-Ремонт и обслуживание ДВС (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

metadict_detail['-Ремонт и обслуживание авиатехники (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

metadict_detail['-Ремонт и обслуживание автотехники (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

metadict_detail['-Ремонт и обслуживание маховиков (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

metadict_detail['-Ремонт и обслуживание оптической электроники (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

metadict_detail['-Ремонт и обслуживание радиотехники (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

metadict_detail['-Ремонт и обслуживание тяжёлого оружия (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

metadict_detail['-Ремонт и обслуживание электротехники (часов/день)'] = {
        '-Ремонт и обслуживание машин/оружия (часов/день)':1,
        }

#----
# Личный состав (стоимость жизни):

metadict_detail['Генерал'] = {
        # Стоимость жизни солдата, это не только страховка, но и потери для экономики государства:
        # https://ru.wikipedia.org/wiki/Стоимость_человеческой_жизни
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':10000000,
        }

metadict_detail['Генерал (единорог)'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':10000000,
        }

metadict_detail['Генерал (пегас)'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':10000000,
        }

metadict_detail['Полковник'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':8000000,
        }

metadict_detail['Полковник (единорог)'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':8000000,
        }

metadict_detail['Полковник (пегас)'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':8000000,
        }

metadict_detail['Майор'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':5000000,
        }

metadict_detail['Майор (единорог)'] = {
        '-Офицеры':1,
        '---Расовый состав (единороги)':1,
        '---Стоимость жизни (оценочно)':5000000,
        }

metadict_detail['Майор (пегас)'] = {
        '-Офицеры':1,
        '---Расовый состав (пегасы)':1,
        '---Стоимость жизни (оценочно)':5000000,
        }

metadict_detail['Капитан'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':3000000,
        }

metadict_detail['Капитан (единорог)'] = {
        '-Офицеры':1,
        '---Расовый состав (единороги)':1,
        '---Стоимость жизни (оценочно)':3000000,
        }

metadict_detail['Капитан (пегас)'] = {
        '-Офицеры':1,
        '---Расовый состав (пегасы)':1,
        '---Стоимость жизни (оценочно)':3000000,
        }

metadict_detail['Лейтенант'] = {
        '-Офицеры':1,
        '---Стоимость жизни (оценочно)':2000000,
        }

metadict_detail['Лейтенант (единорог)'] = {
        '-Офицеры':1,
        '---Расовый состав (единороги)':1,
        '---Стоимость жизни (оценочно)':2000000,
        }

metadict_detail['Лейтенант (пегас)'] = {
        '-Офицеры':1,
        '---Расовый состав (пегасы)':1,
        '---Стоимость жизни (оценочно)':2000000,
        }

metadict_detail['Сержант'] = {
        '-Контрактники':1,
        '---Стоимость жизни (оценочно)':1000000,
        }

metadict_detail['Сержант (единорог)'] = {
        '-Контрактники':1,
        '---Расовый состав (единороги)':1,
        '---Стоимость жизни (оценочно)':1000000,
        }

metadict_detail['Сержант (пегас)'] = {
        '-Контрактники':1,
        '---Расовый состав (пегасы)':1,
        '---Стоимость жизни (оценочно)':1000000,
        }

metadict_detail['Рядовой'] = {
        '-Срочники':1,
        '---Стоимость жизни (оценочно)':500000,
        }

metadict_detail['Рядовой (единорог)'] = {
        '-Срочники':1,
        '---Расовый состав (единороги)':1,
        '---Стоимость жизни (оценочно)':500000,
        }

metadict_detail['Рядовой (пегас)'] = {
        '-Срочники':1,
        '---Расовый состав (пегасы)':1,
        '---Стоимость жизни (оценочно)':500000,
        }

#----
# Личный состав (потребности, численность):

metadict_detail['-Офицеры'] = {
        '---Личный состав (суммарно)':1,
        '---Личный состав (офицеры)':1,
        'Комплект повседневной экипировки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.07,
        '-Требуется еды в день (тонн)':0.003,
        '-Требуется воды в день (тонн)':0.03,
        }

metadict_detail['-Контрактники'] = {
        '---Личный состав (суммарно)':1,
        '---Личный состав (сержанты)':1,
        'Комплект повседневной экипировки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.07,
        '-Требуется еды в день (тонн)':0.003,
        '-Требуется воды в день (тонн)':0.03,
        }

metadict_detail['-Срочники'] = {
        '---Личный состав (суммарно)':1,
        'Комплект повседневной экипировки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.07,
        '-Требуется еды в день (тонн)':0.003,
        '-Требуется воды в день (тонн)':0.03,
        }

#----
# Стоимость отряда (для экономики государства):

metadict_detail['---Стоимость жизни (оценочно)'] = {
        '---Стоимость отряда':1,
        }

metadict_detail['---Стоимость боеприпасов (оценочно)'] = {
        '---Стоимость отряда':1,
        '---Стоимость боекомплекта':1,
        }

metadict_detail['---Стоимость вооружения (оценочно)'] = {
        '---Стоимость отряда':1,
        '---Стоимость вооружения':1,
        }

#----
# Коррекция величин:

metadict_detail['--Запас энергии (МДж)'] = {
        '--Запас энергии (мегаджоулей)':1,
        }

metadict_detail['--Потребление энергии (кВт)'] = {
        '--Потребление энергии (МВт)':0.001,
        }

metadict_detail['--Потребление энергии (МВт)'] = {
        '--Потребление энергии (мегаджоулей/час)':3600,
        }

metadict_detail['--Производство энергии (кВт)'] = {
        '--Производство энергии (МВт)':0.001,
        }

metadict_detail['--Производство энергии (МВт)'] = {
        '--Производство энергии (мегаватт-час)':3600,
        }

metadict_detail['---Стоимость боекомплекта'] = {
        '---Стоимость боекомплекта (млн)':0.000001,
        }

metadict_detail['---Стоимость вооружения'] = {
        '---Стоимость вооружения (млн)':0.000001,
        }

metadict_detail['---Стоимость отряда'] = {
        '---Стоимость отряда (млн)':0.000001,
        }

metadict_detail['---Стоимость проекта'] = {
        '---Стоимость проекта (млн)':0.000001,
        }

metadict_detail['---Ожидаемые расходы'] = {
        '---Ожидаемые расходы (млн)':0.000001,
        }







#metadict_detail['-Грузовики, бронетехника, тяжёлое оружие (тонн)'] = {
#        '-Грузовики, бронетехника, тяжёлое оружие (килограмм)':1000,
#        }
#
#metadict_detail['-КУНГи, прицепы, расходники, инструменты (тонн)'] = {
#        '-КУНГи, прицепы, расходники, инструменты (килограмм)':1000,
#        }
#
#metadict_detail['-Оружие, боеприпасы, экипировка, солдаты (тонн)'] = {
#        '-Оружие, боеприпасы, экипировка, солдаты (килограмм)':1000,
#        }



#metadict_detail['---Стоимость вооружения (млн)'] = {
#        '---Стоимость вооружения ($)':1000000,
#        }
#
#metadict_detail['---Стоимость боекомплекта (млн)'] = {
#        '---Стоимость боекомплекта ($)':1000000,
#        }

#----
# Убираем лишнее:

metadict_detail['-Допустимые габариты техники (кубометров)'] = {
        }

metadict_detail['-Объём груза (кубометров)'] = {
        }

metadict_detail['-Объём доступный (кубометров)'] = {
        }

metadict_detail['-Объём используемый (кубометров)'] = {
        #'-Объём используемый (литров)':1000,
        }

metadict_detail['-Управление батальонами (часов/день)'] = {
        }

metadict_detail['-Управление ротами (часов/день)'] = {
        }

metadict_detail['-Управление взводами (часов/день)'] = {
        }

metadict_detail['-Управление отделениями (часов/день)'] = {
        }
