#----
# Боевые модули, шасси, оборудование бронетехники:

metadict_detail['Шасси ОБТ'] = {
        'Ходовая часть ОБТ':1,
        'Трансмиссия ОБТ':1,
        'Двигатель ОБТ':1,
        }

metadict_detail['Шасси БМП'] = {
        'Ходовая часть БМП':1,
        'Трансмиссия БМП':1,
        'Двигатель БМП':1,
        }

metadict_detail['Шасси БМД'] = {
        'Ходовая часть БМД':1,
        'Трансмиссия БМД':1,
        'Двигатель БМД':1,
        }

metadict_detail['Шасси БТР'] = {
        'Ходовая часть БТР':1,
        'Трансмиссия БТР':1,
        'Двигатель военного грузовика':1,
        }

metadict_detail['Шасси военного грузовика'] = {
        'Ходовая часть военного грузовика':1,
        'Трансмиссия военного грузовика':1,
        'Двигатель военного грузовика':1,
        }

metadict_detail['Корпус ОБТ'] = {
        # Длина корпуса -- 6.6 метра; ширина -- 2 метра; высота -- 1 метр; коэффициент полноты -- 90%
        'Бронирование корпуса ОБТ':1,
        'Внутренние системы бронетехники':1,
        'Навесное оборудование бронетехники':1,
        '-Объём доступный (кубометров)':12,
        }

metadict_detail['Корпус БМП'] = {
        'Бронирование корпуса БМП':1,
        'Внутренние системы бронетехники':1,
        'Навесное оборудование бронетехники':1,
        '-Объём доступный (кубометров)':12,
        }

metadict_detail['Корпус БТР'] = {
        'Бронирование корпуса БТР':1,
        'Внутренние системы бронетехники':1,
        'Навесное оборудование бронетехники':1,
        '-Объём доступный (кубометров)':12,
        }

metadict_detail['Корпус военного грузовика'] = {
        'Кабина военного грузовика':1,
        'Платформа военного грузовика':1,
        }

metadict_detail['Боевой модуль ОБТ'] = {
        'Броневая башня ОБТ':1,
        'Система постановки аэрозольных завес':1,
        '120-мм гладкоствольная танковая пушка':1,
        'Туррель зенитного пулемёта':1,
        'Единый пулемёт танковый':1,
        }

metadict_detail['Боевой модуль БМП'] = {
        'Броневая башня БМП':1,
        'Система постановки аэрозольных завес':1,
        'Пусковая установка противотанковых ракет':1,
        '24-мм нарезная автоматическая пушка':1,
        'Единый пулемёт танковый':1,
        }

metadict_detail['Боевой модуль БТР'] = {
        'Броневая башня БТР':1,
        'Система постановки аэрозольных завес':1,
        'Возимый 40-мм автоматический гранатомёт':1,
        'Туррель крупнокалиберного пулемёта':1,
        }

metadict_detail['Боевой модуль БМД'] = {
        'Броневая башня БМД':1,
        'Система постановки аэрозольных завес':1,
        'Пусковая установка противотанковых ракет':1,
        'Туррель крупнокалиберного пулемёта':1,
        }

metadict_detail['Боевой модуль 120-мм САУ'] = {
        'Броневая башня САУ':1,
        'Ствол 120-мм гаубицы':1,
        'Система постановки аэрозольных завес':1,
        'Единый пулемёт танковый':1,
        '-Допустимая стоимость оборудования ($)':1000000,
        }

metadict_detail['Боевой модуль 150-мм САУ'] = {
        'Броневая башня САУ':1,
        'Ствол 150-мм гаубицы':1,
        'Система постановки аэрозольных завес':1,
        'Единый пулемёт танковый':1,
        '-Допустимая стоимость оборудования ($)':2000000,
        }

metadict_detail['Боевой модуль ЗРК ближнего действия'] = {
        'Оборудование РЛС ЗРК ближнего действия':1,
        'Пусковая установка зенитных ракет ближнего действия':1,
        '-Допустимая стоимость оборудования ($)':3000000,
        }

metadict_detail['Боевой модуль ЗРК малой дальности'] = {
        'Оборудование РЛС ЗРК малкой дальности':1,
        'Пусковая установка зенитных ракет малой дальности':1,
        '-Допустимая стоимость оборудования ($)':6000000,
        }

metadict_detail['Боевой модуль ЗРК средней дальности'] = {
        'Оборудование РЛС ЗРК средней дальности':1,
        'Пусковая установка зенитных ракет средней дальности':1,
        '-Допустимая стоимость оборудования ($)':10000000,
        }

metadict_detail['Боевой модуль сторожевого робота'] = {
        'Стрелково-гранатомётный комплекс':1,
        'Выстрелы 40x46-мм ГП (запасные)':20,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        '-Допустимая стоимость оборудования ($)':100000,
        }

metadict_detail['Электрооборудование и средства связи ОБТ'] = {
        'Приборы наблюдения и наведения ОБТ':1,
        'Информационно-управляющая система':1,
        'Танковая система управления огнём':1,
        'Танковое переговорное устройство':1,
        }

metadict_detail['Электрооборудование и средства связи БМП'] = {
        'Приборы наблюдения и наведения ОБТ':1,
        'Информационно-управляющая система':1,
        'Танковая система управления огнём':1,
        }

metadict_detail['Электрооборудование и средства связи БТР'] = {
        'Приборы наблюдения и наведения БТР':1,
        'Танковое переговорное устройство':1,
        'УКВ-радиостанция возимая':1,
        }

metadict_detail['Лазерная система активной защиты'] = {
        'Станция ближней разведки танковая':1,
        'Система перенаправления лазерного луча':1,
        'Электролазерная пушка танковая':1,
        }

#----
# Системы боевых машины, группировка по назначению:

metadict_detail['Внутренние системы бронетехники'] = {
        'Танковая система защиты от оружия массового поражения':1,
        'Танковая система кондиционирования':1,
        'Танковая система пожаротушения':1,
        }

metadict_detail['Навесное оборудование бронетехники'] = {
        'Маскировочный комплект танка':1,
        'Танковая система защиты от напалма':1,
        'Оборудование подводного вождения танка':1,
        'Оборудование для самоокапывания':1,
        }

metadict_detail['Бронирование корпуса ОБТ'] = {
        # За основу взял ронирование Т-62:
        # http://btvt.narod.ru/4/t-62/t62.htm
        'Верхняя лобовая деталь корпуса ОБТ':1,
        'Нижняя лобовая деталь корпуса ОБТ':1,
        'Бортовая бронеплита корпуса ОБТ':2,
        'Верхний кормовой бронелист корпуса ОБТ':1,
        'Нижний кормовой бронелист корпуса ОБТ':1,
        'Передний бронелист крыши корпуса ОБТ':1,
        'Задний бронелист крыши корпуса ОБТ':1,
        'Днище корпуса ОБТ':1,
        'Динамическая защита корпуса ОБТ':1,
        '--Устойчивость к подавлению (в наступлении, РБ)':300,
        '--Устойчивость к подавлению (в окопах, РБ)':200,
        '--Устойчивость к подавлению (на марше, РБ)':150,
        }

metadict_detail['Верхняя лобовая деталь корпуса ОБТ'] = {
        # http://btvt.narod.ru/4/armor.htm
        # Комбинированная броня: 80-мм лист стали, два 50-мм листа стеклопластика, 20-мм лист стали.
        # Ширина корпуса -- 2 метра, длина плиты -- 1.2 метра, толщина -- 200 мм (наклон 68 градусов)
        'Броневая сталь (кубометров)':2 * 1.2 * (0.08 + 0.02),
        'Броневой стеклопластик (кубометров)':2 * 1.2 * (0.05 * 2),
        }

metadict_detail['Нижняя лобовая деталь корпуса ОБТ'] = {
        # Комбинированная броня: 80-мм лист стали, два 50-мм листа стеклопластика, 20-мм лист стали.
        # Ширина корпуса -- 2 метра, длина плиты -- 0.5 метра, толщина -- 200 мм (наклон 60 градусов)
        'Броневая сталь (кубометров)':2 * 0.5 * (0.08 + 0.02),
        'Броневой стеклопластик (кубометров)':2 * 0.5 * (0.05 * 2),
        }

metadict_detail['Бортовая бронеплита корпуса ОБТ'] = {
        # Длина корпуса -- 6.6 метра, высота корпуса -- 1 метр, толщина -- 80 мм (вертикально)
        'Броневая сталь (кубометров)':6.6 * 1 * 0.08,
        }

metadict_detail['Верхний кормовой бронелист корпуса ОБТ'] = {
        # Ширина корпуса -- 2 метра, длина плиты -- 0.6 метра, толщина -- 45 мм (вертикально)
        'Броневая сталь (кубометров)':2 * 0.6 * 0.045,
        }

metadict_detail['Нижний кормовой бронелист корпуса ОБТ'] = {
        # Ширина корпуса -- 2 метра, длина плиты -- 0.6 метра, толщина -- 16 мм (наклон 70 градусов)
        'Броневая сталь (кубометров)':2 * 0.6 * 0.016,
        }

metadict_detail['Передний бронелист крыши корпуса ОБТ'] = {
        # Длина крыши до отсека МТО -- 3 метра, ширина корпуса -- 2 метра,
        # Радиус выреза башни -- 0.9 метра, толщина крыши -- 30 мм (горизонтально)
        'Броневая сталь (кубометров)':(3 * 2 - (3.14159265 * 0.9 ** 2)) * 0.03,
        }

metadict_detail['Задний бронелист крыши корпуса ОБТ'] = {
        # Длина крыши МТО -- 3.6 метра, ширина корпуса -- 2 метра, толщина -- 16 мм (наклон 10 градусов)
        'Броневая сталь (кубометров)':3.6 * 2 * 0.016,
        }

metadict_detail['Днище корпуса ОБТ'] = {
        # Длина днища -- 5.8 метров, ширина корпуса -- 2 метра, толщина -- 20 мм (горизонтально)
        'Броневая сталь (кубометров)':5.8 * 2 * 0.02,
        }

metadict_detail['Бронирование корпуса БМП'] = {
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        'Комбинированная танковая броня (тонн)':12,
        'Динамическая защита корпуса ОБТ':1,
        }

metadict_detail['Бронирование корпуса БТР'] = {
        '--Устойчивость к подавлению (в наступлении, РБ)':200,
        '--Устойчивость к подавлению (в окопах, РБ)':100,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        'Керамическая броня боевых машин (квадратные дециметры)':4000,
        }

metadict_detail['Кабина военного грузовика'] = {
        'Броневая сталь (килограмм)':1000,
        '-Объём доступный (кубометров)':4,
        }

metadict_detail['Платформа военного грузовика'] = {
        'Броневая сталь (килограмм)':1000,
        }

metadict_detail['Динамическая защита корпуса ОБТ'] = {
        'Секция динамической защиты':18,
        }

metadict_detail['Танковая система защиты от напалма'] = {
        # Должна быть частью противопожарной системы.
        }

metadict_detail['Танковая система защиты от оружия массового поражения'] = {
        'Танковое электромеханическое оборудование (килограмм)':30,
        'Танковый прибор радиационной и химической разведки':1,
        'Танковая фильтровентиляционная установка':1,
        }

metadict_detail['Танковая система пожаротушения'] = {
        'Танковое электромеханическое оборудование (килограмм)':2,
        'Танковые гидроприводы (метры)':20,
        'Баллон огнегасящей смеси':4,
        'Термодатчики':7,
        }

metadict_detail['Ходовая часть ОБТ'] = {
        # http://btvt.narod.ru/4/t-62/x-ch.jpg
        'Гусеничная лента ОБТ':2,
        'Комплект катков ОБТ':1,
        'Подвеска ОБТ':1,
        }

metadict_detail['Ходовая часть БМП'] = {
        'Танковые детали (килограмм)':3000,
        'Танковые механические устройства (килограмм)':300,
        }

metadict_detail['Ходовая часть БМД'] = {
        'Водомётный движитель БТР':2,
        'Танковые детали (килограмм)':1700,
        'Танковые механические устройства (килограмм)':300,
        }

metadict_detail['Ходовая часть БТР'] = {
        'Водомётный движитель БТР':2,
        'Комплект колёс БТР':1,
        'Подвеска БТР':1,
        }

metadict_detail['Ходовая часть военного грузовика'] = {
        'Комплект колёс военного грузовика':1,
        'Подвеска военного грузовика':1,
        }

metadict_detail['Трансмиссия ОБТ'] = {
        'Бортовой фрикцион ОБТ':2,
        'Бортовая коробка передач ОБТ':2,
        'Бак машинного масла (20 литров)':2,
        'Входной редуктор ОБТ':2,
        'Главный фрикцион ОБТ':1,
        'Карданный вал ОБТ':1,
        '--Потребление энергии (кВт)':800,
        }

metadict_detail['Трансмиссия БМП'] = {
        'Танковые механические устройства (килограмм)':1000,
        '--Потребление энергии (кВт)':400,
        }

metadict_detail['Трансмиссия БМД'] = {
        'Танковые механические устройства (килограмм)':500,
        '--Потребление энергии (кВт)':200,
        }

metadict_detail['Трансмиссия БТР'] = {
        'Танковые механические устройства (килограмм)':500,
        '--Потребление энергии (кВт)':200,
        }

metadict_detail['Трансмиссия военного грузовика'] = {
        'Танковые механические устройства (килограмм)':500,
        '--Потребление энергии (кВт)':200,
        }

metadict_detail['Двигатель ОБТ'] = {
        'Вариатор танкового маховика':1,
        'Танковый маховик':6,
        }

metadict_detail['Двигатель БМП'] = {
        'Вариатор среднего маховика':1,
        'Ленточный супермаховик (килограмм)':2000,
        }

metadict_detail['Двигатель БМД'] = {
        'Вариатор среднего маховика':1,
        'Ленточный супермаховик (килограмм)':1000,
        }

metadict_detail['Двигатель военного грузовика'] = {
        'Вариатор лёгкого маховика':1,
        'Ленточный супермаховик (килограмм)':1000,
        }

metadict_detail['Вариатор танкового маховика'] = {
        '-Объём используемый (кубометров)':1,
        '-Допустимая масса деталей (тонн)':0.5,
        '-Допустимая стоимость оборудования ($)':30000,
        }

metadict_detail['Вариатор среднего маховика'] = {
        '-Объём используемый (кубометров)':0.3,
        '-Допустимая масса деталей (тонн)':0.3,
        '-Допустимая стоимость оборудования ($)':20000,
        }

metadict_detail['Вариатор лёгкого маховика'] = {
        '-Объём используемый (кубометров)':0.15,
        '-Допустимая масса деталей (тонн)':0.2,
        '-Допустимая стоимость оборудования ($)':15000,
        }

metadict_model['Танковый маховик'] = {
        # Диаметр -- 1.8 метра; высота -- 0.18 метра.
        'Корпус танкового маховика':1,
        'Диск танкового маховика':1,
        'Магнитный подвес танкового маховика':1,
        '-Объём используемый (кубометров)':3.14159265 * 0.9 ** 2 * 0.18,
        }

metadict_model['Корпус танкового маховика'] = {
        # Диаметр -- 1.8 метра; высота -- 0.18 метра; толщина -- 5 мм.
        'Броневой углепластик (кубометров)':2 * 3.14159265 * 0.9 * (0.18 + 0.9) * 0.005,
        }

metadict_model['Диск танкового маховика'] = {
        # Диск из графеновой бумаги с сердцевиной из никель-титанового сплава.
        # Диаметр -- 1.8 метра; высота -- 0.18 метра; коэффициент полноты -- 0.75 (диск равной прочности).
        'Ленточный супермаховик (кубометров)':(3.14159265 * 0.9 ** 2 * 0.18) * 0.75,
        'Нитинол (кубометров)':3.14159265 * 0.25 ** 2 * 0.16,
        }

metadict_detail['Броневая башня ОБТ'] = {
        # Усечённая сфера, радиус -- 0.9 метра, высота -- 0.8 метра
        'Бронирование башни ОБТ':1,
        'Механизм заряжания танковой пушки':1,
        'Система стабилизации танковой пушки':1,
        'Поворотный механизм башни':1,
        '-Объём доступный (кубометров)':1.2,
        }

metadict_detail['Броневая башня САУ'] = {
        'Бронирование башни САУ':1,
        'Механизм заряжания танковой пушки':1,
        'Поворотный механизм башни':1,
        '-Объём доступный (кубометров)':8,
        }

metadict_detail['Броневая башня БМП'] = {
        'Бронирование башни БМП':1,
        'Система стабилизации танковой пушки':1,
        'Поворотный механизм башни':1,
        '-Объём доступный (кубометров)':2,
        }

metadict_detail['Броневая башня БТР'] = {
        'Бронирование башни БТР':1,
        '-Объём доступный (кубометров)':0.5,
        }

metadict_detail['Бронирование башни ОБТ'] = {
        # Литая стальная башня со вставками алюминия:
        'Лобовая часть литой башни ОБТ':1,
        'Бортовая часть литой башни ОБТ':1,
        'Динамическая защита башни ОБТ':1,
        }

metadict_detail['Лобовая часть литой башни ОБТ'] = {
        # Радиус башни -- 0.9 метров, высота -- 0.8 метра.
        # Комбинированная броня: 90 мм сталь + 150 мм алюминий + 90 мм сталь.
        # https://www.fxyz.ru/формулы_по_геометрии/формулы_объема/объем_шарового_сегмента/
        'Броневая сталь (кубометров)':(3.14159265 * 0.8 ** 2 * (0.9 - 1 / 3 * 0.8) - 3.14159265 * 0.71 ** 2 * (0.81 - 1 / 3 * 0.71)) / 2,
        'Броневой алюминий (кубометров)':(3.14159265 * 0.8 ** 2 * (0.9 - 1 / 3 * 0.8) - 3.14159265 * 0.55 ** 2 * (0.65 - 1 / 3 * 0.55)) / 2,
        }

metadict_detail['Бортовая часть литой башни ОБТ'] = {
        # Радиус башни -- 0.9 метров, высота -- 0.8 метра, толщина брони -- 65 мм.
        # https://www.fxyz.ru/формулы_по_геометрии/формулы_объема/объем_шарового_сегмента/
        'Броневая сталь (кубометров)':(3.14159265 * 0.8 ** 2 * (0.9 - 1 / 3 * 0.8) - 3.14159265 * 0.735 ** 2 * (0.835 - 1 / 3 * 0.735)) / 2,
        }

metadict_detail['Бронирование башни БМП'] = {
        'Комбинированная танковая броня (тонн)':2,
        'Динамическая защита башни ОБТ':1,
        }

metadict_detail['Бронирование башни БТР'] = {
        'Керамическая броня боевых машин (квадратные дециметры)':150,
        }

metadict_detail['Динамическая защита башни ОБТ'] = {
        'Секция динамической защиты':8,
        }

metadict_detail['Система стабилизации танковой пушки'] = {
        '-Допустимая масса деталей (тонн)':0.5,
        '-Допустимая стоимость оборудования ($)':200000,
        }

metadict_detail['Механизм заряжания танковой пушки'] = {
        '-Допустимая масса деталей (тонн)':0.5,
        '-Допустимая стоимость оборудования ($)':100000,
        }

metadict_detail['Поворотный механизм башни'] = {
        '-Допустимая масса деталей (тонн)':0.5,
        '-Допустимая стоимость оборудования ($)':50000,
        }

metadict_detail['Танковая система активной защиты'] = {
        'Комплекс оптико-электронного подавления':1,
        'Система постановки аэрозольных завес':1,
        }

metadict_detail['Туррель зенитного пулемёта'] = {
        'Зенитный 12-мм танковый пулемёт':1,
        'Приводы управления туррелью':1,
        }

metadict_detail['Туррель крупнокалиберного пулемёта'] = {
        'Крупнокалиберный 15-мм танковый пулемёт':1,
        'Единый пулемёт танковый':1,
        'Приводы управления туррелью':1,
        }

metadict_detail['Приводы управления туррелью'] = {
        '-Допустимая масса деталей (тонн)':0.05,
        '-Допустимая стоимость оборудования ($)':5000,
        }

metadict_detail['Комплекс оптико-электронного подавления'] = {
        'Датчики обнаружения лазерного излучения':4,
        'Инфракрасные прожекторы':2,
        }

metadict_detail['Система постановки аэрозольных завес'] = {
        # http://www.inetres.com/gp/military/cv/weapon/launchers.html
        '80-мм мортира системы аэрозольных завес':12,
        }

metadict_detail['Датчики обнаружения лазерного излучения'] = {
        '-Допустимая масса деталей (тонн)':0.001,
        '-Допустимая стоимость оборудования ($)':1000,
        }

metadict_detail['Инфракрасные прожекторы'] = {
        '-Допустимая масса деталей (тонн)':0.05,
        '-Допустимая стоимость оборудования ($)':3000,
        }

metadict_detail['Система перенаправления лазерного луча'] = {
        '-Допустимая масса деталей (тонн)':0.05,
        '-Допустимая стоимость оборудования ($)':50000,
        }

metadict_detail['Информационно-управляющая система'] = {
        'Оптические компьютеры (терминалы)':1,
        'Танковая навигационная аппаратура':1,
        'УКВ-радиостанция возимая':1,
        'КВ-радиостанция возимая':1,
        '-Допустимая масса деталей (тонн)':0.03,
        '-Допустимая стоимость оборудования ($)':500000,
        }

metadict_detail['Приборы наблюдения и наведения ОБТ'] = {
        'Прицел-дальномер прибор наведения':1,
        'Прицельно-наблюдательный комплекс командира':1,
        'Приборы наблюдения механика-водителя':1,
        }

metadict_detail['Приборы наблюдения и наведения БТР'] = {
        'Перископический прицел':2,
        'Перископический прибор наблюдения':6,
        'Активно-пассивный прибор ночного видения':2,
        }

metadict_detail['Прицел-дальномер прибор наведения'] = {
        'Перископический прицел':1,
        'Танковый лазерный дальномер':1,
        'Тепловизионный перископический ночной прицел':1,
        }

metadict_detail['Перископический прицел'] = {
        '-Допустимая масса деталей (тонн)':0.01,
        '-Допустимая стоимость оборудования ($)':5000,
        }

metadict_detail['Танковый лазерный дальномер'] = {
        '-Допустимая масса деталей (тонн)':0.01,
        '--Потребление энергии (кВт)':0.1,
        '-Допустимая стоимость оборудования ($)':20000,
        }

metadict_detail['Тепловизионный перископический ночной прицел'] = {
        'Охлаждаемая тепловизионная матрица':1,
        '-Допустимая масса деталей (тонн)':0.06,
        '--Потребление энергии (кВт)':1,
        '-Допустимая стоимость оборудования ($)':100000,
        }

metadict_detail['Прицельно-наблюдательный комплекс командира'] = {
        'Перископический прицел':1,
        'Танковый лазерный дальномер':1,
        'Тепловизионный перископический ночной прицел':1,
        }

metadict_detail['Приборы наблюдения механика-водителя'] = {
        'Перископический прибор наблюдения':3,
        'Активно-пассивный прибор ночного видения':1,
        }

metadict_detail['Перископический прибор наблюдения'] = {
        '-Допустимая масса деталей (тонн)':0.01,
        '-Допустимая стоимость оборудования ($)':500,
        }

metadict_detail['Активно-пассивный прибор ночного видения'] = {
        '-Допустимая масса деталей (тонн)':0.002,
        '-Допустимая стоимость оборудования ($)':5000,
        }

metadict_detail['Танковая система управления огнём'] = {
        'Цифровой баллистический вычислитель':1,
        'Телевизионная система кругового обзора':1,
        'Комплект автоматических датчиков условий стрельбы':1,
        }

metadict_detail['Цифровой баллистический вычислитель'] = {
        'Оптические компьютеры (терминалы)':1,
        '-Допустимая масса деталей (тонн)':0.02,
        '-Допустимая стоимость оборудования ($)':500000,
        }

metadict_detail['Телевизионная система кругового обзора'] = {
        '-Допустимая масса деталей (тонн)':0.05,
        '-Допустимая стоимость оборудования ($)':50000,
        }

metadict_detail['Комплект автоматических датчиков условий стрельбы'] = {
        '-Допустимая масса деталей (тонн)':0.02,
        '-Допустимая стоимость оборудования ($)':20000,
        }

metadict_detail['Танковая навигационная аппаратура'] = {
        '-Допустимая масса деталей (тонн)':0.01,
        '-Допустимая стоимость оборудования ($)':10000,
        }

metadict_detail['Авиагоризонт'] = {
        '-Допустимая масса деталей (тонн)':0.01,
        '-Допустимая стоимость оборудования ($)':10000,
        }

metadict_detail['Речной широкозахватный миноискатель'] = {
        '-Допустимая масса деталей (тонн)':0.05,
        '-Допустимая стоимость оборудования ($)':20000,
        }

metadict_detail['Танковое переговорное устройство'] = {
        'Ларингофон':4,
        '-Допустимая масса деталей (тонн)':0.03,
        '-Допустимая стоимость оборудования ($)':1000,
        }

metadict_detail['Маскировочный комплект танка'] = {
        'Маскировочная ткань (квадратные дециметры)':4000,
        '-Допустимая масса деталей (тонн)':0.5,
        '-Допустимая стоимость оборудования ($)':20000,
        }

metadict_detail['Танковая система кондиционирования'] = {
        '-Допустимая масса деталей (тонн)':0.03,
        '--Потребление энергии (кВт)':3,
        '-Допустимая стоимость оборудования ($)':30000,
        }

metadict_detail['Станция ближней разведки танковая'] = {
        'Оптические компьютеры (терминалы)':1,
        '-Допустимая масса деталей (тонн)':0.2,
        '--Потребление энергии (кВт)':1,
        '-Допустимая стоимость оборудования ($)':500000,
        }

#----
# Компоненты возимых орудий:

metadict_detail['Устройство 120-мм гаубицы'] = {
        'Ствол 120-мм гаубицы':1,
        'Лафет гаубицы':1,
        'Противооткатные устройства гаубицы':1,
        'Прицельные устройства гаубицы':1,
        }

metadict_detail['Устройство 150-мм гаубицы'] = {
        'Ствол 150-мм гаубицы':1,
        'Лафет гаубицы':1,
        'Противооткатные устройства гаубицы':1,
        'Прицельные устройства гаубицы':1,
        }

metadict_detail['Лафет гаубицы'] = {
        'Люлька гаубицы':1,
        'Верхний станок гаубицы':1,
        'Боевой щит гаубицы':1,
        'Колёсный ход гаубицы':1,
        'Механизм подрессоривания гаубицы':1,
        'Нижний станок гаубицы':1,
        'Уравновешивающий механизм гаубицы':1,
        'Приводы вертикальной наводки':1,
        'Приводы горизонтальной наводки':1,
        'Механизм крепления орудия по-походному':1,


        '--Устойчивость к подавлению (в наступлении, РБ)':100,
        '--Устойчивость к подавлению (в окопах, РБ)':50,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        }

metadict_detail['Противооткатные устройства гаубицы'] = {
        'Гидропневматический накатник':1,
        'Гидравлический тормоз откатных частей':1,
        }

metadict_detail['Прицельные устройства гаубицы'] = {
        'Панорамный прицел гаубицы':1,
        'Телескопический прицел гаубицы':1,
        }

