#----
# Специализированные комплекты снаряжения:

metadict_detail['Комплект силовой брони оперативника'] = {
        'Комплект силовой брони (базовый)':1,
        }

metadict_detail['Комплект боевой экипировки командира'] = {
        'Комплект боевой экипировки (базовый)':1,
        'Носимый терминал с дисплеем':1,
        }

metadict_detail['Комплект боевой экипировки сержанта'] = {
        'Комплект боевой экипировки (базовый)':1,
        'Носимый терминал упрощённый':1,
        }

metadict_detail['Комплект боевой экипировки гренадера'] = {
        'Комплект боевой экипировки (базовый)':1,
        'Носимый терминал упрощённый':1,
        'Портативная телекамера':2,
        'Телевизионный прицел':1,
        }

metadict_detail['Комплект боевой экипировки солдата'] = {
        'Комплект боевой экипировки (базовый)':1,
        }

#----
# Базовые комплекты снаряжения:
    # Размеры пони:
    # Рост в холке -- 60 сантиметров
    # Длина передних ног -- 37.5 см (до перехода в грудь, если смотреть спереди)
    # Длина задних ног до сустава -- 35 см
    # Диаметр копытца -- 12.5 см
    # Длина тела (от хвоста до груди) -- 45 см
    # Ширина головы -- 36 см (от скулы до скулы)
    # Площадь тела средней пони -- 1.71 кв. метра
    # Объём тела средней пони -- 0.0623 куб. метра

metadict_detail['Комплект силовой брони (базовый)'] = {
        'Экзоскелет силовой брони':1,
        'Средства индивидуальной защиты силовой брони':1,
        'Средства связи, разведки и навигации силовой брони':1,
        'Модульное грузовое снаряжение боевой экипировки':1,
        'Средства жизнеобеспечения боевой экипировки':1,
        '|-Производство комплектов силовой брони (выпущено штук)':1,
        '--Устойчивость к подавлению (в наступлении, РБ)':100,
        '--Устойчивость к подавлению (в окопах, РБ)':50,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '-Допустимая масса экипировки (тонн)':0.15,
        '-Допустимая стоимость экипировки ($)':200000,
        }

metadict_detail['Радиационно-защитный костюм'] = {
        '|-Производство радиационно-защитных костюмов (выпущено штук)':1,
        '-Допустимая масса экипировки (тонн)':0.03,
        '-Допустимая стоимость экипировки ($)':100000,
        }

metadict_detail['Водолазный костюм'] = {
        '|-Производство водолазных костюмов (выпущено штук)':1,
        '-Допустимая масса экипировки (тонн)':0.03,
        '-Допустимая стоимость экипировки ($)':30000,
        }

metadict_detail['Комплект боевой экипировки (базовый)'] = {
        'Средства индивидуальной защиты боевой экипировки':1,
        'Средства связи, разведки и навигации боевой экипировки':1,
        'Модульное грузовое снаряжение боевой экипировки':1,
        'Средства жизнеобеспечения боевой экипировки':1,
        '|-Производство комплектов боевой экипировки (выпущено штук)':1,
        '--Устойчивость к подавлению (в наступлении, РБ)':15,
        '--Устойчивость к подавлению (в окопах, РБ)':10,
        '--Устойчивость к подавлению (на марше, РБ)':1,
        '-Допустимая масса экипировки (тонн)':0.025,
        '-Допустимая стоимость экипировки ($)':20000,
        }

metadict_detail['Комплект повседневной экипировки'] = {
        'Униформа и средства защиты повседневной экипировки':1,
        'Средства связи, разведки и навигации повседневной экипировки':1,
        'Грузовое снаряжение повседневной экипировки':1,
        'Средства жизнеобеспечения повседневной экипировки':1,
        '|-Производство комплектов повседневной экипировки (выпущено штук)':1,
        '-Допустимая масса экипировки (тонн)':0.025,
        '-Допустимая стоимость экипировки ($)':2000,
        }

#----
# Части снаряжения:

metadict_detail['Средства индивидуальной защиты боевой экипировки'] = {
        'Бронежилет шестого класса защиты':1,
        'Противоосколочный комбинезон':1,
        'Шлем второго класса защиты':1,
        }

metadict_detail['Средства связи, разведки и навигации боевой экипировки'] = {
        'Наушная система управления боевой экипировкой':1,
        'УКВ-радиостанция малогабаритная':1,
        'Универсальный источник питания':1,
        'Бинокль переменной кратности':1,
        'Монокуляр ночного видения':1,
        }

metadict_detail['Модульное грузовое снаряжение боевой экипировки'] = {
        'Наспинное крепление для оружия':1,
        'Разгрузочный жилет':1,
        '5-литровые патронные сумки':2,
        }

metadict_detail['Средства жизнеобеспечения боевой экипировки'] = {
        'Индивидуальная аптечка боевая':1,
        'Индивидуальный водяной фильтр':1,
        'Маскировочный комплект пехотинца':1,
        'Питьевая система':1,
        }

metadict_detail['Средства индивидуальной защиты силовой брони'] = {
        'Бронекостюм шестого класса защиты':1,
        'Система фильтрации воздуха':1,
        'Система кондиционирования':1,
        'Противохимическая защита':1,
        'Амортизирующий комбинезон':1,
        'Шлем шестого класса защиты':1,
        }

metadict_detail['Экзоскелет силовой брони'] = {
        # Экзоскелет даёт около 5 киловатт (если вес бойца 300 кг, это 16.7 Ватт/кг)
        # (6 Ватт/килограмм -- мощность лошади-тяжеловоза, 13 Ватт/кг мощность танка)
        # Скорость галопа на пересечённой местности до 60 км/час.
        'Каркас экзоскелета':1,
        'Двигатель экзоскелета':1,
        'Гидравлическая система экзоскелета':1,
        'Система сервоприводов экзоскелета':1,
        'Наспинный боевой модуль силовой брони':1,
        'Система обратной связи экзоскелета':1,
        }

metadict_detail['Средства связи, разведки и навигации силовой брони'] = {
        'Наушная система управления боевой экипировкой':1,
        'Коллиматорная оптическая проекционная система':1,
        'Пехотная система управления огнём':1,
        'Индивидуальный комплекс разведки':1,
        'УКВ-радиостанция малогабаритная':1,
        'Активные наушники':1,
        }

metadict_detail['Униформа и средства защиты повседневной экипировки'] = {
        'Комплект парадной униформы':1,
        'Комплект летней повседневной униформы':1,
        'Комплект зимней повседневной униформы':1,
        'Комплект защиты от ОМП':1,
        'Пассивные наушники':1,
        }

metadict_detail['Средства связи, разведки и навигации повседневной экипировки'] = {
        'Стробоскопический фонарь':1,
        'Бинокль':1,
        'Компас':1,
        'Часы':1,
        }

metadict_detail['Грузовое снаряжение повседневной экипировки'] = {
        '60-литровый рюкзак':1,
        '10-литровые перемётные сумки':2,
        }

metadict_detail['Средства жизнеобеспечения повседневной экипировки'] = {
        'Индивидуальная аптечка повседневная':1,
        'Упаковка влажных салфеток':1,
        'Теплоизолирующий коврик':1,
        'Многофункциональный нож':1,
        'Малая пехотная лопатка':1,
        'Палатка одноместная':1,
        'Непромокаемый плащ':1,
        'Комплект выживания':1,
        'Армейский котелок':1,
        'Спальник':1,
        }

#----
# Комплексные элементы снаряжения:

metadict_detail['Бронежилет шестого класса защиты'] = {
        'Противоосколочный воротник':1,
        'Резиновые наколенники':4,
        'Прорезиненные накопытники':4,
        'Нагрудная 200x200-мм керамическая бронепластина':1,
        'Боковые 100x100-мм керамические бронепластины':6,
        }

metadict_detail['Индивидуальный комплекс разведки'] = {
        'Монокуляр ночного видения':2,
        'Портативная телекамера':2,
        'Телевизионный прицел':1,
        'Бинокль переменной кратности':1,
        'Лидар':1,
        }

metadict_detail['Индивидуальная аптечка боевая'] = {
        'Управляемый инжектор лекарственных средств':1,
        'Стандартный набор лекарственных средств':1,
        'Индивидуальный противохимический пакет':4,
        'Индивидуальный перевязочный пакет':4,
        'Жгут кровоостанавливающий':2,
        'Назофарингеальная трубка':1,
        }

metadict_detail['Индивидуальная аптечка повседневная'] = {
        'Индивидуальный набор лекарственных средств':1,
        'Индивидуальный противохимический пакет':4,
        'Индивидуальный перевязочный пакет':4,
        'Жгут кровоостанавливающий':1,
        }

#----
# Наборы лекарственных средств:

metadict_detail['Стандартный набор лекарственных средств'] = {
        'Шприц-тюбик антидота ФОВ':1,
        'Шприц-тюбик обезболивающего средства':1,
        'Шприц-тюбик психостимулирющего средства':1,
        'Шприц-тюбик антирадиационного средства':1,
        'Шприц-тюбик заживляющего средства':1,
        }

metadict_detail['Индивидуальный набор лекарственных средств'] = {
        'Таблетки радиозащитного средства':1,
        'Таблетки противорвотного средства':1,
        'Таблетки антибактериального средства':1,
        'Таблетки психостимулирющего средства':1,
        }

#----
# Средства связи и обработки данных:
# Перенеси в части экипировки, или к оборудованию.

metadict_detail['УКВ-радиостанция малогабаритная'] = {
        # https://ru.wikipedia.org/wiki/Р-147
        # Дальность связи с однотипной станцией — до 1 км.
        'Ларингофон':1,
        'Наушники радиостанции':1,
        'Компоненты малогабаритной радиостанции':1,
        '--Потребление энергии (кВт)':0.001,
        }

metadict_detail['Носимый терминал с дисплеем'] = {
        'Оптические компьютеры (терминалы)':1,
        'Ленточный супермаховик малогабаритный (килограмм)':0.2,
        '--Потребление энергии (кВт)':0.02,
        '-Допустимая масса экипировки (тонн)':0.002,
        '-Допустимая стоимость экипировки ($)':10000,
        }

metadict_detail['Носимый терминал упрощённый'] = {
        'Оптические компьютеры (терминалы)':1,
        'Ленточный супермаховик малогабаритный (килограмм)':0.2,
        '--Потребление энергии (кВт)':0.02,
        '-Допустимая масса экипировки (тонн)':0.002,
        '-Допустимая стоимость экипировки ($)':5000,
        }
