#----
# Вооружение:

metadict_detail['Переносной зенитный ракетный комплекс'] = {
        'Переносные зенитные ракетные комплексы':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.005,
        '--Противовоздушные возможности (по вертолётам)':0.315,
        '--Противовоздушные возможности (по самолётам)':0.1,
        'Зенитные ракеты ПЗРК':1,
        'wpn_cost':25000,
        }

metadict_detail['Переносной противотанковый ракетный комплекс'] = {
        'Переносные противотанковые ракетные комплексы':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.015,
        '--Противотанковые возможности (в обороне)':1.75,
        '--Противотанковые возможности (в наступлении)':0.4,
        '--Противотанковые возможности (во встречном бою)':1.5,
        'Управляемые ракеты ПТРК':4,
        'wpn_cost':100000,
        }

metadict_detail['Станковый 120-мм миномёт'] = {
        'Станковые 120-мм миномёты':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.15,
        '-Заградительный огонь (метров фронта)':30,
        '--Устойчивость к подавлению (в наступлении, РБ)':100,
        '--Устойчивость к подавлению (в окопах, РБ)':50,
        '--Устойчивость к подавлению (на марше, РБ)':25,
        '--Артиллерия (РОС)':0.5,
        'Миномётные мины 120-мм':30,
        'wpn_cost':20000,
        }

metadict_detail['Станковый автоматический гранатомёт'] = {
        'Станковые автоматические гранатомёты':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.015,
        '-Заградительный огонь (метров фронта)':25,
        '--Устойчивость к подавлению (в наступлении, РБ)':50,
        '--Устойчивость к подавлению (в окопах, РБ)':25,
        '--Устойчивость к подавлению (на марше, РБ)':15,
        'Выстрелы АГС':90,
        'wpn_cost':20000,
        }

metadict_detail['Станковый автоматический гранатомёт (возимый)'] = {
        'Станковые автоматические гранатомёты':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.015,
        '-Заградительный огонь (метров фронта)':25,
        'Короб на 30 выстрелов АГС':13,
        'wpn_cost':20000,
        }

metadict_detail['Станковый крупнокалиберный пулемёт'] = {
        'Станковые крупнокалиберные пулемёты':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.15,
        '-Боевая скорострельность (выстрелов/минуту)':150,
        '--Устойчивость к подавлению (в наступлении, РБ)':50,
        '--Устойчивость к подавлению (в окопах, РБ)':25,
        '--Устойчивость к подавлению (на марше, РБ)':15,
        'Короб на 50 патронов 15x120':5,
        'wpn_cost':20000,
        }

metadict_detail['Крупнокалиберный пулемёт танковый'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.15,
        '-Боевая скорострельность (выстрелов/минуту)':150,
        'Короб на 50 патронов 15x120':10,
        'wpn_cost':20000,
        }

metadict_detail['Зенитный пулемёт танковый'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.05,
        '-Боевая скорострельность (выстрелов/минуту)':150,
        'Короб на 50 патронов 15x120':5,
        'wpn_cost':20000,
        }

metadict_detail['Электромагнитная снайперская пушка'] = {
        'Электромагнитные снайперские пушки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.015,
        '-Боевая скорострельность (выстрелов/минуту)':30,
        'Стреловидные пули':100,
        'Спарк-батареи':100,
        'wpn_cost':50000,
        }

metadict_detail['Единый пулемёт'] = {
        'Единые пулемёты':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.008,
        '-Боевая скорострельность (выстрелов/минуту)':250,
        'Короб на 300 патронов 6x48':2,
        'wpn_cost':4000,
        }

metadict_detail['Единый пулемёт танковый'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.008,
        '-Боевая скорострельность (выстрелов/минуту)':250,
        'Короб на 300 патронов 6x48':7,
        'wpn_cost':4000,
        }

metadict_detail['Стрелково-гранатомётный комплекс'] = {
        'Стрелково-гранатомётные комплексы':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.008,
        '-Боевая скорострельность (выстрелов/минуту)':150,
        '-Заградительный огонь (метров фронта)':5,
        'Магазин на 50 патронов 6x48':8,
        'Выстрелы АГС':10,
        'wpn_cost':10000,
        }

metadict_detail['Автоматический карабин'] = {
        'Автоматические карабины':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.005,
        '-Боевая скорострельность (выстрелов/минуту)':150,
        'Магазин на 50 патронов 6x48':8,
        'wpn_cost':2000,
        }

metadict_detail['Пистолет-пулемёт'] = {
        'Пистолеты-пулемёты':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.003,
        'Магазин на 50 патронов 6x48':4,
        'wpn_cost':1000,
        }

metadict_detail['Реактивный противотанковый гранатомёт'] = {
        'Переносные реактивные гранатомёты':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.003,
        '-Заградительный огонь (метров фронта)':5,
        '--Противотанковые возможности (в обороне)':0.25,
        '--Противотанковые возможности (в наступлении)':0.065,
        '--Противотанковые возможности (во встречном бою)':0.2,
        'Реактивные гранаты':3,
        'wpn_cost':5000,
        }

metadict_detail['Реактивный пехотный огнемёт'] = {
        'Переносные реактивные гранатомёты':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.003,
        '-Заградительный огонь (метров фронта)':25,
        'Реактивные гранаты термобарические':1,
        'wpn_cost':5000,
        }

metadict_detail['Лёгкий пехотный огнемёт'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.012,
        '-Заградительный огонь (метров фронта)':25,
        'Баллоны огнесмеси':3,
        'wpn_cost':5000,
        }

metadict_detail['Электролазерная пушка'] = {
        'Электролазерные пушки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.02,
        '-Боевая скорострельность (выстрелов/минуту)':30,
        'Спарк-батареи':100,
        'wpn_cost':50000,
        }

metadict_detail['Электролазерная пушка танковая'] = {
        'Электролазерные пушки':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.05,
        '-Боевая скорострельность (выстрелов/минуту)':30,
        'Спарк-батареи':200,
        'wpn_cost':50000,
        }

metadict_detail['120-мм гладкоствольная танковая пушка'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':2.4,
        '-Заградительный огонь (метров фронта)':30,
        '--Противотанковые возможности (в обороне)':2,
        '--Противотанковые возможности (в наступлении)':0.4,
        '--Противотанковые возможности (во встречном бою)':1,
        'Подкалиберные снаряды 120-мм':20,
        'Осколочно-фугасные снаряды 120-мм':20,
        'wpn_cost':200000,
        }

metadict_detail['90-мм мортира системы аэрозольных завес'] = {
        'Аэрозольные гранаты 90-мм':1,
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.01,
        'wpn_cost':500,
        }

metadict_detail['30-мм нарезная автоматическая пушка'] = {
        '-Грузовики, бронетехника, тяжёлое оружие (тонн)':0.11,
        '-Заградительный огонь (метров фронта)':25,
        'Снаряды 30x165 осколочно-фугасные':400,
        'Снаряды 30x165 подкалиберные':100,
        'wpn_cost':50000,
        }

metadict_detail['Пусковая установка противотанковых ракет'] = {
        '-Оружие, боеприпасы, экипировка, солдаты (тонн)':0.15,
        '--Противотанковые возможности (в обороне)':1.75,
        '--Противотанковые возможности (в наступлении)':0.4,
        '--Противотанковые возможности (во встречном бою)':1.5,
        'Управляемые ракеты ПТРК':8,
        'wpn_cost':100000,
        }

#----
# Боеприпасы: патроны, снаряды, ракеты, авиабомбы.

metadict_detail['Наступательные гранаты'] = {
        '-Боеприпасы (тонн)':0.00035,
        'ammo_cost':50,
        }

metadict_detail['Светошумовые гранаты'] = {
        '-Боеприпасы (тонн)':0.00035,
        'ammo_cost':50,
        }

metadict_detail['Дымовые гранаты'] = {
        '-Боеприпасы (тонн)':0.00035,
        'ammo_cost':25,
        }

metadict_detail['Баллоны огнесмеси'] = {
        '-Боеприпасы (тонн)':0.003,
        'ammo_cost':25,
        }

metadict_detail['Короб на 30 выстрелов АГС'] = {
        '-Боеприпасы (тонн)':0.002,
        'ammo_cost':5,
        'Лента на 30 выстрелов АГС':1,
        }

metadict_detail['Лента на 30 выстрелов АГС'] = {
        '-Боеприпасы (тонн)':0.001,
        'ammo_cost':5,
        'Выстрелы АГС':30,
        }

metadict_detail['Выстрелы АГС'] = {
        '-Боеприпасы (тонн)':0.00035,
        'ammo_cost':50,
        }

metadict_detail['Выстрелы АГС (запасные)'] = {
        '-Боеприпасы (тонн)':0.00035,
        'ammo_cost':50,
        }

metadict_detail['Выстрелы АГС (светошумовые)'] = {
        '-Боеприпасы (тонн)':0.00035,
        'ammo_cost':50,
        }

metadict_detail['Выстрелы АГС (дымовые)'] = {
        '-Боеприпасы (тонн)':0.00035,
        'ammo_cost':50,
        }

metadict_detail['Авиационные управляемые ракеты'] = {
        '-Боеприпасы (тонн)':0.6,
        'ammo_cost':250000,
        }

metadict_detail['Управляемые ракеты ПТРК'] = {
        '-Боеприпасы (тонн)':0.007,
        'ammo_cost':25000,
        }

metadict_detail['Зенитные ракеты ПЗРК'] = {
        '-Боеприпасы (тонн)':0.01,
        'ammo_cost':25000,
        }

metadict_detail['Зенитные ракеты малой дальности'] = {
        '-Боеприпасы (тонн)':0.06,
        'ammo_cost':50000,
        }

metadict_detail['Зенитные ракеты средней дальности'] = {
        '-Боеприпасы (тонн)':0.5,
        'ammo_cost':500000,
        }

metadict_detail['Зенитные ракеты большой дальности'] = {
        'Ядерный заряд зенитной ракеты':0.1,
        '-Боеприпасы (тонн)':6,
        'ammo_cost':3000000,
        }

metadict_detail['Стреловидные пули'] = {
        '-Боеприпасы (тонн)':0.00002,
        'ammo_cost':20,
        }

metadict_detail['Спарк-батареи'] = {
        '-Боеприпасы (тонн)':0.00002,
        'ammo_cost':20,
        }

metadict_detail['Магазин на 50 патронов 6x48'] = {
        '-Боеприпасы (тонн)':0.0003,
        'ammo_cost':10,
        'Патроны 6x48':50,
        }

metadict_detail['Короб на 300 патронов 6x48'] = {
        '-Боеприпасы (тонн)':0.001,
        'ammo_cost':5,
        'Лента на 50 патронов 6x48':6,
        }

metadict_detail['Короб на 300 патронов 6x48 (запасной)'] = {
        '-Боеприпасы (тонн)':0.001,
        'ammo_cost':5,
        'Лента на 50 патронов 6x48':6,
        }

metadict_detail['Лента на 50 патронов 6x48'] = {
        '-Боеприпасы (тонн)':0.0001,
        'ammo_cost':1,
        'Патроны 6x48':50,
        }

metadict_detail['Патроны 6x48'] = {
        '-Боеприпасы (тонн)':0.000015,
        'ammo_cost':0.5,
        }

metadict_detail['Короб на 50 патронов 15x120'] = {
        '-Боеприпасы (тонн)':0.001,
        'ammo_cost':5,
        'Лента на 50 патронов 15x120':1,
        }

metadict_detail['Лента на 50 патронов 15x120'] = {
        '-Боеприпасы (тонн)':0.001,
        'ammo_cost':5,
        'Патроны 15x120':50,
        }

metadict_detail['Патроны 15x120'] = {
        '-Боеприпасы (тонн)':0.0002,
        'ammo_cost':10,
        }

metadict_detail['Реактивные гранаты'] = {
        '-Боеприпасы (тонн)':0.003,
        'ammo_cost':500,
        }

metadict_detail['Элемент динамической защиты'] = {
        '-Боеприпасы (тонн)':0.0015,
        'ammo_cost':500,
        }

metadict_detail['Реактивная граната (запасная)'] = {
        '-Боеприпасы (тонн)':0.003,
        'ammo_cost':500,
        }

metadict_detail['Реактивные гранаты термобарические'] = {
        '-Боеприпасы (тонн)':0.006,
        'ammo_cost':1000,
        }

metadict_detail['Стратегические ядерные ракеты'] = {
        'Ядерный заряд стратегической ракеты':6,
        '-Боеприпасы (тонн)':50,
        'ammo_cost':50000000,
        }

metadict_detail['Снаряды 30x165'] = {
        '-Боеприпасы (тонн)':0.00084,
        'ammo_cost':100,
        }

metadict_detail['Снаряды 30x165 осколочно-фугасные'] = {
        '-Боеприпасы (тонн)':0.00084,
        'ammo_cost':100,
        }

metadict_detail['Снаряды 30x165 подкалиберные'] = {
        '-Боеприпасы (тонн)':0.00084,
        'ammo_cost':200,
        }

metadict_detail['Подкалиберные снаряды 120-мм'] = {
        '-Боеприпасы (тонн)':0.025,
        'ammo_cost':10000,
        }

metadict_detail['Аэрозольные гранаты 90-мм'] = {
        '-Боеприпасы (тонн)':0.01,
        'ammo_cost':500,
        }

metadict_detail['Миномётные мины 120-мм'] = {
        '-Боеприпасы (тонн)':0.02,
        '-Боеприпасы (РБ)':0.6,
        'ammo_cost':500,
        }

metadict_detail['Осколочно-фугасные снаряды 120-мм'] = {
        '-Боеприпасы (тонн)':0.025,
        '-Боеприпасы (РБ)':0.7,
        'ammo_cost':500,
        }

metadict_detail['Осколочно-фугасные 150-мм'] = {
        '-Боеприпасы (тонн)':0.05,
        '-Боеприпасы (РБ)':1,
        'ammo_cost':1000,
        }

metadict_detail['Реактивные снаряды 210-мм'] = {
        '-Боеприпасы (тонн)':0.2,
        '-Боеприпасы (РБ)':4,
        'ammo_cost':5000,
        }

metadict_detail['Кассетная авиабомба (100 кг)'] = {
        '-Боеприпасы (тонн)':0.1,
        '-Боеприпасы (РБ)':6,
        'ammo_cost':2500,
        }

metadict_detail['Кассетная авиабомба (250 кг)'] = {
        '-Боеприпасы (тонн)':0.25,
        '-Боеприпасы (РБ)':12,
        'ammo_cost':5000,
        }

metadict_detail['Тактические ракеты'] = {
        '-Боеприпасы (тонн)':2,
        '-Боеприпасы (РБ)':300,
        'ammo_cost':800000,
        }

metadict_detail['Оперативно-тактические ракеты'] = {
        'Ядерный заряд тактической ракеты':1,
        '-Боеприпасы (тонн)':6,
        '-Боеприпасы (РБ)':300,
        'ammo_cost':1000000,
        }

metadict_detail['Ядерный заряд тактической ракеты'] = {
        'Ядерные заряды (25 килотонн)':1,
        '-Боеприпасы (тонн)':0.2,
        '-Боеприпасы (РБ)':2400,
        'ammo_cost':5000000,
        }

metadict_detail['Ядерный заряд зенитной ракеты'] = {
        'Ядерные заряды (25 килотонн)':1,
        '-Боеприпасы (тонн)':0.2,
        '--Противовоздушные возможности (по самолётам)':3,
        'ammo_cost':5000000,
        }

metadict_detail['Ядерный заряд стратегической ракеты'] = {
        'Ядерные заряды (500 килотонн)':1,
        '-Боеприпасы (тонн)':0.2,
        '-Боеприпасы (РБ)':9600,
        'ammo_cost':10000000,
        }
