metadict_detail['Шлем второго класса защиты'] = {
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':15,
        'Конвекционно-амортизационный подпор (квадратные дециметры)':5,
        'Баллистические очки':1,
        }

metadict_detail['Бронекостюм шестого класса защиты'] = {
        # Площадь тела средней пони -- 1.71 кв. метра
        'Бронекерамика шестого класса защиты (квадратные дециметры)':60,
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':60,
        }

metadict_detail['Шлем шестого класса защиты'] = {
        # Ширина головы пони -- 36 см (от скулы до скулы)
        # Коэффициент полноты 0.6
        # Площадь поверхности шлема: 0.47 кв. метра
        'Бронекерамика шестого класса защиты (квадратные дециметры)':30,
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':20,
        }

metadict_detail['Противохимическая защита'] = {
        '-Допустимая масса экипировки (тонн)':0.003,
        '-Допустимая стоимость экипировки ($)':3000,
        }

metadict_detail['Система кондиционирования'] = {
        '-Допустимая масса экипировки (тонн)':0.001,
        '--Потребление энергии (кВт)':0.2,
        '-Допустимая стоимость экипировки ($)':5000,
        }

metadict_detail['Система фильтрации воздуха'] = {
        '-Допустимая масса экипировки (тонн)':0.001,
        '--Потребление энергии (кВт)':0.2,
        '-Допустимая стоимость экипировки ($)':5000,
        }

metadict_detail['Баллистические очки'] = {
        '-Допустимая масса экипировки (тонн)':0.0003,
        '-Допустимая стоимость экипировки ($)':50,
        }

metadict_detail['Противоосколочный комбинезон'] = {
        # Площадь тела средней пони -- 1.71 кв. метра
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':100,
        }

metadict_detail['Амортизирующий комбинезон'] = {
        'Конвекционно-амортизационный подпор (квадратные дециметры)':100,
        }

metadict_detail['Противоосколочный воротник'] = {
        'Баллистическая ткань второго класса защиты (квадратные дециметры)':20,
        }

metadict_detail['Резиновые наколенники'] = {
        '-Допустимая масса экипировки (тонн)':0.0001,
        '-Допустимая стоимость экипировки ($)':30,
        }

metadict_detail['Прорезиненные накопытники'] = {
        '-Допустимая масса экипировки (тонн)':0.0003,
        '-Допустимая стоимость экипировки ($)':50,
        }

metadict_detail['Боковые 100x100-мм керамические бронепластины'] = {
        'Бронекерамика шестого класса защиты (квадратные дециметры)':1,
        'Конвекционно-амортизационный подпор (квадратные дециметры)':1,
        }

metadict_detail['Нагрудная 200x200-мм керамическая бронепластина'] = {
        'Бронекерамика шестого класса защиты (квадратные дециметры)':4,
        'Конвекционно-амортизационный подпор (квадратные дециметры)':4,
        }

metadict_detail['Лидар'] = {
        '-Допустимая масса экипировки (тонн)':0.001,
        '--Потребление энергии (кВт)':0.1,
        '-Допустимая стоимость экипировки ($)':10000,
        }

metadict_detail['Каркас экзоскелета'] = {
        '-Допустимая масса экипировки (тонн)':0.01,
        '-Допустимая стоимость экипировки ($)':2000,
        }

metadict_detail['Двигатель экзоскелета'] = {
        # Почти аналог в мире ДВС "Iron Angel Е200Z":
        # https://samsad.kiev.ua/dvigatel-iron-angel-e200z.html
        'Лёгкий электрогенератор':1,
        'Вариатор переносного маховика':1,
        'Ленточный супермаховик малогабаритный (килограмм)':20,
        }

metadict_detail['Лёгкий электрогенератор'] = {
        '-Допустимая масса экипировки (тонн)':0.0005,
        '--Потребление энергии (кВт)':1,
        '-Допустимая стоимость экипировки ($)':1000,
        }

metadict_detail['Вариатор переносного маховика'] = {
        '-Допустимая масса экипировки (тонн)':0.0005,
        '-Допустимая стоимость экипировки ($)':5000,
        }

metadict_detail['Гидравлическая система экзоскелета'] = {
        # КПД: 0.95*0.9*0.95*0.9=0.73
        'Насосы гидравлической системы':2,
        'Вентиляторы системы охлаждения':2,
        'Гидравлический распределитель':1,
        'Гидравлические приводы':4,
        'Гидравлические цилиндры':16,
        }

metadict_detail['Насосы гидравлической системы'] = {
        # НШ 6-3, мощность 7 кВт, масса 1.5 кг, подача 16.2 л/мин (0.00027 кубометра в секунду)
        # Масляные насосы с потребляемой мощностью в 7 кВт и массой в 1.5 кг.
        # http://www.artr.ru/Gidravlik/Gidravlik_pumps/nsh/gear_sh_nsh_oil.htm
        '-Допустимая масса экипировки (тонн)':0.0015,
        '--Потребление энергии (кВт)':7,
        '-Допустимая стоимость экипировки ($)':1000,
        }

metadict_detail['Вентиляторы системы охлаждения'] = {
        '-Допустимая масса экипировки (тонн)':0.0005,
        '--Потребление энергии (кВт)':0.5,
        '-Допустимая стоимость экипировки ($)':200,
        }

metadict_detail['Гидравлический распределитель'] = {
        '-Допустимая масса экипировки (тонн)':0.0005,
        '-Допустимая стоимость экипировки ($)':500,
        }

metadict_detail['Гидравлические приводы'] = {
        # РВД Ду5 Тип II 0,34 кг/метр, рабочее давление 35 МПа
        # http://ladspb.ru/hydro_hose/gost_6286-73/
        # Допустимая мощность (Объёмный гидроприовод): 0.00027*35000000=9450 Ватт
        # Длина тела (от хвоста до груди) -- 45 см
        # Длина задних ног до сустава -- 35 см
        'Рукав высокого давления (метры)':2,
        }

metadict_detail['Гидравлические цилиндры'] = {
        '-Допустимая масса экипировки (тонн)':0.0002,
        '-Допустимая стоимость экипировки ($)':200,
        }

metadict_detail['Система сервоприводов экзоскелета'] = {
        'Силовые приводы экзоскелета':16,
        }

metadict_detail['Силовые приводы экзоскелета'] = {
        # Дают мощность до 300 Ватт. 
        '-Допустимая масса экипировки (тонн)':0.0002,
        '-Допустимая стоимость экипировки ($)':200,
        }

metadict_detail['Наспинный боевой модуль силовой брони'] = {
        'Силовые приводы экзоскелета':4,
        }

metadict_detail['Система обратной связи экзоскелета'] = {
        'Миодатчики':16,
        'Оптические компьютеры (терминалы)':1,
        '-Допустимая масса экипировки (тонн)':0.002,
        '-Допустимая стоимость экипировки ($)':10000,
        }

metadict_detail['Миодатчики'] = {
        '-Допустимая масса экипировки (тонн)':0.00002,
        '-Допустимая стоимость экипировки ($)':1000,
        }

metadict_detail['Пехотная система управления огнём'] = {
        'Оптические компьютеры (терминалы)':1,
        '-Допустимая масса экипировки (тонн)':0.002,
        '-Допустимая стоимость экипировки ($)':50000,
        }

metadict_detail['Коллиматорная оптическая проекционная система'] = {
        '-Допустимая масса экипировки (тонн)':0.002,
        '-Допустимая стоимость экипировки ($)':5000,
        }

metadict_detail['Наушная система управления боевой экипировкой'] = {
        '-Допустимая масса экипировки (тонн)':0.0003,
        '-Допустимая стоимость экипировки ($)':500,
        }

metadict_detail['Монокуляр ночного видения'] = {
        # https://ru.wikipedia.org/wiki/НСПУ_(прицел)
        # Инфракрасный прибор ночного видения (бесподсветный)
        # Дальность видимости: 400 метров -- пехотинец; 600 метров -- танк.
        '-Допустимая масса экипировки (тонн)':0.0022,
        '--Потребление энергии (кВт)':0.001,
        '-Допустимая стоимость экипировки ($)':3000,
        }

metadict_detail['Бинокль переменной кратности'] = {
        '-Допустимая масса экипировки (тонн)':0.001,
        '-Допустимая стоимость экипировки ($)':800,
        }

metadict_detail['Активные наушники'] = {
        '-Допустимая масса экипировки (тонн)':0.0005,
        '--Потребление энергии (кВт)':0.001,
        '-Допустимая стоимость экипировки ($)':1000,
        }

metadict_detail['Пассивные наушники'] = {
        '-Допустимая масса экипировки (тонн)':0.0005,
        '-Допустимая стоимость экипировки ($)':50,
        }

metadict_detail['Универсальный источник питания'] = {
        # Источник механической/электрической энергии, 5 МДж -- 0.5 кг маховик.
        'Компоненты универсального источника питания':1,
        }

metadict_detail['Наспинное крепление для оружия'] = {
        '-Допустимая масса экипировки (тонн)':0.0004,
        '-Допустимая стоимость экипировки ($)':100,
        }

metadict_detail['Разгрузочный жилет'] = {
        '-Допустимая масса экипировки (тонн)':0.0008,
        '-Допустимая стоимость экипировки ($)':100,
        }

metadict_detail['5-литровые патронные сумки'] = {
        '-Допустимая масса экипировки (тонн)':0.0005,
        '-Допустимая стоимость экипировки ($)':50,
        }

metadict_detail['Управляемый инжектор лекарственных средств'] = {
        '-Допустимая масса экипировки (тонн)':0.0003,
        '-Допустимая стоимость экипировки ($)':200,
        }

metadict_detail['Шприц-тюбик психостимулирющего средства'] = {
        '-Допустимая масса экипировки (тонн)':0.00001,
        '-Допустимая стоимость экипировки ($)':10,
        }

metadict_detail['Шприц-тюбик антирадиационного средства'] = {
        '-Допустимая масса экипировки (тонн)':0.0001,
        'Структурный гель (граммы)':10,
        '-Допустимая стоимость экипировки ($)':30,
        }

metadict_detail['Шприц-тюбик заживляющего средства'] = {
        '-Допустимая масса экипировки (тонн)':0.0001,
        'Структурный гель (граммы)':50,
        '-Допустимая стоимость экипировки ($)':50,
        }

metadict_detail['Структурный гель (граммы)'] = {
        '-Допустимая масса экипировки (тонн)':0.000001,
        '-Допустимая стоимость экипировки ($)':1,
        }

metadict_detail['Назофарингеальная трубка'] = {
        '-Допустимая масса экипировки (тонн)':0.0001,
        '-Допустимая стоимость экипировки ($)':20,
        }

metadict_detail['Индивидуальный водяной фильтр'] = {
        '-Допустимая масса экипировки (тонн)':0.0002,
        '-Допустимая стоимость экипировки ($)':30,
        }

metadict_detail['Маскировочный комплект пехотинца'] = {
        'Маскировочная ткань (квадратные дециметры)':400,
        }

metadict_detail['Портативная телекамера'] = {
        '-Допустимая масса экипировки (тонн)':0.0003,
        '-Допустимая стоимость экипировки ($)':500,
        }

metadict_detail['Телевизионный прицел'] = {
        '-Допустимая масса экипировки (тонн)':0.0006,
        '-Допустимая стоимость экипировки ($)':600,
        }

metadict_detail['Комплект парадной униформы'] = {
        '-Допустимая масса экипировки (тонн)':0.0015,
        '-Допустимая стоимость экипировки ($)':300,
        }

metadict_detail['Комплект летней повседневной униформы'] = {
        '-Допустимая масса экипировки (тонн)':0.0015,
        '-Допустимая стоимость экипировки ($)':300,
        }

metadict_detail['Комплект зимней повседневной униформы'] = {
        '-Допустимая масса экипировки (тонн)':0.003,
        '-Допустимая стоимость экипировки ($)':500,
        }

metadict_detail['Комплект защиты от ОМП'] = {
        'Общевойсковой защитный комплект':1,
        'Фильтрующий противогаз':1,
        }

metadict_detail['Общевойсковой защитный комплект'] = {
        '-Допустимая масса экипировки (тонн)':0.003,
        '-Допустимая стоимость экипировки ($)':50,
        }

metadict_detail['Фильтрующий противогаз'] = {
        '-Допустимая масса экипировки (тонн)':0.001,
        '-Допустимая стоимость экипировки ($)':50,
        }

metadict_detail['Стробоскопический фонарь'] = {
        '-Допустимая масса экипировки (тонн)':0.0007,
        '-Допустимая стоимость экипировки ($)':30,
        }

metadict_detail['Бинокль'] = {
        '-Допустимая масса экипировки (тонн)':0.0002,
        '-Допустимая стоимость экипировки ($)':200,
        }

metadict_detail['Компас'] = {
        '-Допустимая масса экипировки (тонн)':0.0002,
        '-Допустимая стоимость экипировки ($)':30,
        }

metadict_detail['Часы'] = {
        '-Допустимая масса экипировки (тонн)':0.0001,
        '-Допустимая стоимость экипировки ($)':40,
        }

metadict_detail['Шприц-тюбик обезболивающего средства'] = {
        '-Допустимая масса экипировки (тонн)':0.00001,
        '-Допустимая стоимость экипировки ($)':1,
        }

metadict_detail['Шприц-тюбик антидота ФОВ'] = {
        '-Допустимая масса экипировки (тонн)':0.00001,
        '-Допустимая стоимость экипировки ($)':1,
        }

metadict_detail['Таблетки радиозащитного средства'] = {
        '-Допустимая масса экипировки (тонн)':0.00001,
        '-Допустимая стоимость экипировки ($)':1,
        }

metadict_detail['Таблетки противорвотного средства'] = {
        '-Допустимая масса экипировки (тонн)':0.00001,
        '-Допустимая стоимость экипировки ($)':1,
        }

metadict_detail['Таблетки антибактериального средства'] = {
        '-Допустимая масса экипировки (тонн)':0.00001,
        '-Допустимая стоимость экипировки ($)':1,
        }

metadict_detail['Таблетки психостимулирющего средства'] = {
        '-Допустимая масса экипировки (тонн)':0.00001,
        '-Допустимая стоимость экипировки ($)':1,
        }

metadict_detail['Индивидуальный противохимический пакет'] = {
        '-Допустимая масса экипировки (тонн)':0.000035,
        '-Допустимая стоимость экипировки ($)':1,
        }

metadict_detail['Индивидуальный перевязочный пакет'] = {
        '-Допустимая масса экипировки (тонн)':0.00005,
        '-Допустимая стоимость экипировки ($)':3,
        }

metadict_detail['Жгут кровоостанавливающий'] = {
        '-Допустимая масса экипировки (тонн)':0.0001,
        '-Допустимая стоимость экипировки ($)':20,
        }

metadict_detail['Упаковка влажных салфеток'] = {
        '-Допустимая масса экипировки (тонн)':0.0003,
        '-Допустимая стоимость экипировки ($)':1,
        }

metadict_detail['Малая пехотная лопатка'] = {
        '-Допустимая масса экипировки (тонн)':0.0006,
        '-Допустимая стоимость экипировки ($)':30,
        }

metadict_detail['Комплект выживания'] = {
        '-Допустимая масса экипировки (тонн)':0.0005,
        '-Допустимая стоимость экипировки ($)':40,
        }

metadict_detail['Армейский котелок'] = {
        '-Допустимая масса экипировки (тонн)':0.00064,
        '-Допустимая стоимость экипировки ($)':30,
        }

metadict_detail['Питьевая система'] = {
        '-Допустимая масса экипировки (тонн)':0.0002,
        '-Допустимая стоимость экипировки ($)':30,
        }

metadict_detail['Многофункциональный нож'] = {
        '-Допустимая масса экипировки (тонн)':0.0003,
        '-Допустимая стоимость экипировки ($)':200,
        }

metadict_detail['Палатка одноместная'] = {
        '-Допустимая масса экипировки (тонн)':0.0015,
        '-Допустимая стоимость экипировки ($)':200,
        }

metadict_detail['Непромокаемый плащ'] = {
        '-Допустимая масса экипировки (тонн)':0.001,
        '-Допустимая стоимость экипировки ($)':50,
        }

metadict_detail['Спальник'] = {
        '-Допустимая масса экипировки (тонн)':0.0015,
        '-Допустимая стоимость экипировки ($)':100,
        }

metadict_detail['Теплоизолирующий коврик'] = {
        '-Допустимая масса экипировки (тонн)':0.0005,
        '-Допустимая стоимость экипировки ($)':20,
        }

metadict_detail['60-литровый рюкзак'] = {
        '-Допустимая масса экипировки (тонн)':0.0015,
        '-Допустимая стоимость экипировки ($)':200,
        }

metadict_detail['10-литровые перемётные сумки'] = {
        '-Допустимая масса экипировки (тонн)':0.0008,
        '-Допустимая стоимость экипировки ($)':40,
        }

