#----
# Корпуса, шасси и оборудование бронетехники:

metadict_detail['Корпус ОБТ'] = {
        # Длина корпуса -- 6.6 метра; ширина -- 2 метра; высота -- 1 метр; коэффициент полноты -- 90%
        'Бронирование корпуса ОБТ':1,
        'Внутренние системы бронетехники':1,
        'Навесное оборудование танка':1,
        '-Внутренний объём (кубометров)':12,
        }

metadict_detail['Корпус БМД'] = {
        'Бронирование корпуса БМД':1,
        'Внутренние системы бронетехники':1,
        'Навесное оборудование бронетехники':1,
        '-Внутренний объём (кубометров)':8,
        }

metadict_detail['Корпус БТР'] = {
        'Бронирование корпуса БТР':1,
        'Внутренние системы бронетехники':1,
        'Навесное оборудование бронетехники':1,
        '-Внутренний объём (кубометров)':12,
        }

metadict_detail['Кабина военного грузовика'] = {
        'Бронирование кабины военного грузовика':1,
        'Внутренние системы военного грузовика':1,
        '-Внутренний объём (кубометров)':3,
        }

metadict_detail['Шасси ОБТ'] = {
        'Ходовая часть ОБТ':1,
        'Трансмиссия ОБТ':1,
        'Двигатель ОБТ':1,
        }

metadict_detail['Шасси БМД'] = {
        'Ходовая часть БМД':1,
        'Трансмиссия БМД':1,
        'Двигатель БМД':1,
        }

metadict_detail['Шасси БТР'] = {
        'Ходовая часть БТР':1,
        'Трансмиссия БТР':1,
        'Двигатель военного грузовика':1,
        }

metadict_detail['Шасси военного грузовика'] = {
        'Ходовая часть военного грузовика':1,
        'Трансмиссия военного грузовика':1,
        'Двигатель военного грузовика':1,
        }

#----
# Компоненты возимых орудий:

metadict_detail['Противооткатные устройства гаубицы'] = {
        'Гидропневматический накатник':1,
        'Гидравлический тормоз откатных частей':1,
        }

metadict_detail['Прицельные устройства гаубицы'] = {
        'Панорамный прицел гаубицы':1,
        'Телескопический прицел гаубицы':1,
        }

#----
# Авиационное оборудование:

metadict_detail['Конструкция истребителя'] = {
        'Планер истребителя':1,
        'Топливная система истребителя':1,
        'Турбореактивный двигатель истребителя':1,
        'Электрооборудование и средства связи истребителя':1,
        }

metadict_detail['Конструкция транспортного экранолёта'] = {
        'Планер транспортного экранолёта':1,
        'Ядерный реактор транспортного экранолёта':1,
        'Ядерный воздушно-реактивный двигатель':1,
        'Электрооборудование и средства связи транспортного экранолёта':1,
        }

metadict_detail['Вооружение бомбрадировщика'] = {
        # Кассетные противотанковые авиабомбы? А задачи-то есть?
        'Точка подвески (24-мм спаренная авиационная пушка)':1,
        'Точка подвески (противотанковая кассетная авиабомба 250 кг)':4,
        }

metadict_detail['Вооружение фронтового штурмовика'] = {
        'Точка подвески (24-мм спаренная авиационная пушка)':1,
        'Точка подвески (ракета воздух-поверхность)':4,
        }

metadict_detail['Вооружение истребителя-перехватчика'] = {
        'Точка подвески (24-мм спаренная авиационная пушка)':1,
        'Точка подвески (ракеты воздух-воздух)':4,
        }

#----
# Электрооборудование, аппаратура, приборы боевых машин:

metadict_detail['Электрооборудование и средства связи ОБТ'] = {
        'Приборы наблюдения и наведения ОБТ':1,
        'Информационно-управляющая система':1,
        'Танковая система управления огнём':1,
        'Танковое переговорное устройство':1,
        }

metadict_detail['Электрооборудование и средства связи БМП'] = {
        'Приборы наблюдения и наведения ОБТ':1,
        'Информационно-управляющая система':1,
        'Танковая система управления огнём':1,
        }

metadict_detail['Электрооборудование и средства связи БТР'] = {
        'Приборы наблюдения и наведения БТР':1,
        'Танковое переговорное устройство':1,
        'УКВ-радиостанция возимая':1,
        }

metadict_detail['Лазерная система активной защиты'] = {
        'Станция ближней разведки танковая':1,
        'Система перенаправления лазерного луча':1,
        'Электролазерная пушка танковая':1,
        }

metadict_detail['Аппаратура БПЛА радиоподавления'] = {
        }

metadict_detail['Электрооборудование и средства связи БМД'] = {
        }

metadict_detail['Электрооборудование и средства связи армейского ЗРК'] = {
        }

metadict_detail['Электрооборудование и средства связи батальонной артиллерии'] = {
        }

metadict_detail['Электрооборудование и средства связи дивизионного ЗРК'] = {
        }

metadict_detail['Электрооборудование и средства связи дивизионной артиллерии'] = {
        }

metadict_detail['Электрооборудование и средства связи истребителя'] = {
        }

metadict_detail['Электрооборудование и средства связи комплекса межконтинентальных баллистических ракет'] = {
        }

metadict_detail['Электрооборудование и средства связи комплекса оперативно-тактических ракет'] = {
        }

metadict_detail['Электрооборудование и средства связи полковой артиллерии'] = {
        }

metadict_detail['Электрооборудование и средства связи разведывательного БПЛА'] = {
        }

metadict_detail['Электрооборудование и средства связи сторожевого робота'] = {
        }

metadict_detail['Электрооборудование и средства связи транспортного экранолёта'] = {
        }

metadict_detail['Электрооборудование и средства связи штурмового робота'] = {
        }

#----
# Системы боевых машины:

metadict_detail['Внутренние системы бронетехники'] = {
        'Танковая система защиты от оружия массового поражения':1,
        'Танковая система кондиционирования':1,
        'Танковая система пожаротушения':1,
        }

metadict_detail['Навесное оборудование бронетехники'] = {
        'Маскировочный комплект танка':1,
        'Оборудование для самоокапывания':1,
        }

metadict_detail['Навесное оборудование танка'] = {
        'Маскировочный комплект танка':1,
        'Оборудование подводного вождения танка':1,
        'Оборудование для самоокапывания':1,
        'Навесной танковый бульдозер':1/12,
        }

metadict_detail['Броневая башня ОБТ'] = {
        # Усечённая сфера, радиус -- 0.9 метра, высота -- 0.8 метра
        'Бронирование башни ОБТ':1,
        'Поворотный механизм танковой башни':1,
        '-Внутренний объём (кубометров)':1.2,
        }

metadict_detail['Броневая башня БМП'] = {
        # Та же танковая башня, но с 30-мм автоматической пушкой и боекомплектом к ней:
        'Бронирование башни ОБТ':1,
        'Поворотный механизм танковой башни':1,
        '-Внутренний объём (кубометров)':1.2,
        }

metadict_detail['Броневая башня САУ'] = {
        'Бронирование башни САУ':1,
        'Поворотный механизм танковой башни':1,
        '-Внутренний объём (кубометров)':8,
        }

metadict_detail['Броневая башня БТР'] = {
        'Бронирование башни БТР':1,
        '-Внутренний объём (кубометров)':0.5,
        }

#----
# Детали брони:

metadict_detail['Бронирование корпуса ОБТ'] = {
        # За основу взято бронирование Т-62:
        # http://btvt.narod.ru/4/t-62/t62.htm
        'Верхняя лобовая деталь корпуса ОБТ':1,
        'Нижняя лобовая деталь корпуса ОБТ':1,
        'Бортовая бронеплита корпуса ОБТ':2,
        'Верхний кормовой бронелист корпуса ОБТ':1,
        'Нижний кормовой бронелист корпуса ОБТ':1,
        'Передний бронелист крыши корпуса ОБТ':1,
        'Задний бронелист крыши корпуса ОБТ':1,
        'Днище корпуса ОБТ':1,
        'Динамическая защита корпуса ОБТ':1,
        }

metadict_detail['Бронирование корпуса БМД'] = {
        # Понячьи БМД, это предельно лёгкие, перевозимые на планерах танкетки:
        # https://upload.wikimedia.org/wikipedia/commons/3/3e/Panzermuseum_Munster_2010_1007_%281%29.JPG
        'Верхняя лобовая деталь корпуса БМД':1,
        'Нижняя лобовая деталь корпуса БМД':1,
        'Бортовой бронелист корпуса БМД':2,
        'Кормовой бронелист корпуса БМД':1,
        'Крыша корпуса БМД':1,
        'Днище корпуса БМД':1,
        }

metadict_detail['Бронирование корпуса БТР'] = {
        # Катаная стальная броня с навесной керамикой (для боевых машин):
        'Верхняя лобовая деталь корпуса БТР':1,
        'Нижняя лобовая деталь корпуса БТР':1,
        'Верхний бортовой бронелист корпуса БТР':2,
        'Нижний бортовой бронелист корпуса БТР':2,
        'Кормовой бронелист корпуса БТР':1,
        'Крыша корпуса БТР':1,
        'Днище корпуса БТР':1,
        }

metadict_detail['Бронирование кабины военного грузовика'] = {
        # В отличии от машин из мира людей кабины понячьих грузовиков узкие и длинные.
        # https://en.wikipedia.org/wiki/Palletized_load_system
        'Верхняя лобовая деталь кабины военного грузовика':1,
        'Нижняя лобовая деталь кабины военного грузовика':1,
        'Бортовой бронелист кабины военного грузовика':2,
        'Кормовой бронелист кабины военного грузовика':1,
        'Крыша кабины военного грузовика':1,
        'Днище кабины военного грузовика':1,
        }

metadict_detail['Бронирование башни ОБТ'] = {
        # Сварная башня, комбинированная сталь-стеклопластиковая броня:
        # http://btvt.narod.ru/4/armor.htm
        'Лобовая деталь броневой башни ОБТ':2,
        'Бортовая деталь броневой башни ОБТ':1,
        'Крыша броневой башни ОБТ':1,
        'Динамическая защита башни ОБТ':1,
        }

metadict_detail['Бронирование башни САУ'] = {
        # Огромная башня с противоосколочным бронированием.
        'Лобовая деталь башни САУ':2,
        'Бортовая деталь башни САУ':2,
        'Кормовая деталь башни САУ':1,
        'Крыша башни САУ':1,
        }

metadict_detail['Бронирование башни БТР'] = {
        # Округлая башенка с противопулевой защитой.
        'Бортовой бронелист башни БТР':1,
        'Крыша башни БТР':1,
        }

#----
# Ходовая часть:

metadict_detail['Ходовая часть ОБТ'] = {
        # http://btvt.narod.ru/4/t-62/x-ch.jpg
        'Гусеничная лента ОБТ':2,
        'Комплект катков ОБТ':1,
        'Подвеска ОБТ':1,
        }

metadict_detail['Ходовая часть БМД'] = {
        'Водомётный движитель БТР':2,
        'Гусеничная лента БМД':2,
        'Комплект катков БМД':1,
        'Подвеска БМД':1,
        }

metadict_detail['Ходовая часть БТР'] = {
        'Водомётный движитель БТР':2,
        'Комплект колёс БТР':1,
        'Подвеска БТР':1,
        }

metadict_detail['Ходовая часть военного грузовика'] = {
        'Комплект колёс военного грузовика':1,
        'Подвеска военного грузовика':1,
        }

#----
# Трансмиссия:

metadict_detail['Трансмиссия ОБТ'] = {
        'Бортовой фрикцион ОБТ':2,
        'Бортовая коробка передач ОБТ':2,
        'Бак машинного масла (20 литров)':2,
        'Входной редуктор ОБТ':2,
        'Главный фрикцион ОБТ':1,
        'Карданный вал ОБТ':1,
        '--Потребление энергии (кВт)':800,
        }

metadict_detail['Трансмиссия БМД'] = {
        'Бортовой редуктор БМД':2,
        'Коробка передач БМД':1,
        'Бак машинного масла (20 литров)':1,
        'Входной редуктор БМД':1,
        'Главный фрикцион БМД':1,
        'Карданный вал БМД':1,
        '--Потребление энергии (кВт)':100,
        }

metadict_detail['Трансмиссия БТР'] = {
        'Карданный вал БТР':10,
        'Раздаточная коробка БТР':1,
        'Коробка передач БТР':1,
        'Бак машинного масла (20 литров)':1,
        'Сцепление БТР':1,
        '--Потребление энергии (кВт)':200,
        }

metadict_detail['Трансмиссия военного грузовика'] = {
        'Карданный вал военного грузовика':4,
        'Коробка передач военного грузовика':1,
        'Раздаточная коробка военного грузовика':1,
        'Бак машинного масла (20 литров)':1,
        'Сцепление военного грузовика':1,
        '--Потребление энергии (кВт)':200,
        }

#----
# Двигатели, генераторы, супермаховики:

metadict_detail['Двигатель ОБТ'] = {
        'Вариатор танкового маховика':1,
        'Танковый маховик':6,
        }

metadict_detail['Двигатель БМД'] = {
        'Вариатор лёгкого маховика':1,
        'Танковый маховик':1,
        }

metadict_detail['Двигатель военного грузовика'] = {
        'Вариатор лёгкого маховика':1,
        'Танковый маховик':2,
        }

#----
# Оборудование инженерных машин:

metadict_detail['Стреловое оборудование инженерной машины разграждения'] = {
        'Поворотная платформа':1,
        'Механизм поворота платформы':1,
        'Башня оператора стрелового оборудования':1,
        'Стреловой кран инженерной машины разграждения':1,
        'Гидроцилиндр подъёма стрелы':1,
        'Механизм выдвижения стрелы':1,
        'Захват-манипулятор':1,
        'Механизм подъема, поворота и раскрытия захвата-манипулятора':1,
        }

metadict_detail['Бульдозерное оборудование инженерной машины разграждения'] = {
        'Центральный отвал инженерной машины разграждения':1,
        'Крылья центрального отвала инженерной машины разграждения':1,
        'Рама центрального отвала инженерной машины разграждения':1,
        'Механизмы подъёма и опускания бульдозерного оборудования':1,
        'Механизмы перекоса и крепления бульдозерного оборудования':1,
        }

#----
# Оборудование мастерских:

metadict_detail['Оборудование сварочно-зарядное'] = {
        }

