#----
# Звания солдат и офицеров, экипировка.

metadict_detail['Заместитель командира батареи'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира роты'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира роты (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира роты специального назначения'] = {
        'Капитан':1,
        'Стрелково-гранатомётный комплекс':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект силовой брони':1,
        }

metadict_detail['Заместитель командира роты специального назначения (пегас)'] = {
        'Капитан (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Второй пилот (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Управляющий армейских складов'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Заместитель управляющего армейских складов'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Управляющий складского терминала'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Военнослужащий Генерального штаба'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Служащий Генерального штаба'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Заместитель начальника Генерального штаба'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Заместитель начальника управления Генерального штаба'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Начальник Генерального штаба'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Начальник управления Генерального штаба'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Военнослужащий штаба армии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Служащий штаба армии'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Командующий армией'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командующего армией'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель начальника тыла армии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель начальника штаба армии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник автомобильной службы армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник бронетанковой службы армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник РХБ защиты армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник вещевой службы армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник военно-юридической службы армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник воспитательной работы армии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник инженерных войск армии'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник канцелярии армии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник квартирно-эксплуатационной службы армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник военной полиции армии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник медицинской службы армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник боевой подготовки армии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник продовольственной службы армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник разведки армии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник противовоздушной обороны армии'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник ракетно-артиллерийской службы армии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник ракетных войск и артиллерии армии'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник связи армии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник секретной части армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник службы ГСМ армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник тыла армии'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник штаба армии'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник технической части армии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник авиационной службы армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник административно-хозяйствненого отдела армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник отдела кадров армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник топогеодезической службы армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник финансовой службы армии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник вещевой службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник военно-юридической службы дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник воспитательной работы дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник квартирно-эксплуатационной службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник продовольственной службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник боевой подготовки дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник службы ГСМ дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник финансовой службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Служащий штаба дивизии'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Командир дивизии'] = {
        'Генерал':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира дивизии по вооружению'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира дивизии по обучению'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Командир дивизии (пегас)'] = {
        'Генерал (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник штаба дивизии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник технической части дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник канцелярии дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель начальника штаба дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник тыла дивизии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель начальника тыла дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник РХБ защиты дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник авиационной службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник автомобильной службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник бронетанковой службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник инженерной службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник геодезической службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник метеорологической службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник военной полиции дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник разведки дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник медицинской службы дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник отдела кадров дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник противовоздушной обороны дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник связи дивизии'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник секретной части дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник склада боеприпасов дивизии'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник артиллерии дивизии'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник авиации дивизии'] = {
        'Полковник (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Штурман Тандерхеда'] = {
        'Полковник (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник штаба полка'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель начальника штаба полка'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник канцелярии полка'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник тыла полка'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник технической части полка'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник медицинской службы полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник авиации полка'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник артиллерии полка'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник автомобильной службы полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник бронетанковой службы полка'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник авиационной службы полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник инженерной службы полка'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник противовоздушной обороны полка'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник продовольственной службы полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник вещевой службы полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник финансовой службы полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник квартирно-эксплуатационной части полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник склада боеприпасов полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник службы ГСМ полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник отдела кадров полка'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник секретной части полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник разведки полка'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник военной полиции'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник РХБ защиты полка'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник связи полка'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Командир полка'] = {
        'Полковник':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Командир полка (пегас)'] = {
        'Полковник (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира полка по обучению'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира полка по вооружению'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Служащий штаба полка'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Начальник разведки батальона'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник связи батальона'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира батальона'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира батальона по обучению'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира батальона по вооружению'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник штаба батальона'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель начальника штаба батальона'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира эскадрильи (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира боевой части'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Командир дивизиона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Командир дивизиона (пегас)'] = {
        'Майор (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник штаба дивизиона'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Начальник штаба дивизиона (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель начальника штаба дивизиона'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель начальника штаба дивизиона (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира дивизиона'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира дивизиона (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира дивизиона по обучению'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира дивизиона по обучению (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира дивизиона по вооружению'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Заместитель командира дивизиона по вооружению (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Командир группы управления (шахтная МБР)'] = {
        # Начальник штаба дивизиона МБР
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

#----
# Командиры батальонов, дивизионов, эскадрилий:

metadict_detail['Командир батальона специального назначения'] = {
        'Полковник':1,
        'Стрелково-гранатомётный комплекс':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект силовой брони':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (специального назначения)':1,
        }

metadict_detail['Командир дивизиона артиллерийской разведки'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (артиллерийской разведки)':1,
        }

metadict_detail['Командир дивизиона зенитной разведки'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (зенитной разведки)':1,
        }

metadict_detail['Командир дивизиона ЗРК ближнего действия'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (ЗРК ближнего действия)':1,
        }

metadict_detail['Командир дивизиона ЗРК малой дальности'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (ЗРК малой дальности)':1,
        }

metadict_detail['Командир дивизиона ЗРК средней дальности'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (ЗРК средней дальности)':1,
        }

metadict_detail['Командир дивизиона ЗРК большой дальности'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (ЗРК большой дальности)':1,
        }

metadict_detail['Командир дивизиона 120-мм миномётов (пегас)'] = {
        'Майор (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак аэромобильного дивизиона (120-мм миномётов)':1,
        }

metadict_detail['Командир дивизиона 120-мм гаубиц'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (полковых гаубиц)':1,
        }

metadict_detail['Командир дивизиона 120-мм САУ'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (полковых САУ)':1,
        }

metadict_detail['Командир дивизиона 150-мм САУ'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (дивизионных САУ)':1,
        }

metadict_detail['Командир дивизиона 150-мм гаубиц'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (дивизионных гаубиц)':1,
        }

metadict_detail['Командир дивизиона 120-мм РСЗО'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (РСЗО)':1,
        }

metadict_detail['Командир дивизиона шахтных МБР'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (МБР)':1,
        }

metadict_detail['Командир дивизиона оперативно-тактических ракет'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак дивизиона (ОТРК)':1,
        }

metadict_detail['Командир штурмового батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (штурмового)':1,
        }

metadict_detail['Командир тылового батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (тылового)':1,
        }

metadict_detail['Командир танкового батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (танкового)':1,
        }

metadict_detail['Командир ремонтного батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (ремонтного)':1,
        }

metadict_detail['Командир разведывательного батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (разведывательного)':1,
        }

metadict_detail['Командир понтонно-мостового батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (понтонно-мостового)':1,
        }

metadict_detail['Командир пегасо-десантного батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (пегасо-десантного)':1,
        }

metadict_detail['Командир мотострелкового батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (мотострелкового)':1,
        }

metadict_detail['Командир механизированного батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (механизированного)':1,
        }

metadict_detail['Командир медико-санитарного батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (медицинского)':1,
        }

metadict_detail['Командир инженерно-сапёрного батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (инженерно-сапёрного)':1,
        }

metadict_detail['Командир инженерно-дорожного батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (инженерно-дорожного)':1,
        }

metadict_detail['Командир десантно-штурмового батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (штурмового)':1,
        }

metadict_detail['Командир батальона снабжения'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (снабжения)':1,
        }

metadict_detail['Командир батальона связи и охраны'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (связи и охраны)':1,
        }

metadict_detail['Командир батальона связи'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (связи)':1,
        }

metadict_detail['Командир инженерного батальона'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (инженерного)':1,
        }

metadict_detail['Командир батальона глубинной разведки'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (глубинной разведки)':1,
        }

metadict_detail['Командир батальона аэрозольного противодействия'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (дымовых завес)':1,
        }

metadict_detail['Командир батальона войск РХБЗ'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (войск РХБЗ)':1,
        }

metadict_detail['Командир батальона войск РХБЗ'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (войск РХБЗ)':1,
        }

metadict_detail['Командир батальона военной полиции'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (военной полиции)':1,
        }

metadict_detail['Командир батальона ведомственной охраны'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (охраны тыла)':1,
        }

metadict_detail['Командир батальона боевого обеспечения'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        }

metadict_detail['Командир батальона аэродромно-технического обеспечения'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        }

metadict_detail['Командир батальона РХБ разведки'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (РХБ разведки)':1,
        }

metadict_detail['Командир батальона РТР'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (радиотехнической разведки)':1,
        }

metadict_detail['Командир батальона РЭБ'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (радиоподавления)':1,
        }

metadict_detail['Командир батальона РЭР'] = {
        'Майор':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак батальона (радиоэлектронной разведки)':1,
        }

metadict_detail['Командир эскадрильи тяжёлых планёров (пегас)'] = {
        'Майор (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак авиационной эскадрильи (тяжёлых планёров)':1,
        }

metadict_detail['Командир эскадрильи транспортных планёров (пегас)'] = {
        'Майор (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак авиационной эскадрильи (транспортных планёров)':1,
        }

metadict_detail['Командир эскадрильи транспортной авиации (пегас)'] = {
        'Майор (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак авиационной эскадрильи (экранолётов)':1,
        }

metadict_detail['Командир эскадрильи ракетных планёров (пегас)'] = {
        'Майор (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак авиационной эскадрильи (ракетных планёров)':1,
        }

metadict_detail['Командир эскадрильи противотанковых планёров (пегас)'] = {
        'Майор (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак авиационной эскадрильи (противотанковых планёров)':1,
        }

metadict_detail['Командир эскадрильи противовоздушных планёров (пегас)'] = {
        'Майор (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак авиационной эскадрильи (противовоздушных планёров)':1,
        }

metadict_detail['Командир эскадрильи истребителей-бомбардировщиков (пегас)'] = {
        'Майор (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак авиационной эскадрильи (истребителей-бомбардировщиков)':1,
        }

metadict_detail['Командир эскадрильи бомбонесущих планёров (пегас)'] = {
        'Майор (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление батальонами (часов/день)':12,
        '====Тактический знак авиационной эскадрильи (планёров-бомбардировщиков)':1,
        }

#----
# Командиры рот, батарей, авиазвеньев:

metadict_detail['Командир мобильной АЭС'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (мобильная АЭС)':1,
        }

metadict_detail['Командир батареи батальонных САУ'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (батальонных САУ)':1,
        }

metadict_detail['Командир батареи полковых гаубиц'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (полковых гаубиц)':1,
        }

metadict_detail['Командир батареи полковых САУ'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (полковых САУ)':1,
        }

metadict_detail['Командир батареи дивизионных гаубиц'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (дивизионных гаубиц)':1,
        }

metadict_detail['Командир батареи дивизионных САУ'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (дивизионных САУ)':1,
        }

metadict_detail['Командир противотанковой батареи (пегас)'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (противотанковой)':1,
        }

metadict_detail['Командир миномётной батареи (пегас)'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (миномётов)':1,
        }

metadict_detail['Командир батареи связи'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (связи)':1,
        }

metadict_detail['Командир батареи оперативно-тактических ракет'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (ОТРК)':1,
        }

metadict_detail['Командир батареи гаубиц'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (гаубиц)':1,
        }

metadict_detail['Командир батареи артиллерийской разведки'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (артиллерийской разведки)':1,
        }

metadict_detail['Командир батареи гаубиц'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (гаубиц)':1,
        }

metadict_detail['Командир батареи САУ'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (САУ)':1,
        }

metadict_detail['Командир батареи РСЗО'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (РСЗО)':1,
        }

metadict_detail['Командир батареи ЗРК малой дальности'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (ЗРК малой дальности)':1,
        }

metadict_detail['Командир батареи ЗРК средней дальности'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (ЗРК средней дальности)':1,
        }

metadict_detail['Командир батареи ЗРК большой дальности'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак батареи (ЗРК большой дальности)':1,
        }

metadict_detail['Командир штурмовой роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (штурмовой)':1,
        }

metadict_detail['Командир тыловой роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (тыловой)':1,
        }

metadict_detail['Командир танковой роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (танковой)':1,
        }

metadict_detail['Командир сапёрной роты (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (сапёрной)':1,
        }

metadict_detail['Командир сапёрной роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (сапёрной)':1,
        }

metadict_detail['Командир роты тяжёлого оружия (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (тяжёлого оружия)':1,
        }

metadict_detail['Командир роты транспортных планёров (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (снабжения)':1,
        }

metadict_detail['Командир роты связи'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (связи)':1,
        }

metadict_detail['Командир роты разведывательных БПЛА'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (разведывательных БПЛА)':1,
        }

metadict_detail['Командир роты радиолокационной разведки'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (радиолокаицонной разведки)':1,
        }

metadict_detail['Командир роты войск РХБЗ'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (войск РХБЗ)':1,
        }

metadict_detail['Командир роты военной полиции'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (военной полиции)':1,
        }

metadict_detail['Командир роты ведомственной охраны'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (охраны тыла)':1,
        }

metadict_detail['Командир роты боевых роботов'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (боевых роботов)':1,
        }

metadict_detail['Командир роты планёров-бомбардировщиков (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (планёров-бомбардировщиков)':1,
        }

metadict_detail['Командир роты противовоздушных планёров (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (противовоздушных планёров)':1,
        }

metadict_detail['Командир роты противотанковых планёров (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (противотанковых планёров)':1,
        }

metadict_detail['Командир роты ракетных планёров (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (ракетных планёров)':1,
        }

metadict_detail['Командир роты РЭР'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (радиоэлектронной разведки)':1,
        }

metadict_detail['Командир роты РЭБ'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (радиоэлектронного подавления)':1,
        }

metadict_detail['Командир роты РХБ разведки'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (РХБ разведки)':1,
        }

metadict_detail['Командир роты РХБ разведки (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (РХБ разведки)':1,
        }

metadict_detail['Командир роты РТР и РЭР'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (радиотехнической разведки)':1,
        }

metadict_detail['Командир роты РТР'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (радиотехнической разведки)':1,
        }

metadict_detail['Командир ремонтной роты'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (ремонтной)':1,
        }

metadict_detail['Командир разведывательной роты (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (разведывательной)':1,
        }

metadict_detail['Командир разведывательной роты (бронетехника)'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (разведывательной)':1,
        }

metadict_detail['Командир понтонно-мостовой роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (понтонно-мостовой)':1,
        }

metadict_detail['Командир пегасо-десантной роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (передовой)':1,
        }

metadict_detail['Командир мотострелковой роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (передовой)':1,
        }

metadict_detail['Командир механизированной роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (передовой)':1,
        }

metadict_detail['Командир медицинской роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (медицинской)':1,
        }

metadict_detail['Командир медицинской роты (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (медицинской)':1,
        }

metadict_detail['Командир роты посыльных (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (связи)':1,
        }

metadict_detail['Командир инженерной роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (инженерной)':1,
        }

metadict_detail['Командир инженерно-сапёрной роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (инженерно-сапёрной)':1,
        }

metadict_detail['Командир роты инструкторов'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (тыловой)':1,
        }

metadict_detail['Командир роты (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак авиационной роты (тыловой)':1,
        }

metadict_detail['Командир роты специального назначения'] = {
        'Майор':1,
        'Стрелково-гранатомётный комплекс':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект силовой брони':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (специального назначения)':1,
        }

metadict_detail['Командир роты специального назначения (пегас)'] = {
        'Майор (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки базовый':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (диверсионно-разведывательной)':1,
        }

metadict_detail['Командир десантно-штурмовой роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (десантно-штурмовой)':1,
        }

metadict_detail['Командир крылатой роты'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление ротами (часов/день)':12,
        '===Тактический знак роты (десантно-штурмовой)':1,
        }

metadict_detail['Командир звена транспортной авиации'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        '==Тактический знак авиационного звена (экранолётов)':1,
        }

metadict_detail['Командир звена истребителей-бомбардировщиков'] = {
        'Капитан':1,
        'Пистолет-пулемёт':1,
        '==Тактический знак авиационного звена (истребителей-бомбардировщиков)':1,
        }

#----
# Командиры взводов:

metadict_detail['Командир взвода мобильного энергоблока'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (снабжения)':1,
        }

metadict_detail['Командир взвода транспортных планёров (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (снабжения)':1,
        }

metadict_detail['Командир взвода ракетных планёров (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (ракетных планёров)':1,
        }

metadict_detail['Командир взвода противовоздушных планёров (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (противовоздушных планёров)':1,
        }

metadict_detail['Командир взвода противотанковых планёров (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (противотанковых планёров)':1,
        }

metadict_detail['Командир взвода планёров-бомбардировщиков (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (планёров-бомбардировщиков)':1,
        }

metadict_detail['Командир взвода специального назначения'] = {
        'Капитан':1,
        'Стрелково-гранатомётный комплекс':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект силовой брони':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (специального назначения)':1,
        }

metadict_detail['Командир взвода РХБ защиты'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (РХБ защиты)':1,
        }

metadict_detail['Командир взвода РХБ защиты (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (РХБ защиты)':1,
        }

metadict_detail['Командир тылового взвода'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (тылового)':1,
        }

metadict_detail['Командир инженерного взвода'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (инженерного взвода)':1,
        }

metadict_detail['Командир метеорологического взвода'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (метеорологического взвода)':1,
        }

metadict_detail['Командир взвода тяжёлого оружия'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (тяжёлого оружия)':1,
        }

metadict_detail['Командир взвода связи'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (связи)':1,
        }

metadict_detail['Командир взвода роботов РЭБ'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (роботов РЭБ)':1,
        }

metadict_detail['Командир взвода разведывательных БПЛА'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (разведывательных БПЛА)':1,
        }

metadict_detail['Командир взвода механизированных мостов'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (механизированных мостов)':1,
        }

metadict_detail['Командир понтонно-мостового взвода'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (понтонно-мостового)':1,
        }

metadict_detail['Командир взвода инженерной разведки'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (инженерной разведки)':1,
        }

metadict_detail['Командир взвода боевых роботов'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (боевых роботов)':1,
        }

metadict_detail['Командир взвода РТР'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (радиотехнической разведки)':1,
        }

metadict_detail['Командир взвода РТР (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (радиотехнической разведки)':1,
        }

metadict_detail['Командир взвода РЭБ'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (радиоэлектронного подавления)':1,
        }

metadict_detail['Командир взвода РЭР'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (радиоэлектронной разведки)':1,
        }

metadict_detail['Командир танкового взвода'] = {
        'Лейтенант (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (танкового)':1,
        '=Тактический знак боевой бронированной машины (танк)':1,
        }

metadict_detail['Командир миномётного взвода (бронетехника)'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак огневого взвода (самоходных миномётов)':1,
        }

metadict_detail['Командир миномётного взвода (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак аэромобильного огневого взвода (миномётного)':1,
        }

metadict_detail['Командир огневого взвода 120-мм РСЗО'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак огневого взвода (120-мм РСЗО)':1,
        }

metadict_detail['Командир огневого взвода 120-мм САУ'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак огневого взвода (120-мм САУ)':1,
        }

metadict_detail['Командир огневого взвода 150-мм САУ'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак огневого взвода (150-мм САУ)':1,
        }

metadict_detail['Командир огневого взвода 120-мм гаубиц'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак огневого взвода (120-мм гаубиц)':1,
        }

metadict_detail['Командир огневого взвода 150-мм гаубиц'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак огневого взвода (150-мм гаубиц)':1,
        }

metadict_detail['Командир сапёрного взвода'] = {
        'Лейтенант (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (сапёрного)':1,
        }

metadict_detail['Командир десантно-штурмового взвода'] = {
        'Лейтенант':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (десантно-штурмового)':1,
        }

metadict_detail['Командир механизированного взвода'] = {
        'Лейтенант':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (механизированного)':1,
        }

metadict_detail['Командир мотострелкового взвода'] = {
        'Лейтенант':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (мотострелкового)':1,
        }

metadict_detail['Командир пегасо-десантного взвода'] = {
        'Лейтенант':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (пегасо-десантного)':1,
        }

metadict_detail['Командир пулемётного взвода (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (пулемётного)':1,
        }

metadict_detail['Командир ремонтного взвода'] = {
        'Лейтенант':1,
        '-Ремонт и обслуживание машин/оружия (часов/день)':8,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (ремонтный)':1,
        }

metadict_detail['Командир взвода снабжения'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (снабжение)':1,
        }

metadict_detail['Командир взвода РХБ разведки'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (РХБ разведки)':1,
        }

metadict_detail['Командир взвода РХБ разведки (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (РХБ разведки)':1,
        }

metadict_detail['Командир взвода РЭБ (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (радиоэлектронного подавления)':1,
        }

metadict_detail['Командир взвода РЭР (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (радиоэлектронной разведки)':1,
        }

metadict_detail['Командир взвода военной полиции'] = {
        'Лейтенант':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Автоматический карабин':1,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (военной полиции)':1,
        }

metadict_detail['Командир взвода ведомственной охраны'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (охраны тыла)':1,
        }

metadict_detail['Командир взвода военной полиции (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Автоматический карабин':1,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (военной полиции)':1,
        }

metadict_detail['Командир взвода звукометрической разведки'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (звукометрической разведки)':1,
        }

metadict_detail['Командир взвода связи (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (связи)':1,
        }

metadict_detail['Командир гранатомётного взвода (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (автоматических гранатомётов)':1,
        }

metadict_detail['Командир диверсионно-разведывательного взвода (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (диверсионно-разведывательного)':1,
        }

metadict_detail['Командир медицинского взвода'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (медицинского)':1,
        }

metadict_detail['Командир медицинского взвода (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (медицинского)':1,
        }

metadict_detail['Командир противотанкового взвода (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (противотанкового)':1,
        }

metadict_detail['Командир противотанкового взвода'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (противотанкового)':1,
        }

metadict_detail['Командир разведывательного взвода (бронетехника)'] = {
        'Лейтенант':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (разведывательного)':1,
        }

metadict_detail['Командир разведывательного взвода (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (разведывательного)':1,
        }

metadict_detail['Командир снайперского взвода (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак авиационного взвода (снайперского)':1,
        }

metadict_detail['Командир топогеодезического взвода (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (топогеодезического)':1,
        }

metadict_detail['Командир тылового взвода (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        '==Тактический знак взвода (тылового)':1,
        }

metadict_detail['Заместитель командира передового взвода'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        }

metadict_detail['Заместитель командира передового взвода (пегас)'] = {
        'Сержант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки командира':1,
        '-Управление взводами (часов/день)':12,
        }

metadict_detail['Заместитель командира тылового взвода'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        '-Управление взводами (часов/день)':12,
        }

#----
# Командиры отделений:

metadict_detail['Командир отделения механизированных мостов'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (механизированных мостов)':1,
        }

metadict_detail['Командир пулемётного отделения'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (пулемётного)':1,
        }

metadict_detail['Командир отделения РХБ разведки'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (РХБ разведки)':1,
        }

metadict_detail['Командир отделения военной полиции'] = {
        'Сержант':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Автоматический карабин':1,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (военной полиции)':1,
        }

metadict_detail['Командир отделения ведомственной охраны'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (охраны тыла)':1,
        }

metadict_detail['Командир водолазного отделения'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (инженерного)':1,
        }

metadict_detail['Командир отделения РХБ защиты'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (РХБ защиты)':1,
        }

metadict_detail['Командир отделения РХБ защиты (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (РХБ защиты)':1,
        }

metadict_detail['Командир отделения РХБ разведки (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (РХБ разведка)':1,
        }

metadict_detail['Командир отделения планёров-бомбардировщиков (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (планёров-бомбардировщиков)':1,
        }

metadict_detail['Командир отделения противовоздушных планёров (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (противовоздушных планёров)':1,
        }

metadict_detail['Командир отделения противотанковых планёров (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (противотанковых планёров)':1,
        }

metadict_detail['Командир отделения ракетных планёров (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (ракетных планёров)':1,
        }

metadict_detail['Командир инженерного отделения'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (инженерного)':1,
        }

metadict_detail['Командир отделения сапёров'] = {
        'Сержант (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (сапёров)':1,
        }

metadict_detail['Командир отделения сапёров (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (сапёрного)':1,
        }

metadict_detail['Командир отделения лёгкой пехоты'] = {
        'Сержант':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (лёгкой пехоты)':1,
        }

metadict_detail['Командир пулемётного отделения (пегас)'] = {
        'Сержант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (пулемётного)':1,
        }

metadict_detail['Командир тылового отделения'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (тылового)':1,
        }

metadict_detail['Командир тылового отделения (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (аэромобильное тыловое)':1,
        }

metadict_detail['Командир отделения специального назначения'] = {
        'Лейтенант':1,
        'Носимый 12-мм пехотный пулемёт':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект силовой брони':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (специального назначения)':1,
        }

metadict_detail['Командир диверсионно-разведывательной группы (пегас)'] = {
        'Сержант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (диверсионно-разведывательного)':1,
        }

metadict_detail['Командир гранатомётного отделения'] = {
        'Сержант':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (автоматических гранатомётов)':1,
        }

metadict_detail['Командир гранатомётного отделения (пегас)'] = {
        'Сержант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (автоматических гранатомётов)':1,
        }

metadict_detail['Командир отделения БПЛА'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (БПЛА)':1,
        }

metadict_detail['Командир отделения РЛС'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (радиолокационного)':1,
        }

metadict_detail['Командир отделения РТР'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (радиотехнической разведки)':1,
        }

metadict_detail['Командир отделения РЭБ'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (радиоэлектронного подавления)':1,
        }

metadict_detail['Командир отделения РЭБ (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (радиоэлектронного подавления)':1,
        }

metadict_detail['Командир отделения РЭР'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (радиоэлектронной разведки)':1,
        }

metadict_detail['Командир отделения РЭР (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (радиоэлектронной разведки)':1,
        }

metadict_detail['Командир отделения военной полиции (пегас)'] = {
        'Сержант (пегас)':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Автоматический карабин':1,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (военной полиции)':1,
        }

metadict_detail['Командир отделения звукометрической разведки (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (звукометрической разведки)':1,
        }

metadict_detail['Командир отделения инженерной разведки'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (инженерной разведки)':1,
        }

metadict_detail['Командир отделения связи'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (связи)':1,
        }

metadict_detail['Командир отделения связи (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (связи)':1,
        }

metadict_detail['Командир отделения снабжения'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (снабжения)':1,
        }

metadict_detail['Командир отделения транспортных планёров (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (снабжения)':1,
        }

metadict_detail['Командир противотанкового отделения'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (противотанкового)':1,
        }

metadict_detail['Командир противотанкового отделения (пегас)'] = {
        'Сержант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (противотанкового)':1,
        }

metadict_detail['Командир снайперской группы (пегас)'] = {
        'Сержант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (снайперского)':1,
        }

metadict_detail['Командир разведывательного отделения (пегас)'] = {
        'Сержант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (разведывательного)':1,
        }

metadict_detail['Командир разведывательного отделения'] = {
        'Сержант':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Автоматический карабин':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (разведывательного)':1,
        '=Тактический знак боевой бронированной машины (БРМ)':1,
        }

metadict_detail['Командир топогеодезического отделения (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак отделения (топогеодезического)':1,
        }

metadict_detail['Командир отделения эвакуации раненых (пегас)'] = {
        'Сержант (пегас)':1,
        '-Эвакуация раненых (за час)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак авиационного отделения (медицинского)':1,
        }

#----
# Командиры экипажей, расчётов:

metadict_detail['Командир транспортного экранолёта (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '=Тактический знак авиационной единицы (экранолёт)':1,
        }

metadict_detail['Пилот ведущего истребителя-бомбардировщика (пегас)'] = {
        'Капитан (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '=Тактический знак авиационной пары (истребителей)':1,
        }

metadict_detail['Пилот ведомого истребителя-бомбардировщика (пегас)'] = {
        'Лейтенант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        }

metadict_detail['Командир расчёта МБР'] = {
        'Лейтенант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки командира':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак артиллерии (ПУ МБР)':1,
        }

metadict_detail['Командир отделения подготовки и запуска (шахтная МБР)'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        }

metadict_detail['Командир ЗРК ближнего действия'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак ЗРК (ближнего действия)':1,
        }

metadict_detail['Командир ЗРК малой дальности'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак ЗРК (малой дальности)':1,
        }

metadict_detail['Командир ЗРК средней дальности'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак ЗРК (средней дальности)':1,
        }

metadict_detail['Командир расчёта ЗРК большой дальности'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак ЗРК (большой дальности)':1,
        }

metadict_detail['Командир расчёта 120-мм миномёта'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак артиллерии (120-мм миномёт)':1,
        }

metadict_detail['Командир расчёта 120-мм миномёта (пегас)'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '=Тактический знак артиллерии (120-мм миномёт)':1,
        }

metadict_detail['Командир расчёта 120-мм гаубицы'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак артиллерии (120-мм гаубица)':1,
        }

metadict_detail['Командир расчёта 120-мм САУ'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак артиллерии (120-мм САУ)':1,
        }

metadict_detail['Командир расчёта 150-мм САУ'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак артиллерии (150-мм САУ)':1,
        }

metadict_detail['Командир расчёта 150-мм гаубицы'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '=Тактический знак артиллерии (150-мм гаубица)':1,
        }

metadict_detail['Командир расчёта 120-мм РСЗО'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак артиллерии (120-мм РСЗО)':1,
        }

metadict_detail['Командир расчёта оперативно-тактических ракет'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак артиллерии (ПУ ОТРК)':1,
        }

metadict_detail['Командир ремонтно-эвакуационной машины'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        }

metadict_detail['Командир ОБТ'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки сержанта':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак боевой бронированной машины (танк)':1,
        }

metadict_detail['Командир БМП'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак боевой бронированной машины (БМП)':1,
        }

metadict_detail['Командир БМД'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        '-Управление отделениями (часов/день)':12,
        '=Тактический знак боевой бронированной машины (БМП)':1,
        }

#----
# Инструкторы, служащие:

metadict_detail['Инструктор по РХБ защите'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Инструктор артиллеристов'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Инструктор ракетчиков'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Инструктор экипажей бронемашин'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Инструктор по боевой подготовке'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Инструктор по боевой подготовке (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Инструктор по боевой подготовке (единорог)'] = {
        'Сержант (единорог)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Инструктор по вооружению'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Инструктор по вооружению (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Санитар-инструктор'] = {
        'Сержант (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Переводчик'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Старший механик (ДВС)'] = {
        'Сержант (единорог)':1,
        '-Ремонт и обслуживание ДВС (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Старший механик (авиатехника)'] = {
        'Сержант (единорог)':1,
        '-Ремонт и обслуживание авиатехники (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Старший механик (автотехника)'] = {
        'Сержант (единорог)':1,
        '-Ремонт и обслуживание автотехники (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Старший механик (калибровка)'] = {
        'Сержант (единорог)':1,
        '-Ремонт и обслуживание тяжёлого оружия (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Старший механик (монокристаллы)'] = {
        'Сержант (единорог)':1,
        '-Ремонт и обслуживание маховиков (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Старший механик (оптитроника)'] = {
        'Сержант (единорог)':1,
        '-Ремонт и обслуживание оптической электроники (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Старший механик (радиоэлектроника)'] = {
        'Сержант (единорог)':1,
        '-Ремонт и обслуживание радиотехники (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Водитель-механик'] = {
        'Рядовой':1,
        '-Ремонт и обслуживание машин/оружия (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Механик (пегас)'] = {
        'Рядовой (пегас)':1,
        '-Ремонт и обслуживание машин/оружия (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Механик (пайка и монтаж)'] = {
        'Рядовой (единорог)':1,
        '-Ремонт и обслуживание электротехники (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Механик (сварочные работы)'] = {
        'Рядовой (единорог)':1,
        '-Ремонт и обслуживание автотехники (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Механик (слесарные работы)'] = {
        'Рядовой (единорог)':1,
        '-Ремонт и изготовление деталей (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Механик (сборочно-разборочные работы)'] = {
        'Рядовой (единорог)':1,
        '-Ремонт и сборка механизмов (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Механик (слесарные работы)'] = {
        'Рядовой (единорог)':1,
        '-Ремонт и обработка металлических изделий (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Механик (шитьё и обработка)'] = {
        'Рядовой (единорог)':1,
        '-Ремонт и обработка высокопрочных тканей (часов/день)':8,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Санитар (единорог)'] = {
        'Сержант (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Помощник санитара (пегас)'] = {
        'Рядовой (пегас)':1,
        '-Эвакуация раненых (за час)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Повар'] = {
        'Рядовой (единорог)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Пекарь'] = {
        'Рядовой (единорог)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Обслуживающий персонал'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Оператор ЭВМ'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Делопроизводитель'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Шифровальщик'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Управляющий хозяйством роты'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        'УКВ-радиостанция переносная':1,
        }

metadict_detail['Управляющий хозяйством роты (пегас)'] = {
        'Сержант (пегас)':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        'УКВ-радиостанция переносная':1,
        }

metadict_detail['Управляющий хозяйством батареи'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Персональная электронно-вычислительная машина':1,
        'УКВ-радиостанция переносная':1,
        }

#----
# Сержанты, рядовые:

metadict_detail['Артиллерист'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Артиллерист (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Заряжающий (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Старший ракетчик'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        }

metadict_detail['Ракетчик'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        }

metadict_detail['Боец (гранатомётчик)'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Реактивный противотанковый гранатомёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Боец (помощник гранатомётчика)'] = {
        'Рядовой':1,
        'Автоматический карабин':1,
        'Реактивные гранаты (запасные)':3,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Боец (огнемётчик)'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Лёгкий пехотный огнемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Боец (гренадер)'] = {
        'Рядовой (единорог)':1,
        'Автоматический карабин':1,
        'Наступательные гранаты':20,
        'Дымовые гранаты':10,
        'Комплект боевой экипировки гренадера':1,
        }

metadict_detail['Боец (пулемётчик)'] = {
        'Рядовой':1,
        'Единый пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Боец (помощник пулемётчика)'] = {
        'Рядовой':1,
        'Автоматический карабин':1,
        'Короб на 300 патронов 6x48 (запасной)':2,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Боец (старший стрелок)'] = {
        'Рядовой (единорог)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки гренадера':1,
        }

metadict_detail['Боец войск РХБ защиты'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        }

metadict_detail['Боец войск РХБ защиты (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        }

metadict_detail['Старший пожарный'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        }

metadict_detail['Пожарный'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        }

metadict_detail['Разведчик (пегас)'] = {
        'Рядовой (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Патрульный (пегас)'] = {
        'Рядовой (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Регулировщик (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Разведчик-радиотехник (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Механик-водитель БТР'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик-оператор БТР'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Механик-водитель БМД'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик-оператор БМД'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Механик-водитель БМП'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик-оператор БМП'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Механик-водитель ОБТ'] = {
        'Рядовой (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик-оператор ОБТ'] = {
        'Рядовой (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Водитель ЗРК'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Водитель грузовика'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Водитель-санитар'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Водолаз-разведчик (единорог)'] = {
        'Рядовой (единорог)':1,
        'Пистолет-пулемёт':1,
        'Водолазный костюм':1,
        }

metadict_detail['Командир пулемётного расчёта'] = {
        'Рядовой':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик пулемётного расчёта'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Подносчик БК пулемётного расчёта'] = {
        'Рядовой':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Командир пулемётного расчёта (пегас)'] = {
        'Рядовой (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик пулемётного расчёта (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Подносчик БК пулемётного расчёта (пегас)'] = {
        'Рядовой (пегас)':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Командир расчёта АГС'] = {
        'Рядовой':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик расчёта АГС'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Подносчик БК расчёта АГС'] = {
        'Рядовой':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Командир расчёта АГС (пегас)'] = {
        'Рядовой (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик расчёта АГС (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Подносчик БК расчёта АГС (пегас)'] = {
        'Рядовой (пегас)':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Командир расчёта ПТРК (пегас)'] = {
        'Рядовой (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик расчёта ПТРК (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик расчёта ПТРК (единорог)'] = {
        'Рядовой (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Командир расчёта ПТРК'] = {
        'Рядовой':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик расчёта ПТРК'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Подносчик БК расчёта ПТРК'] = {
        'Рядовой':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Исполнитель снайперской группы (единорог)'] = {
        'Сержант (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки гренадера':1,
        'Электромагнитная снайперская пушка':1,
        }

metadict_detail['Наблюдатель снайперской группы (пегас)'] = {
        'Сержант (пегас)':1,
        'Автоматический карабин':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Наводчик ПТРК диверсионно-разведывательной группы (пегас)'] = {
        'Сержант (пегас)':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Сапёр диверсионно-разведывательной группы (единорог)'] = {
        'Сержант (единорог)':1,
        'Автоматический карабин':1,
        'Наступательные гранаты':20,
        'Дымовые гранаты':10,
        'Комплект боевой экипировки гренадера':1,
        }

metadict_detail['Врач (единорог)'] = {
        'Сержант (единорог)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Полевой хирург (единорог)'] = {
        'Сержант (единорог)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Инженер-разведчик'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Инженер-строитель (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Понтонист (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Оперативник (сапёр)'] = {
        'Сержант (единорог)':1,
        'Переносной противотанковый ракетный комплекс':1,
        'Стрелково-гранатомётный комплекс':1,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Комплект силовой брони':1,
        }

metadict_detail['Оперативник (электролазер)'] = {
        'Сержант (единорог)':1,
        'Электролазерная пушка':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект силовой брони':1,
        }

metadict_detail['Оперативник (огнемётчик)'] = {
        'Сержант (единорог)':1,
        'Реактивный пехотный огнемёт':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект силовой брони':1,
        }

metadict_detail['Оперативник (пулемётчик)'] = {
        'Сержант':1,
        'Носимый 12-мм пехотный пулемёт':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект силовой брони':1,
        }

metadict_detail['Оперативник (ПТРК)'] = {
        'Сержант':1,
        'Переносной противотанковый ракетный комплекс':1,
        'Стрелково-гранатомётный комплекс':1,
        'Выстрелы 40x46-мм ГП (дымовые)':10,
        'Выстрелы 40x46-мм ГП (светошумовые)':10,
        'Комплект силовой брони':1,
        }

metadict_detail['Военный полицейский'] = {
        'Сержант (единорог)':1,
        'Пистолет-пулемёт':1,
        'Дымовые гранаты':10,
        'Светошумовые гранаты':10,
        'Комплект боевой экипировки гренадера':1,
        }

metadict_detail['Ведомственный охранник'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Лётчик (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Извозчик (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Снабженец (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Метеоролог'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Оператор БПЛА'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Оператор ЗРК'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Оператор инженерной машины'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Оператор мобильной АЭС'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Радиационно-защитный костюм':1,
        }

metadict_detail['Оператор мобильной РЛС'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Оператор станции ближней разведки'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Оператор станции ближней разведки (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Оператор станции звукометрической разведки'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Оператор-радиотехник'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        }

metadict_detail['Оператор-радиотехник (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Сапёр-специалист'] = {
        'Сержант (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Сапёр (единорог)'] = {
        'Рядовой (единорог)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Старший связист'] = {
        'Сержант':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        'Персональная электронно-вычислительная машина':1,
        }

metadict_detail['Связист'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Связист (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        'УКВ-радиостанция переносная':1,
        }

metadict_detail['Связист снайперской группы (пегас)'] = {
        'Сержант (пегас)':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        'УКВ-радиостанция переносная':1,
        }

metadict_detail['Связист диверсионно-разведывательной группы (пегас)'] = {
        'Сержант (пегас)':1,
        'Лёгкий 40-мм гранатомёт':1,
        'Автоматический карабин':1,
        'Комплект боевой экипировки базовый':1,
        'УКВ-радиостанция переносная':1,
        }

metadict_detail['Топогеодезист (пегас)'] = {
        'Рядовой (пегас)':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }

metadict_detail['Сцепщик-такелажник'] = {
        'Рядовой':1,
        'Пистолет-пулемёт':1,
        'Комплект боевой экипировки базовый':1,
        }
