#----
# Группировки войск:

metadict_army['BLUEFOR в операции Дракон'] = {
        'Тандерхед':1,
        'Пегасо-десантная дивизия':3,
        'Мотострелковая дивизия':1,
        'Крылатая боевая дивизия':1,
        'Реактивная артиллерийская бригада':1,
        'Бригада войск РХБ защиты':1,
        'Инженерно-дорожная бригада':1,
        'Инженерно-техническая бригада':1,
        'Дивизия связи и разведки':1,
        'Дивизия тылового обеспечения':1,
        }

metadict_army['OPFOR в операции Дракон'] = {
        'Горная стрелковая дивизия (полосатых)':1,
        'Десантно-штурмовая бригада (полосатых)':1,
        }

metadict_army['BLUEFOR в наступлении на долину Йолона'] = {
        '630-й штурмовой инженерно-сапёрный батальон 11-03-81 года':1,
        'Десантно-штурмовой батальон':1,
        'Рота боевых планёров (реактивные снаряды)':1,
        # Поддержка
        #'Дивизион 120-мм РСЗО':1,
        }

metadict_army['OPFOR в обороне долины Йолона'] = {
        'Пулемётная рота (полосатых)':1,
        'Горнострелковая рота (полосатых)':1,
        'Медицинская рота':1,
        'Батарея станковых 120-мм миномётов (полосатых)':1,
        'Взвод боевых планёров (управляемые ракеты)':1,
        'Зенитный смешанная батарея (полосатых)':1,
        'Рота тылового обеспечения':1,
        }

#----
# Дивизии:

metadict_army['Горная стрелковая дивизия (полосатых)'] = {
        'Управление дивизии':1,
        'Танковый полк (полосатых)':1,
        'Мотострелковый полк (полосатых)':1,
        'Горнострелковый полк (полосатых)':3,
        'Гаубичный артиллерийский полк (полосатых)':1,
        'Полк зенитных ракет ближнего действия':1,
        'Полк боевого обеспечения':1,
        'Полк тылового обеспечения':1,
        }

#----
# Бригады, полки:

metadict_army['Реактивная артиллерийская бригада'] = {
        'Управление полка':1,
        'Дивизион 120-мм РСЗО':4,
        'Дивизион тактических ракет':1,
        'Дивизион боевого обеспечния (артиллерийских войск)':1,
        'Батальон снабжения (боеприпасы)':1,
        'Рота тылового обеспечения':1,
        }

metadict_army['Десантно-штурмовая бригада (полосатых)'] = {
        'Управление полка':1,
        'Десантно-штурмовой батальон (полосатых)':3,
        'Дивизион 120-мм гаубиц':1,
        'Батальон боевого обеспечения':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Танковый полк (полосатых)'] = {
        'Управление полка':1,
        'Мотострелковый батальон (полосатых)':1,
        'Танковый батальон (полосатых)':3,
        'Дивизион 120-мм гаубиц':1,
        'Зенитный ракетно-артиллерийский дивизион (полосатых)':1,
        'Батальон боевого обеспечения (бронетехника)':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Мотострелковый полк (полосатых)'] = {
        'Управление полка':1,
        'Мотострелковый батальон (полосатых)':3,
        'Танковый батальон (полосатых)':1,
        'Дивизион 120-мм гаубиц':1,
        'Зенитный ракетно-артиллерийский дивизион (полосатых)':1,
        'Батальон боевого обеспечения (бронетехника)':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Горнострелковый полк (полосатых)'] = {
        'Управление полка':1,
        'Горнострелковый батальон (полосатых)':3,
        'Дивизион 120-мм гаубиц':1,
        'Зенитный ракетно-артиллерийский дивизион (полосатых)':1,
        'Батальон боевого обеспечения (бронетехника)':1,
        'Батальон тылового обеспечения':1,
        }

metadict_army['Гаубичный артиллерийский полк (полосатых)'] = {
        'Управление полка':1,
        'Дивизион 150-мм гаубиц':3,
        'Дивизион 120-мм РСЗО':1,
        'Дивизион боевого обеспечния (артиллерийских войск)':1,
        'Рота снабжения (боеприпасы)':1,
        'Рота тылового обеспечения':1,
        }

#----
# Батальоны, дивизионы, эскадрильи:

metadict_army['630-й штурмовой инженерно-сапёрный батальон 11-03-81 года'] = {
        'Управление 630-го батальона 01-04-82 года':1,
        'Первая рота 630-го батальона 11-03-81 года':1,
        'Пегасо-десантная рота':1,
        'Взвод штурмовых роботов':1,
        'Медицинский взвод':1,
        'Взвод связи (передовой пункт управления батальона)':1,
        'Противотанковый взвод (аэромобильный)':1,
        'Батарея автоматических 80-мм миномётов':1,
        }

metadict_army['630-й штурмовой инженерно-сапёрный батальон 01-04-82 года'] = {
        'Управление 630-го батальона 01-04-82 года':1,
        'Первая рота 630-го батальона 01-04-82 года':1,
        'Механизированная рота':2,
        'Танковый взвод':1,
        'Противотанковый взвод (бронетехника)':1,
        'Батарея 120-мм миномётов (бронетехника)':1,
        'Инженерно-сапёрная рота':1,
        'Рота обеспечения мотострелков':1,
        }

metadict_army['Мотострелковый батальон (полосатых)'] = {
        'Управление мотострелкового батальона':1,
        'Мотострелковая рота':3,
        'Батарея станковых 120-мм миномётов (полосатых)':1,
        'Зенитная пулемётная батарея (полосатых)':1,
        'Рота обеспечения мотострелков':1,
        }

metadict_army['Танковый батальон (полосатых)'] = {
        'Управление танкового батальона':1,
        'Танковая рота':3,
        'Зенитная пулемётная батарея (полосатых)':1,
        'Рота обеспечения мотострелков':1,
        }

metadict_army['Горнострелковый батальон (полосатых)'] = {
        'Управление горнострелкового батальона (полосатых)':1,
        'Горнострелковая рота (полосатых)':3,
        'Пулемётная рота (полосатых)':1,
        'Противотанковая батарея (полосатых)':1,
        'Батарея станковых 120-мм миномётов (полосатых)':1,
        'Зенитная пулемётная батарея (полосатых)':1,
        'Рота обеспечения мотострелков':1,
        }

metadict_army['Десантно-штурмовой батальон (полосатых)'] = {
        'Управление десантно-штурмового батальона (полосатых)':1,
        'Горнострелковая рота (полосатых)':3,
        'Пулемётная рота (полосатых)':1,
        'Противотанковая батарея (полосатых)':1,
        'Батарея станковых 120-мм миномётов (полосатых)':1,
        'Зенитная ракетная батарея (полосатых)':1,
        'Рота обеспечения мотострелков':1,
        }

metadict_army['Зенитный ракетно-артиллерийский дивизион (полосатых)'] = {
        'Управление зенитного ракетно-артиллерийского дивизиона (полосатых)':1,
        'Зенитная артиллерийская батарея (полосатых)':2,
        'Зенитная ракетная батарея (полосатых)':1,
        'Взвод тылового обеспечения':1,
        }

#----
# Роты, батареи, авиационные звенья:

metadict_army['Первая рота 630-го батальона 11-03-81 года'] = {
        'Управление штурмовой роты (без БМП)':1,
        'Штурмовой взвод (без БМП)':3,
        }

metadict_army['Вторая рота 630-го батальона 01-04-82 года (до высадки)'] = {
        'Управление 630-го батальона 01-04-82 года':1,
        'Управление механизированной роты':1,
        'Взвод связи (передовой пункт управления батальона)':1,
        'Экипаж первого танка взвода':1,
        'Механизированный взвод':3,
        'Противотанковое отделение':1,
        'Разведывательный взвод (аэромобильный)':1,
        }

metadict_army['Вторая рота 630-го батальона 01-04-82 года (после высадки)'] = {
        'Механизированный взвод':2,
        'Противотанковое отделение':1,
        'Разведывательный взвод (аэромобильный)':1,
        'Отделение обеспечения связи (передовое)':1,
        }

metadict_army['Батарея станковых 120-мм миномётов (полосатых)'] = {
        # Подправить управление, подправить отделения:
        'Управление миномётной батареи (полосатых)':1,
        'Отделение связи':1,
        'Отделение артиллерийской разведки':1,
        'Огневой взвод станковых 120-мм миномётов':2,
        }

metadict_army['Противотанковая батарея (полосатых)'] = {
        'Управление противотанковой батареи (полосатых)':1,
        'Противотанковый взвод (полосатых)':3,
        }

metadict_army['Зенитная смешанная батарея (полосатых)'] = {
        'Управление зенитной пулемётной батареи (полосатых)':1,
        'Зенитный артиллерийский взвод (полосатых)':1,
        'Зенитный пулемётный взвод (полосатых)':1,
        'Зенитный ракетный взвод (полосатых)':1,
        }

metadict_army['Зенитная артиллерийская батарея (полосатых)'] = {
        'Управление зенитной артиллерийской батареи (полосатых)':1,
        'Зенитный артиллерийский взвод (полосатых)':3,
        }

metadict_army['Зенитная ракетная батарея (полосатых)'] = {
        'Управление зенитной ракетной батареи (полосатых)':1,
        'Зенитный ракетный взвод (полосатых)':3,
        }

metadict_army['Зенитная пулемётная батарея (полосатых)'] = {
        'Управление зенитной пулемётной батареи (полосатых)':1,
        'Зенитный пулемётный взвод (полосатых)':3,
        }

metadict_army['Горнострелковая рота (полосатых)'] = {
        'Управление горнострелковой роты (полосатых)':1,
        'Горнострелковый взвод (полосатых)':3,
        'Пулемётный взвод (полосатых)':1,
        }

metadict_army['Пулемётная рота (полосатых)'] = {
        'Управление горнострелковой роты (полосатых)':1,
        'Пулемётный взвод (полосатых)':3,
        }

#----
# Взводы, отделения, экипажи, расчёты:

metadict_army['Штурмовой взвод (без БМП)'] = {
        'Командир взвода специального назначения':1,
        'Штурмовое отделение':3,
        'Огнемётное отделение':1,
        }

metadict_army['Штурмовое отделение'] = {
        'Командир отделения специального назначения':1,
        'Оперативник (электролазер)':3,
        'Оперативник (пулемётчик)':3,
        'Оперативник (сапёр)':3,
        }

metadict_army['Горнострелковый взвод (полосатых)'] = {
        'Командир горнострелкового взвода':1,
        'Горнострелковое отделение (полосатых)':3,
        'Отделение транспортных автомобилей':1,
        }

metadict_army['Горнострелковое отделение (полосатых)'] = {
        'Командир горнострелкового отделения':1,
        'Огневая команда':1,
        'Маневровая команда (полосатых)':1,
        }

metadict_army['Маневровая команда (полосатых)'] = {
        'Боец (пулемётчик)':1,
        'Боец (помощник пулемётчика)':1,
        'Боец (старший стрелок)':1,
        'Боец (стрелок)':1,
        }

metadict_army['Противотанковый взвод (полосатых)'] = {
        'Командир противотанкового взвода':1,
        'Противотанковое отделение':1,
        'Отделение станковых противотанковых гранатомётов':2,
        'Отделение транспортных автомобилей':1,
        }

metadict_army['Зенитный ракетный взвод (полосатых)'] = {
        'Командир зенитного взвода':1,
        'Зенитное ракетное отделение (полосатых)':3,
        'Отделение транспортных автомобилей':1,
        }

metadict_army['Зенитный артиллерийский взвод (полосатых)'] = {
        'Командир зенитного взвода':1,
        'Расчёт зенитной артиллерийской установки (полосатых)':4,
        }

metadict_army['Расчёт зенитной артиллерийской установки (полосатых)'] = {
        'Командир расчёта ЗУ':1,
        'Наводчик расчёта ЗУ':1,
        'Подносчик БК расчёта ЗУ':2,
        'Водитель грузовика':1,
        'Зенитная артиллерийская установка':1,
        'Военный грузовик (перевозчик артиллерии и боеприпасов)':1,
        }

metadict_army['Зенитный пулемётный взвод (полосатых)'] = {
        'Командир зенитного взвода':1,
        'Расчёт зенитной пулемётной устанки (полосатых)':3,
        'Отделение транспортных автомобилей':1,
        }

metadict_army['Расчёт зенитной пулемётной устанки (полосатых)'] = {
        'Командир расчёта ЗПУ':1,
        'Наводчик расчёта ЗПУ':1,
        'Подносчик БК расчёта ЗПУ':2,
        'Зенитная пулемётная установка':1,
        }

metadict_army['Зенитное ракетное отделение (полосатых)'] = {
        'Командир зенитного отделения':1,
        'Боец (ПЗРК)':9,
        }

metadict_army['Пулемётный взвод (полосатых)'] = {
        'Командир взвода тяжёлого оружия':1,
        'Пулемётное отделение':3,
        'Отделение транспортных автомобилей':1,
        }

metadict_army['Отделение станковых противотанковых гранатомётов'] = {
        'Командир отделения СПГ':1,
        'Расчёт СПГ':3,
        }

metadict_army['Расчёт СПГ'] = {
        'Командир расчёта СПГ':1,
        'Наводчик расчёта СПГ':1,
        'Подносчик БК расчёта СПГ':2,
        'Станковый противотанковый гранатомёт':1,
        }
