#----
# Батальоны, дивизионы, эскадрильи:

metadict_army['630-й штурмовой инженерно-сапёрный батальон 01-04-82 года'] = {
        'Управление 630-го батальона 01-04-82 года':1,
        'Штурмовая рота':1,
        'Механизированная рота':2,
        'Танковый взвод':1,
        'Противотанковый взвод (бронетехника)':1,
        'Батарея 120-мм миномётов (бронетехника)':1,
        'Инженерно-сапёрная рота':1,
        'Рота обеспечения мотострелков':1,
        }

#----
# Роты, батареи, авиационные звенья:

metadict_army['Вторая рота 630-го батальона 01-04-82 года (до высадки)'] = {
        'Управление 630-го батальона 01-04-82 года':1,
        'Управление механизированной роты':1,
        'Взвод связи (передовой пункт управления батальона)':1,
        'Экипаж первого танка взвода':1,
        'Механизированный взвод':3,
        'Противотанковое отделение':1,
        'Разведывательный взвод (аэромобильный)':1,
        }

metadict_army['Вторая рота 630-го батальона 01-04-82 года (после высадки)'] = {
        'Механизированный взвод':2,
        'Противотанковое отделение':1,
        'Разведывательный взвод (аэромобильный)':1,
        'Отделение обеспечения связи (передовое)':1,
        }

