#----
# Строительные материалы (упрощение):

metadict_model['Внешние балки стропильной системы (метр)'] = {
        'Брус обрезной 100x150 мм (метр)':1,
        }

metadict_model['Прогоны стропильной системы (метр)'] = {
        'Брус обрезной 100x150 мм (метр)':1,
        }

metadict_model['Раскосы стропильной системы (метр)'] = {
        'Брус обрезной 100x150 мм (метр)':1,
        }

metadict_model['Стойка стропильной системы (метр)'] = {
        'Брус обрезной 100x150 мм (метр)':1,
        }

metadict_model['Стропильные ноги (метр)'] = {
        'Брус обрезной 100x150 мм (метр)':1,
        }

metadict_model['Наличники (метр)'] = {
        'Брус обрезной 50x150 мм (метр)':1,
        }

metadict_model['Доски подоконные деревянные (метр)'] = {
        'Брус обрезной 50x150 мм (метр)':1,
        }

metadict_model['Коробки дверные (метр)'] = {
        'Брус обрезной 50x150 мм (метр)':1,
        }

metadict_model['Материалы гидроизоляционные рулонные (квадратный метр)'] = {
        'Толь гидроизоляционный ТГ-350 (квадратный метр)':1,
        }

metadict_model['Толь гидроизоляционный ТГ-350 (квадратный метр)'] = {
        # Технический картон, пропитаный битумом, тот же рубероид.
        # http://stroyres.net/vyazhushhie-materialy/organicheskie/tol
        # Рулон 15 кв. метров -- 24 кг (1.6 кг/кв.метр)
        'Толь гидроизоляционный ТГ-350 (килограмм)':1.6,
        }

metadict_model['Пергамин кровельный П-350 (квадратный метр)'] = {
        # Технический картон, пропитаный битумом, тот же рубероид.
        'Пергамин кровельный П-350 (килограмм)':0.65,
        }

metadict_model['Пергамин кровельный П-350 (килограмм)'] = {
        'Картон пропитанный дёгтем (килограмм)':1,
        }

metadict_model['Толь гидроизоляционный ТГ-350 (килограмм)'] = {
        'Картон пропитанный дёгтем (килограмм)':1,
        }

metadict_model['Картон пропитанный дёгтем (килограмм)'] = {
        # Понячий аналог нашего рубероида.
        'Картон (килограмм)':0.4,
        'Дёготь (килограмм)':0.6,
        }

metadict_model['Паста антисептическая строительная (килограмм)'] = {
        # Всё можно заменить дёгтем. Абсолютно.
        'Дёготь (килограмм)':1,
        }

metadict_model['Войлок строительный (килограмм)'] = {
        # Исправить
            # Шерсть в строительстве? Нет пути.
            # Можно с овцами подружиться, чому нет?
        'Пакля (килограмм)':1,
        }

metadict_model['Пакля пропитаная (килограмм)'] = {
        # Отходы волокна льна/конопли свалянные и пропитанные дёгтем:
        'Пакля (килограмм)':0.6,
        'Дёготь (килограмм)':0.4,
        }

metadict_model['Гвозди строительные (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Гвозди кровельные и толевые (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Гвозди стальные (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Лента стальная (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Шурупы строительные (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Болты с гайками и шайбами строительные (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Поковки из квадратных заготовок (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Ерши металлические (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Проволока вязальная (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Проволока стальная 6 мм (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Сетка проволочная тканая с ячейками №5 (квадратный метр)'] = {
        # http://orelsetka.ru/gost_3826.html
        # Проволока диаметром 1.2 мм
        'Прокат стальной (килограмм)':3,
        }

metadict_model['Прокат полосковый (килограмм)'] = {
        'Прокат стальной (килограмм)':1,
        }

metadict_model['Кирпич-половняк керамический (кубометр)'] = {
        'Кирпич (кубометр)':1,
        }

metadict_model['Олифа комбинированная марки К-2 (килограмм)'] = {
        'Олифа (килограмм)':1,
        }

metadict_model['Олифа для улучшенной окраски (килограмм)'] = {
        'Олифа (килограмм)':1,
        }

metadict_model['Олифа для высококачественной окраски (килограмм)'] = {
        'Олифа (килограмм)':1,
        }

metadict_model['Древесные опилки для утепления (кубометр)'] = {
        # Исправить
            # Обрабатывают раствором медного купороса или борной кислотой (антисептик)
            # Смешивают с известью/цементом (для негорючести. Наподобие арболита?)
            # Добавляют гипс, чтобы опилки не проседали
                # десять частей опилок, одна часть цемента, часть извести (объёмные доли?)
            # Да проще термолит сделать!
        'Опилки древесные (кубометр)':1,
        }

metadict_model['Лёгкий саман для утепления (кубометр)'] = {
        # 10% глины, остальное солома.
        'Сухая солома (кубометр)':0.9,
        'Глина (кубометр)':0.1,
        }

metadict_model['Шпатлевка масляно-клеевая (килограмм)'] = {
        # Состав: олифа, масляный лак, клей.
            # http://recn.ru/shpaklevka-po-derevu-svoimi-rukami
        'Шпатлевка (килограмм)':1,
        }

metadict_model['Шпатлевка (килограмм)'] = {
        # Исправить
            # У понек именно масляные шпатлёвки. Пили рецептуру.
        # Можно смешать мел и клей на основе смолы и льняного масла.
        # Льняное масло -- 280 грамм;
        # Скипидар живичный -- 60 грамм;
        # Порошок пемзы (или перлит) -- 30 грамм
        # Казеин (животного происхождения, нужна замена) -- 20 грамм
        # Бура (тетраборат натрия) (сода + борная кислота) -- 12 грамм
            # http://makecandles.ru/dlya-plameni-svechi/265-bura-chudo-veshestvo-na-vse-sluchai-jizni
        # Аммиак 18% -- 18 грамм
        # Вода -- 300 грамм
        'Клей ПВА (килограмм)':0.5,
        'Мел (килограмм)':0.5,
        'Опилки древесные (кубометр)':0.001,
        }

metadict_model['Каболка (килограмм)'] = {
        'Канат смоляной (килограмм)':1,
        }

metadict_model['Смесь сухая для заделки швов (килограмм)'] = {
        # Исправить
            # Песок? Так себе идея.
        'Песок (килограмм)':1,
        }

metadict_model['Битумная мастика (тонн)'] = {
        'Дёготь (килограмм)':500,
        'Смола (килограмм)':300,
        'Асбест (килограмм)':200,
        }

metadict_model['Клей ПВА (килограмм)'] = {
        'Клей (килограмм)':1,
        }

metadict_model['Клей для облицовочных работ (килограмм)'] = {
        'Клей (килограмм)':1,
        }

metadict_model['Цемент гипсоглинозёмный расширяющийся (килограмм)'] = {
        'Цемент (килограмм)':1,
        }

metadict_model['Цемент (килограмм)'] = {
        'Цемент (тонн)':0.001,
        }

metadict_model['Цемент (тонн)'] = {
        # Плотность 1500 кг/м³
        'Цемент (кубометр)':1 / 1.5,
        }

metadict_model['Стекло жидкое калийное (килограмм)'] = {
        'Стекло жидкое (килограмм)':1,
        }

#----
# Строительные материалы (квадратные метры):

metadict_model['Прокат из нержавеющей стали 1.8 мм (квадратный метр)'] = {
        'Прокат стальной (килограмм)':0.0018*7600,
        }

metadict_model['Сталь оцинкованная 0.7 мм (квадратный метр)'] = {
        'Прокат стальной (килограмм)':0.0007*7600,
        }

#----
# Строительные материалы (размерные):

metadict_model['Брус обрезной 180x180 мм (метр)'] = {
        'Брус обрезной (кубометр)':0.18 * 0.18,
        }

metadict_model['Брус обрезной 150x150 мм (метр)'] = {
        'Брус обрезной (кубометр)':0.15 * 0.15,
        }

metadict_model['Брус обрезной 100x150 мм (метр)'] = {
        'Брус обрезной (кубометр)':0.10 * 0.15,
        }

metadict_model['Брус обрезной 50x150 мм (метр)'] = {
        'Брус обрезной (кубометр)':0.05 * 0.10,
        }

metadict_model['Брус обрезной 100x100 мм (метр)'] = {
        'Брус обрезной (кубометр)':0.10 * 0.10,
        }

metadict_model['Брус обрезной 50x50 мм (метр)'] = {
        'Брус обрезной (кубометр)':0.05 * 0.05,
        }

metadict_model['Жерди диаметром 40 мм (метр)'] = {
        'Жерди диаметром 40 мм (4 метра)':1 / 4,
        }

metadict_model['Накатник диаметром 80 мм (метр)'] = {
        'Накатник диаметром 80 мм (6 метров)':1 / 6,
        }

metadict_model['Жерди диаметром 40 мм (4 метра)'] = {
        # Диаметр тонкого конца -- 40 мм, диаметр толстого конца -- 80 мм
        'Круглый лес (кубометр)':1/3 * 3.14159265 * 4 * ((0.04/2) ** 2 +
            (0.04/2)*(0.08/2) + (0.08/2) ** 2),
        }

metadict_model['Накатник диаметром 80 мм (6 метров)'] = {
        # Диаметр тонкого конца -- 80 мм, диаметр толстого конца -- 140 мм
        'Круглый лес (кубометр)':1/3 * 3.14159265 * 6 * ((0.08/2) ** 2 +
            (0.08/2)*(0.14/2) + (0.14/2) ** 2),
        }


#----
# Строительные материалы (штучные):

metadict_model['Кирпич керамический (штука)'] = {
        # Кирпич делается под человеческую руку, но у пони-то копыта, крылья и рога!
        # http://chzsm54.ru/brick
            # Размер: 120x250x65 мм (512 на кубометр)
            # Объём: 0.002 кв.метра
            # Масса: 3.1 кг
        'Кирпич (кубометр)':0.12*0.25*0.065,
        }

metadict_model['Плитки керамические рядковые (квадратный метр)'] = {
        'Плитки керамические (квадратный метр)':1,
        }

#metadict_model['Кирпич эквестрийский (штука)'] = {
#        # Пони используют массивные, пегасо-переносимые керамические блоки.
#        'Кирпич (тонн)':0.031,
#        }

metadict_model['|Дверца топки'] = {
        # Исрпавить
            # Перенести в производство деталей
        'Литой чугун (килограмм)':8
        }

metadict_model['|Дверца поддувала'] = {
        'Литой чугун (килограмм)':1.6
        }

metadict_model['|Дверца прочистная'] = {
        'Литой чугун (килограмм)':1.6
        }

metadict_model['|Дверца каминная'] = {
        'Литой чугун (килограмм)':12
        }

metadict_model['|Решётка колосниковая'] = {
        'Литой чугун (килограмм)':8
        }

metadict_model['|Задвижка дымохода'] = {
        'Литой чугун (килограмм)':4
        }

metadict_model['|Задвижка печная'] = {
        'Литой чугун (килограмм)':4
        }

metadict_model['|Самоварник'] = {
        'Литой чугун (килограмм)':2
        }

metadict_model['Муфты надвижные для чугунных труб диаметром 150-мм'] = {
        # https://znaytovar.ru/gost/2/GOST_69422280_Truby_chugunnye.html
        'Литой чугун (килограмм)':5.6
        }

metadict_model['Муфты надвижные для чугунных труб диаметром 50-мм'] = {
        # https://znaytovar.ru/gost/2/GOST_69422280_Truby_chugunnye.html
        'Литой чугун (килограмм)':1.4
        }

metadict_model['Чугунная труба диаметром 50-мм (метр)'] = {
        # http://www.vashdom.ru/gost/6942-80/
        'Литой чугун (килограмм)':5.8
        }

metadict_model['Чугунная труба диаметром 150-мм (метр)'] = {
        # http://www.vashdom.ru/gost/6942-80/
        'Литой чугун (килограмм)':20.7
        }

metadict_model['Чугунная труба воздуховода диаметром 150-мм (метр)'] = {
        # Исправить
             # Уточнить толщину стенок, узнать массу.
        'Литой чугун (килограмм)':5.8
        }

#----
# Строительные материалы (кубометры):

metadict_model['Доска обрезная 25 мм (квадратный метр)'] = {
        'Доска обрезная (кубометр)':0.025,
        }

metadict_model['Доска обрезная 20 мм (квадратный метр)'] = {
        'Доска обрезная (кубометр)':0.020,
        }

metadict_model['Доска обрезная 15 мм (квадратный метр)'] = {
        'Доска обрезная (кубометр)':0.015,
        }

metadict_model['Доска обрезная 10 мм (квадратный метр)'] = {
        'Доска обрезная (кубометр)':0.010,
        }

metadict_model['Кровельная солома 300 мм (квадратный метр)'] = {
        # Длина соломы 0.6-1 метра.
        'Сухая солома (кубометр)':0.3,
        }

metadict_model['Доска обрезная (кубометр)'] = {
        'Пиломатериалы (кубометр)':1,
        }

metadict_model['Брус обрезной (кубометр)'] = {
        'Пиломатериалы (кубометр)':1,
        }

metadict_model['Лесоматериалы круглые 140-270 мм (кубометр)'] = {
        'Круглый лес (кубометр)':1,
        }

#----
# Коррекция величин (кубометры)

#metadict_detail['Стекло оконное (квадратный метр)'] = {
#        # Исправить
#            # Производство оконного стекла меряется квадратными метрами.
#        # Толщина 4 мм.
#        'Стекло (кубометр)':0.004,
#        }

#----
# Строительные материалы (тонны):

#metadict_model['Картон (килограмм)'] = {
#        'Картон (тонн)':1/1000,
#        }
#
#metadict_model['Пакля (килограмм)'] = {
#        'Пакля (тонн)':1/1000,
#        }
#
#metadict_model['Прокат стальной (килограмм)'] = {
#        'Прокат стальной (тонн)':1/1000,
#        }
