#----
# Зерновые:
    # Урожайность сельскохозяйственных культур (1964 год):
    # https://kaz-ekzams.ru/biologiya/uchebnaya-literatura-po-biologii/zhiznennye-resursy-chelovechestva/pishhevye-resursy/7145-urozhajnost-selskohozyajstvennyh-kultur.html
    # Традиционная белорусская деревня в европейской перспективе Земледелие и животноводство
    # http://vln.by/node/217

metadict_detail['Выращивание Зерно пшеницы (центнер)'] = {
        # Урожайность: 20 центнеров с гектара.
        '|-Поля пшеницы (гектар)':1/20,
        }

metadict_detail['Выращивание Зерно овса (центнер)'] = {
        '|-Поля овса (гектар)':1/20,
        }

metadict_detail['Выращивание Початки кукурузы (центнер)'] = {
        '|-Поля кукурузы (гектар)':1/40,
        }

#----
# Зерновые-технические:

metadict_detail['Выращивание Семена конопли (центнер)'] = {
        '|-Поля конопли (гектар)':1/6,
        }

metadict_detail['Выращивание Семена льна (центнер)'] = {
        '|-Поля льна (гектар)':1/3,
        }

metadict_detail['Выращивание Семена горчицы белой (центнер)'] = {
        '|-Поля горчицы белой (гектар)':1/3,
        }

metadict_detail['Выращивание Семена подсолнечника (центнер)'] = {
        '|-Поля подсолнечника (гектар)':1/10,
        }

#----
# Бобовые:

metadict_detail['Выращивание Арахисовые бобы неочищенные (центнер)'] = {
        '|-Поля арахиса (гектар)':1/15,
        }

metadict_detail['Выращивание Соевые бобы неочищенные (центнер)'] = {
        '|-Поля сои (гектар)':1/15,
        }

metadict_detail['Выращивание Бобы красной фасоли неочищенные (центнер)'] = {
        '|-Поля красной фасоли (гектар)':1/20,
        }

#----
# Огородные:

metadict_detail['Выращивание Батат (центнер)'] = {
        '|-Поля батата (гектар)':1/200,
        }

metadict_detail['Выращивание Картофель (центнер)'] = {
        '|-Поля картофеля (гектар)':1/140,
        }

metadict_detail['Выращивание Томаты (центнер)'] = {
        '|-Поля томатов (гектар)':1/200,
        }

metadict_detail['Выращивание Тыква (центнер)'] = {
        '|-Поля тыквы (гектар)':1/200,
        }

metadict_detail['Выращивание Кабачок (центнер)'] = {
        '|-Поля кабачка (гектар)':1/200,
        }

metadict_detail['Выращивание Огурцы (центнер)'] = {
        '|-Поля огурцов (гектар)':1/200,
        }

metadict_detail['Выращивание Капуста белокочанная (центнер)'] = {
        '|-Поля капусты (гектар)':1/200,
        }

metadict_detail['Выращивание Морковь (центнер)'] = {
        '|-Поля моркови (гектар)':1/200,
        }

metadict_detail['Выращивание Репа (центнер)'] = {
        '|-Поля репы (гектар)':1/150,
        }

metadict_detail['Выращивание Перец сладкий (центнер)'] = {
        '|-Поля перца сладкого (гектар)':1/200,
        }

metadict_detail['Выращивание Лук репчатый (центнер)'] = {
        '|-Поля лука репчатого (гектар)':1/200,
        }

metadict_detail['Выращивание Свёкла столовая (центнер)'] = {
        # Киевская губерния, конец 19 века:
            # https://ru.wikipedia.org/wiki/Киевская_губерния#Сельское_хозяйство
            # 81 631 гектаров сахарной свёклы (150 центнеров/гектар)
        '|-Поля столовой свёклы (гектар)':1/150,
        }

#----
# Садовые:

metadict_detail['Выращивание Яблоко (центнер)'] = {
        '|-Яблоневые сады (гектар)':1/80,
        }

metadict_detail['Выращивание Вишня (центнер)'] = {
        '|-Вишнёвые сады (гектар)':1/60,
        }

metadict_detail['Выращивание Груша (центнер)'] = {
        '|-Грушёвые сады (гектар)':1/80,
        }

metadict_detail['Выращивание Виноград (центнер)'] = {
        # Пони не мучают виноград густой посадкой:
        # http://vinograd.info/info/vinogradarstvo-po-novomy/gystota-posadki.html
        '|-Виноградники (гектар)':1/80,
        }

metadict_detail['Выращивание Плоды оливы (центнер)'] = {
        '|-Оливковые сады (гектар)':1/20,
        }

#----
# Собирательство, пчеловодство:

metadict_detail['Выращивание Дикорастущие растения (центнер)'] = {
        '|-Сбор дикорастущих растений (гектар)':1,
        }

metadict_detail['Кленовый сок (центнер)'] = {
        # Исправить
            # Клёнов и так с избытком.
        #'|-Кленовые леса (гектар)':1/40,
        }

metadict_detail['Выращивание Мёд в сотах (центнер)'] = {
        # Исправить
            # Вообще-то клёны и дубы эквестрийских лесов -- отличные медоносы.
        # 25 кг мёда с гектара луга -- одна семья пчёл на гектар.
        '|-Медоносные луга (гектар)':4,
        }

#----
# Импорт:

metadict_detail['Выращивание Кофейные зёрна (центнер)'] = {
        '|-Плантации кофейного дерева (гектар)':1/25,
        }

metadict_detail['Выращивание плодов дерева какао (центнер)'] = {
        # Среднемировой уровень -- 4 центнера какао-бобов с гектара (16 центнеров плодов)
        '|-Плантации дерева какао (гектар)':1/15,
        }

metadict_detail['Выращивание Сахарный тростник (центнер)'] = {
        # Культура сахарного тростника в СССР:
            # http://www.activestudy.info/kultura-saxarnogo-trostnika-v-sssr/
        '|-Поля сахарного тростника (гектар)':1/300,
        }

metadict_detail['Выращивание Чайные листья (центнер)'] = {
        '|-Плантации чая (гектар)':1/50,
        }

#----
# Древесина:

metadict_detail['Ивовые прутья (тонн)'] = {
        '|-Плантации ивы прутовидной (гектар)':1/5,
        }

#----
# Культуры, упрощение:

metadict_detail['|-Плантации ивы прутовидной (гектар)'] = {
        # Исправить
            # Так-то достаточно дикйо чёрной ивы.
        # Глава 5. Выращивание сырья для производства лозовых изделий
        # http://splesti.ru/books/item/f00/s00/z0000004/st023.shtml
        '|-Ива прутовидная (Salix viminalis)':10000 / (0.8 * 0.25),
        '|--Лесничества (гектар)':1,
        }

metadict_detail['|-Виноградники (гектар)'] = {
        # Трудозатраты -- 100 дней на гектар (один рабочий на гектар).
        # http://vinograd.info/info/vinogradarstvo-po-novomy/zatraty-tryda-pri-vysokoshtambovoi-kyltyre.html
        '|-Виноград культурный (Vítis vinífera)':10000 / (3.5 * 1.2),
        #'_-Работа виноградовода (нормо-часов)':800,
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Оливковые сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Вишнёвые сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Грушёвые сады (гектар)'] = {
        '|--Фруктовые сады (гектар)':1,
        }

metadict_detail['|-Яблоневые сады (гектар)'] = {
        # Деревья высотой около 3 метров, посадка 3x3
        # https://vignette.wikia.nocookie.net/mlp/images/4/4d/Twilight_bucking_apples_S1E4.png
        # Уход за садом (14 дней/гектар) и уборка яблок (6 дней на гектар):
        # http://mehanik-ua.ru/tekhnologicheskie-karty/1470-tekhnologicheskaya-karta-vyrashchivaniya-yablok.html
        '|-Яблоня карликовая (Malus pumila)':10000 / (3.2 * 3.2),
        '|--Фруктовые сады (гектар)':1,
        }

#metadict_detail['|-Кленовые леса (гектар)'] = {
#        '|-Клён серебристый (Ácer sacchárinum)':100,
#        '|--Лесничества (гектар)':1,
#        }

metadict_detail['|-Плантации кофейного дерева (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации дерева какао (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Плантации чая (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Поля сахарного тростника (гектар)'] = {
        '|--Плантации в Эверглейдсе (гектар)':1,
        }

metadict_detail['|-Поля арахиса (гектар)'] = {
        '|--Поля бобовых (гектар)':1,
        }

metadict_detail['|-Поля батата (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля капусты (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля картофеля (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля конопли (гектар)'] = {
        '|--Поля технических культур (гектар)':1,
        }

metadict_detail['|-Поля льна (гектар)'] = {
        '|--Поля технических культур (гектар)':1,
        }

metadict_detail['|-Поля горчицы белой (гектар)'] = {
        '|--Поля технических культур (гектар)':1,
        }

metadict_detail['|-Поля моркови (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля овса (гектар)'] = {
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля кукурузы (гектар)'] = {
        # https://vignette.wikia.nocookie.net/mlp/images/b/b2/Applejack_harvesting_corn_S2E01.png
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля подсолнечника (гектар)'] = {
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля пшеницы (гектар)'] = {
        '|--Поля зерновых (гектар)':1,
        }

metadict_detail['|-Поля репы (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля перца сладкого (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля лука репчатого (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля столовой свёклы (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля сои (гектар)'] = {
        '|--Поля бобовых (гектар)':1,
        }

metadict_detail['|-Поля томатов (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля тыквы (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля кабачка (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля огурцов (гектар)'] = {
        '|--Овощные огороды (гектар)':1,
        }

metadict_detail['|-Поля красной фасоли (гектар)'] = {
        '|--Поля бобовых (гектар)':1,
        }

#metadict_detail['|-Сбор дикорастущих растений (гектар)'] = {
#        '|--Сенокосы (гектар)':1,
#        }

#----
# Трудозатраты (оценочно):
    # ТИПОВЫЕ НОРМЫ ВЫРАБОТКИ НА РУЧНЫЕ РАБОТЫ В ПОЛЕВОДСТВЕ И ОВОЩЕВОДСТВЕ
    # http://www.libussr.ru/doc_ussr/usr_12301.htm
    # ТИПОВЫЕ НОРМЫ ВЫРАБОТКИ НА МЕХАНИЗИРОВАННЫЕ И РУЧНЫЕ РАБОТЫ В САДОВОДСТВЕ
    # http://www.libussr.ru/doc_ussr/usr_14391.htm

metadict_detail['|--Лесничества (гектар)'] = {
        # Исправить
            # Найти нормативы на уход за лесом.
            # А пока один лесник на 200 гектаров.
        '|---Леса (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа лесника (нормо-часов)':8,
        }

metadict_detail['|--Фруктовые сады (гектар)'] = {
        # Исправить
            # Это только плодоносящие сады. Есть ещё сады молодых растений.
            # На самом деле сад требует куда больше работы.
            # Обрезка деревьев, высадка новых.
        # ТИПОВЫЕ НОРМЫ ВЫРАБОТКИ НА МЕХАНИЗИРОВАННЫЕ И РУЧНЫЕ РАБОТЫ В САДОВОДСТВЕ, ВИНОГРАДАРСТВЕ И ПИТОМНИКОВОДСТВЕ
        # http://www.libussr.ru/doc_ussr/usr_14391.htm
        # Технологическая карта, выращивание яблок:
        # http://mehanik-ua.ru/tekhnologicheskie-karty/1470-tekhnologicheskaya-karta-vyrashchivaniya-yablok.html
        # Уход за садом (14 дней/гектар) и уборка яблок (6 дней на гектар). Всего 20 дней/гектар
        '|---Сады (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа в саду (нормо-часов)':320,
        }

metadict_detail['|--Овощные огороды (гектар)'] = {
        # Гектар картофеля (без механизации) -- 830 нормо-часов (100 рабочих дней)
        # С минимальной механизацией (плуг, картофелесажалка) -- 500 нормо-часов (60 рабочих дней)
        '|---Огороды (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа на огороде (нормо-часов)':700,
        }

metadict_detail['|--Поля бобовых (гектар)'] = {
        # Исправить.
            # Не учтён обмолот и перевозка урожая.
            # Гектар фасоли (без механизации) -- 465 нормо-часов (58 рабочих дней)
        '|---Пашня (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа на полях бобовых (нормо-часов)':465,
        }

metadict_detail['|--Поля зерновых (гектар)'] = {
        # Гектар зерновых (вспашка с плугом и волами) -- 400 нормо-часов (50 рабочих дней)
        '|---Пашня (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа на полях зерновых (нормо-часов)':400,
        }

metadict_detail['|--Поля технических культур (гектар)'] = {
        '|---Пашня (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа на полях технических культур (нормо-часов)':480,
        }

metadict_detail['|--Плантации в Эверглейдсе (гектар)'] = {
        # Дальние владения Эквестрии, пашут зебры.
        '|---Плантации (гектар)':1,
        '_-Работа зебр на плантациях (нормо-часов)':500,
        }

metadict_detail['|-Медоносные луга (гектар)'] = {
        # Старые заметки:
            # Один гектар -- одна пчелиная семья.
            # Один пасечник -- 40 пчелосемей (1000 кг мёда); 40 га лугов (5 дней/гектар).
        # ГЛАВА VII. НАУЧНАЯ ОРГАНИЗАЦИЯ ТРУДА В ПЧЕЛОВОДСТВЕ:
            # http://paseka.su/books/item/f00/s00/z0000047/st029.shtml
            # Таблица 21. Нормативы времени овслуживлния в пчеловодстве (по данным госкомтруда СССР, 1976 г.)
            # Одна пчелосемья -- 831 минута/год (14 нормо-часов, 2 дней/гектар)
        '|-Пчелиная семья (Ápis melliféra)':1,
        '|---Луга (гектар)':1,
        '|----Обжитые земли (гектар)':1,
        '_-Работа пчеловода (нормо-часов)':20,
        }

metadict_detail['|-Сбор дикорастущих растений (гектар)'] = {
        # Клевер, ромашка, одуванчик, фенхель. На тех же медоносных лугах (5 дней/гектар).
        '_-Работа на сборе дикорастущих трав (нормо-часов)':40,
        }

#----
# Обжитые земли: 

metadict_detail['|----Обжитые земли (гектар)'] = {
        # Исправить
            # Теперь нужно узнать радиус круга полей.
            # Проблема в том, что скрипт не умеет в корни.
        '|----Обжитые земли (квадратный километр)':1 / 100,
        }
