#----
# Необходимое количество инструментов (по их использованию):

metadict_detail['Использование миски для еды (часов/килограмм)'] = {
        # Одна порция --  0.5 килограмма (посуда используется на 50%)
        'Использование 1-литровой миски для еды (часов)':1 / 0.5,
        }

metadict_detail['Использование кружки для питья (часов/литр)'] = {
        # Собственно кружкой называется мера объёма -- 1/8 ведра, 1.5 литра.
        'Использование 1.5-литровой кружки для питья (часов)':1 / 0.66,
        }

metadict_detail['Использование бочки для брожения виноградного сусла (часов/килограмм)'] = {
        'Использование 100-литровой бочки для брожения виноградного сусла (часов)':1 / 100,
        }

metadict_detail['Использование бочки для брожения яблочного сусла (часов/килограмм)'] = {
        'Использование 100-литровой бочки для брожения яблочного сусла (часов)':1 / 100,
        }

metadict_detail['Использование винтового пресса (часов/килограмм)'] = {
        # Не заполняется больше чем на 50%
        'Использование 50-литрового механического винтового пресса (часов)':1 / 50 / 0.5,
        }

metadict_detail['Использование вальцевого пресса (часов/килограмм)'] = {
        # Не заполняется больше чем на 75%
        'Использование 50-литрового механического вальцевого пресса (часов)':1 / 50 / 0.75,
        }

metadict_detail['Использование горшка для варки каши (часов/килограмм)'] = {
        # Посуда заполняется на 75%
        'Использование 5-литрового чугунка для варки каши (часов)':1 / 5 / 0.75,
        }

metadict_detail['Использование горшка для варки корнеплодов (часов/килограмм)'] = {
        'Использование 5-литрового чугунка для варки корнеплодов (часов)':1 / 5 / 0.75,
        }

metadict_detail['Использование горшка для варки компота (часов/килограмм)'] = {
        'Использование 5-литрового чугунка для варки компота (часов)':1 / 5 / 0.75,
        }

metadict_detail['Использование стола для нарезки фруктов (часов/килограмм)'] = {
        'Использование 1800x600 стола для нарезки фруктов (часов)':1,
        }

metadict_detail['Использование стола для рубки овощей (часов/килограмм)'] = {
        'Использование 1800x600 стола для рубки овощей (часов)':1,
        }

metadict_detail['Использование стола для чистки корнеплодов (часов/килограмм)'] = {
        'Использование 1800x600 стола для чистки корнеплодов (часов)':1,
        }

metadict_detail['Использование стола для чистки овощей (часов/килограмм)'] = {
        'Использование 1800x600 стола для чистки овощей (часов)':1,
        }

metadict_detail['Использование стола для чистки фруктов (часов/килограмм)'] = {
        'Использование 1800x600 стола для чистки фруктов (часов)':1,
        }

metadict_detail['Использование стола для ферментации чайных листьев (часов/килограмм)'] = {
        'Использование 1800x600 стола для ферментации чайных листьев (часов)':1 / 50,
        }

metadict_detail['Использование кадки для брожения теста (часов/килограмм)'] = {
        # Кадка заполняется на 25%
        'Использование 50-литровой квашни для брожения теста (часов)':1 / 0.25 / 50,
        }

metadict_detail['Использование кадки для заваривания теста (часов/килограмм)'] = {
        # Кадка заполняется на 25%
        'Использование 50-литровой квашни для заваривания теста (часов)':1 / 0.25 / 50,
        }

metadict_detail['Использование кадки для квашения капусты (часов/килограмм)'] = {
        # Кадка заполняется на 90%
        'Использование 100-литровой кадки для квашения капусты (часов)':1 / 0.90 / 100,
        }

metadict_detail['Использование кадки для консервации овощей (часов/килограмм)'] = {
        'Использование 100-литровой кадки для консервации овощей (часов)':1 / 0.90 / 100,
        }

metadict_detail['Использование кадки для консервации фруктов (часов/килограмм)'] = {
        'Использование 100-литровой кадки для консервации фруктов (часов)':1 / 0.90 / 100,
        }

metadict_detail['Использование ведра для сбора кленового сока (часов/килограмм)'] = {
        # Ведро заполняется на 75%
        'Использование 10-литрового ведра для сбора кленового сока (часов)':1 / 0.75 / 10,
        }

metadict_detail['Использование уголка для сбора кленового сока (часов/килограмм)'] = {
        'Использование уголка для сбора кленового сока (часов)':1 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья посуды (часов/килограмм)'] = {
        # Расход воды -- 1 литр на килограмм употреблённой пищи.
        'Использование 10-литрового ведра для мытья посуды (часов)':1 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья корнеплодов (часов/килограмм)'] = {
        # Расход воды -- 3 литра на килограмм.
        'Использование 10-литрового ведра для мытья корнеплодов (часов)':3 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья овощей (часов/килограмм)'] = {
        'Использование 10-литрового ведра для мытья овощей (часов)':3 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья сухофруктов (часов/килограмм)'] = {
        'Использование 10-литрового ведра для мытья сухофруктов (часов)':3 / 0.75 / 10,
        }

metadict_detail['Использование ведра для мытья фруктов (часов/килограмм)'] = {
        'Использование 10-литрового ведра для мытья фруктов (часов)':3 / 0.75 / 10,
        }

metadict_detail['Использование листа для вяления чайных листьев (часов/килограмм)'] = {
        # Слой 50 миллиметров, объём слоя 0.05 кубометра, масса (сырого) -- 50 килограмм
        'Использование 1800x600 листа для вяления чайных листьев (часов)':1 / 50,
        }

metadict_detail['Использование листа для сушки растений (часов/килограмм)'] = {
        'Использование 1800x600 листа для сушки растений (часов)':1 / 50,
        }

metadict_detail['Использование листа для сушки фруктов (часов/килограмм)'] = {
        'Использование 1800x600 листа для сушки фруктов (часов)':1 / 50,
        }

metadict_detail['Использование листа для сушки солода (часов/килограмм)'] = {
        'Использование 1800x600 листа для сушки солода (часов)':1 / 50,
        }

metadict_detail['Использование маслоотжимного пресса (часов/килограмм)'] = {
        # Исправить
            # На самом деле немеханизированные маслоотжимные прессы менее эффективны.
        # Не заполняется больше чем на 50%
        'Использование 50-литрового механического винтового пресса (часов)':1 / 50 / 0.5,
        }

metadict_detail['Использование мельницы (часов/килограмм)'] = {
        # 20-70 килограмм в час, одна пара жерновов
        'Использование 50-кг/час ветряной мельницы (часов)':1 / 50,
        }

metadict_detail['Использование колодца (часов/тонн)'] = {
        # Расход воды 1 тонна/час
        'Использование 1-тонн/час шахтного колодца (часов)':1,
        }

metadict_detail['Использование механизированной лесопильной рамы (часов/кубометр)'] = {
        # http://saper.isnet.ru/texnica/lrv.html
            # Производство: 50 кубометров бруса и доски в сутки; Расчёт: 8 бойцов.
        'Использование 5-кубометров/час механизированной лесопильной рамы (часов)':12/60,
        }

metadict_detail['Использование механической глиномялки (часов/кубометр)'] = {
        # Исправить
            # В реальности используют лошадиную силу. Но и пегаска сойдёт.
        # 5-6 кубометров глины за 8-часовую смену:
        # http://www.arhplan.ru/materials/bricks/dobycha-i-podgotovka-gliny-dlya-kirpicha
        'Использование 0.5-кубометра/час механической глиномялки (часов)':2,
        }

metadict_detail['Использование штабелей для сушки кирпича (часов/кубометр)'] = {
        # 3000 кирпичей в штабеле -- 6 кубометров:
        'Использование 6-кубометровых штабелей для сушки кирпича (часов)':1 / 6,
        }

metadict_detail['Использование штабелей для обжига кирпича (часов/кубометр)'] = {
        # 3000 кирпичей в штабеле -- 6 кубометров:
        'Использование 6-кубометровых штабелей для обжига кирпича (часов)':1 / 6,
        }

metadict_detail['Использование соломенного мата для замачивания глины (часов/кубометр)'] = {
        # Глину выкладывают слоем в 0.5 метра, так что нужно два мата на кубометр.
        'Использование 1000x1000 соломенного мата (часов)':2,
        }

metadict_detail['Использование немеханизированных жерновов (часов/килограмм)'] = {
        # 1 килограмм/час
        'Использование 1-кг/час немеханизированных жерновов (часов)':1,
        }

metadict_detail['Использование ножа для рубки овощей (часов/килограмм)'] = {
        'Использование ножа для рубки овощей (часов)':1,
        }

metadict_detail['Использование ножа для чистки корнеплодов (часов/килограмм)'] = {
        'Использование ножа для чистки корнеплодов (часов)':1,
        }

metadict_detail['Использование ножа для чистки овощей (часов/килограмм)'] = {
        'Использование ножа для чистки овощей (часов)':1,
        }

metadict_detail['Использование ножа для чистки фруктов (часов/килограмм)'] = {
        'Использование ножа для чистки фруктов (часов)':1,
        }

metadict_detail['Использование посуды для замачивания пшеницы (часов/килограмм)'] = {
        'Использование 5-литровой миски для замачивания пшеницы (часов)':1 / 5,
        }

metadict_detail['Использование посуды для проращивания пшеницы (часов/килограмм)'] = {
        'Использование 5-литровой миски для проращивания пшеницы (часов)':1 / 5,
        }

metadict_detail['Использование самовара (часов/килограмм)'] = {
        'Использование 5-литрового самовара (часов)':1 / 5,
        }

metadict_detail['Использование сковороды для обжаривания арахиса (часов/килограмм)'] = {
        # Сковорода с диаметром 30 см и глубиной 10 см, объём 7 литров, используется на 50%
        'Использование 300x100 сковороды для обжаривания арахиса (часов)':1 / 0.5 / 7,
        }

metadict_detail['Использование сковороды для обжаривания кофе (часов/килограмм)'] = {
        'Использование 300x100 сковороды для обжаривания кофе (часов)':1 / 0.5 / 7,
        }

metadict_detail['Использование сковороды для обжаривания семян (часов/килограмм)'] = {
        'Использование 300x100 сковороды для обжаривания семян (часов)':1 / 0.5 / 7,
        }

metadict_detail['Использование таза для выварки кленового сиропа (часов/килограмм)'] = {
        # Исправить.
            # Таки считай через кленовый сок, неудобно же!
        # Таз с диаметром 60 см и глубиной 20 см, объём 50 литров, используется на 75%
        'Использование 50-литрового таза для выварки кленового сиропа (часов)':1 / 0.75,
        }

metadict_detail['Использование таза для варки яблочного джема (часов/килограмм)'] = {
        'Использование 50-литрового таза для варки яблочного джема (часов)':1 / 0.75 / 50,
        }

metadict_detail['Использование чана для конширования шоколада (часов/килограмм)'] = {
        'Использование 300-литрового чана для конширования шоколада (часов)':1 / 0.75 / 300,
        }

metadict_detail['Использование чана для выпаривания сахарного тростника (часов/килограмм)'] = {
        'Использование 300-литрового чана для выпаривания сахарного тростника (часов)':1 / 0.75 / 300,
        }

metadict_detail['Использование печи для выпечки хлеба (часов/килограмм)'] = {
        # Исправить
            # Таки посчиатай через объём
            # Размер устья 0.5x0.35 метров
            # Хлеба 10 килограмм (10% объёма)
        'Использование дровяной печи (часов)':1 / 10,
        }

metadict_detail['Использование печи для выпечки пряников (часов/килограмм)'] = {
        # На противень тонким слоем
        'Использование дровяной печи (часов)':1,
        }

metadict_detail['Использование печи для выпечки овсяного печенья (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1,
        }

metadict_detail['Использование печи для варки каши (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 10,
        }

metadict_detail['Использование печи для варки компота (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 10,
        }

metadict_detail['Использование печи для варки корнеплодов (часов/килограмм)'] = {
        'Использование дровяной печи (часов)':1 / 10,
        }

#----
# Необходимое количество инструментов (хранение товаров):

metadict_detail['Использование бочки для хранения воды (часов/литр)'] = {
        'Использование 100-литровой бочки для хранения воды (часов)':1 / 100,
        }

metadict_detail['Использование бочки для хранения продовольствия (часов/литр)'] = {
        'Использование 100-литровой бочки для хранения продовольствия (часов)':1 / 100,
        }

metadict_detail['Использование бочки для хранения промышленных товаров (часов/литр)'] = {
        'Использование 100-литровой бочки для хранения промышленных товаров (часов)':1 / 100,
        }

metadict_detail['Использование ведра для хранения кленового сока (часов/литр)'] = {
        # Исправить
            # Вёдра уже используются на сборе кленового сока.
        }

metadict_detail['Использование мешка для хранения продовольствия (часов/литр)'] = {
        'Использование 20-литрового мешка для хранения продовольствия (часов)':1 / 20,
        }

metadict_detail['Использование мешка для хранения промышленных товаров (часов/литр)'] = {
        'Использование 20-литрового мешка для хранения промышленных товаров (часов)':1 / 20,
        }

metadict_detail['Использование корзины для хранения продовольствия (часов/литр)'] = {
        'Использование 100-литровой корзины для хранения продовольствия (часов)':1 / 100,
        }

metadict_detail['Использование ящика для хранения несыпучих грузов (часов/литр)'] = {
        # Исправить
            # Не используется. А стоило бы.
        'Использование 100-литрового ящика для хранения несыпучих грузов (часов)':1 / 100,
        }

metadict_detail['Использование ящика для хранения сыпучих грузов (часов/литр)'] = {
        # Исправить
            # Не используется
        'Использование 100-литрового ящика для хранения сыпучих грузов (часов)':1 / 100,
        }

#----
# Необходимое количество инструментов (группировка):

metadict_detail['Использование 1-кг/час немеханизированных жерновов (часов)'] = {
        # Исправить
            # Кофемолка. Нужна ли? Пусть будет механизм.
        # Каждый месяц один час на помол зёрен для кофе
        # Используется каждую неделю (понячья неделя -- 6 дней):
        '|Немеханизированные жернова (1-кг/час)':1 / (360/6),
        }

metadict_detail['Использование 5-литрового чугунка для варки каши (часов)'] = {
        # Исправить
            # Нужно добавить коэффициент частоты использования.
            # Хотя, этот параметр сильно зависит от богатства.
            # Тогда ставь пораметр "Нужен"
        # Используется каждый день (если нужен).
        '|Чугунок (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литрового чугунка для варки компота (часов)'] = {
        '|Чугунок (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литрового чугунка для варки корнеплодов (часов)'] = {
        '|Чугунок (5 литров)':1 / 360,
        }

metadict_detail['Использование 100-литровой бочки для брожения виноградного сусла (часов)'] = {
        # Вино хранится и перевозится в тех же бочках.
        '|Деревянная бочка (100 литров)':1 / (360*24),
        }

metadict_detail['Использование 100-литровой бочки для брожения яблочного сусла (часов)'] = {
        '|Деревянная бочка (100 литров)':1 / (360*24),
        }

metadict_detail['Использование 100-литровой кадки для квашения капусты (часов)'] = {
        # Капусту готовят за две недели, но хранят в кадках весь год.
        '|Деревянная кадка (100 литров)':1 / (24*14),
        }

metadict_detail['Использование 100-литровой кадки для консервации овощей (часов)'] = {
        '|Деревянная кадка (100 литров)':1 / (24*30),
        }

metadict_detail['Использование 100-литровой кадки для консервации фруктов (часов)'] = {
        '|Деревянная кадка (100 литров)':1 / (24*30),
        }

metadict_detail['Использование 10-литрового ведра для мытья корнеплодов (часов)'] = {
        # По пять минут каждый день?
        '|Деревянное ведро (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 10-литрового ведра для мытья овощей (часов)'] = {
        '|Деревянное ведро (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 10-литрового ведра для мытья сухофруктов (часов)'] = {
        '|Деревянное ведро (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 10-литрового ведра для мытья фруктов (часов)'] = {
        '|Деревянное ведро (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 10-литрового ведра для мытья посуды (часов)'] = {
        '|Деревянное ведро (10 литров)':1 / (360*(5/60)),
        }

metadict_detail['Использование 50-литровой квашни для брожения теста (часов)'] = {
        # 15 часов каждую неделю
        '|Деревянная кадка (50 литров)':1 / (60*15),
        }

metadict_detail['Использование 50-литровой квашни для заваривания теста (часов)'] = {
        # 15 дней каждый месяц
        '|Деревянная кадка (50 литров)':1 / (12*15*24),
        }

metadict_detail['Использование 1800x600 листа для вяления чайных листьев (часов)'] = {
        # Сезон сушки фруктов -- месяц.
        '|Сушильный лист (квадратный метр)':1 / (30*24),
        }

metadict_detail['Использование 1800x600 листа для сушки растений (часов)'] = {
        '|Сушильный лист (квадратный метр)':1 / (30*24),
        }

metadict_detail['Использование 1800x600 листа для сушки солода (часов)'] = {
        '|Сушильный лист (квадратный метр)':1 / (30*24),
        }

metadict_detail['Использование 1800x600 листа для сушки фруктов (часов)'] = {
        '|Сушильный лист (квадратный метр)':1 / (30*24),
        }

metadict_detail['Использование 1800x600 стола для нарезки фруктов (часов)'] = {
        # По часу каждый день
        '|Кухонный стол (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для рубки овощей (часов)'] = {
        '|Кухонный стол (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для ферментации чайных листьев (часов)'] = {
        '|Кухонный стол (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для чистки корнеплодов (часов)'] = {
        '|Кухонный стол (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для чистки овощей (часов)'] = {
        '|Кухонный стол (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 1800x600 стола для чистки фруктов (часов)'] = {
        '|Кухонный стол (квадратный метр)':1 / 360,
        }

metadict_detail['Использование 300x100 сковороды для обжаривания арахиса (часов)'] = {
        # По 10 минут каждую неделю.
        '|Кухонная сковорода (5 литров)':1 / ((360/6)*(10/60)),
        }

metadict_detail['Использование 300x100 сковороды для обжаривания кофе (часов)'] = {
        '|Кухонная сковорода (5 литров)':1 / ((360/6)*(10/60)),
        }

metadict_detail['Использование 300x100 сковороды для обжаривания семян (часов)'] = {
        '|Кухонная сковорода (5 литров)':1 / ((360/6)*(10/60)),
        }

metadict_detail['Использование 5-литрового самовара (часов)'] = {
        # По часу каждый день
        '|Самовар (5 литров)':1 / 360,
        }

metadict_detail['Использование 5-литровой миски для замачивания пшеницы (часов)'] = {
        # Один раз в год
        '|Миска (5 литров)':1 / 24,
        }

metadict_detail['Использование 5-литровой миски для проращивания пшеницы (часов)'] = {
        '|Миска (5 литров)':1 / (24 * 2),
        }

metadict_detail['Использование 50-кг/час ветряной мельницы (часов)'] = {
        # Работает по 16 часов, 200 дней в году.
        '|Ветряная мельница (50-кг/час)':1 / (16 * 200),
        }

metadict_detail['Использование 1-тонн/час шахтного колодца (часов)'] = {
        # Используется по 8 часов, 360 дней в году.
        '|Шахтный колодец (тонна/час)':1 / (8 * 360),
        }

metadict_detail['Использование 50-литрового механического винтового пресса (часов)'] = {
        # Работает по 8 часов, 30 дней в сезон сбора фруктов.
        '|Механический винтовой пресс (50 литров)':1 / (8 * 30),
        }

metadict_detail['Использование 50-литрового механического вальцевого пресса (часов)'] = {
        # Завод по переработке сахарного тростника работает в две смены
        '|Механический вальцевый пресс (50 литров)':1 / (200 * 16),
        }

metadict_detail['Использование дровяной печи (часов)'] = {
        # Исправить
            # Расход дров у тебя слишком уж зимний.
        # Как топить русскую печь: Теплушка - правила эксплуатаци
            # http://kirpichiki.pro/read/articles/teplushka-expluataciya.html
            # http://kirpichiki.pro/assets/images/gallery/pechi/krep_bashnia/020_conv.jpg
        # Две топки в день по 22 килограмма дров (22-44 кубических дециметра).
        '|Дровяная печь (5.5 кВт)':1 / 360,
        #'Теплоотдача печи (кВт*час)':5.5,
        'Дрова (килограмм)':22,
        }

metadict_detail['Использование ножа для нарезки фруктов(часов/килограмм)'] = {
        # Работает по часу каждый день.
        '|Кухонный нож':1 / 360,
        }

metadict_detail['Использование ножа для рубки овощей (часов)'] = {
        '|Кухонный нож':1 / 360,
        }

metadict_detail['Использование ножа для чистки корнеплодов (часов)'] = {
        '|Кухонный нож':1 / 360,
        }

metadict_detail['Использование ножа для чистки овощей (часов)'] = {
        '|Кухонный нож':1 / 360,
        }

metadict_detail['Использование ножа для чистки фруктов (часов)'] = {
        '|Кухонный нож':1 / 360,
        }

metadict_detail['Использование уголка для сбора кленового сока (часов)'] = {
        # Сезон длится 15 дней (март-апрель),
        # с дерева 40 литров; 4 отверстия, 2 литра/день (5 дней, 1/3 сезона).
        '|Уголок для сбора кленового сока':1 / (15*5*3),
        }

metadict_detail['Использование 10-литрового ведра для сбора кленового сока (часов)'] = {
        # Сезон длится 15 дней (март-апрель),
        # с дерева 40 литров; 4 отверстия, 2 литра/день (5 дней, 1/3 сезона).
        '|Деревянное ведро (10 литров)':1 / (15*5*3),
        }

metadict_detail['Использование 50-литрового таза для выварки кленового сиропа (часов)'] = {
        # Сезон длится 14 дней, циклы варки по 15 часов.
        '|Металлический таз (50 литров)':1 / (14*15),
        }

metadict_detail['Использование 50-литрового таза для варки яблочного джема (часов)'] = {
        # Перерабатывают яблоки 30 дней после сбора урожая.
        '|Металлический таз (50 литров)':1 / (30*8),
        }

metadict_detail['Использование 300-литрового чана для конширования шоколада (часов)'] = {
        '|Металлический чан (300 литров)':1 / (200 * 8),
        }

metadict_detail['Использование 300-литрового чана для выпаривания сахарного тростника (часов)'] = {
        '|Металлический чан (300 литров)':1 / (200 * 16),
        }

metadict_detail['Использование 1-литровой миски для еды (часов)'] = {
        # По два часа каждый день
        '|Миска для еды (литр)':1 / (360*2),
        }

metadict_detail['Использование 1.5-литровой кружки для питья (часов)'] = {
        '|Кружка для питья (1.5 литра)':1 / (360*2),
        }

metadict_detail['Использование 10-литрового ведра для воды (часов)'] = {
        '|Деревянное ведро (10 литров)':1 / 360,
        }

metadict_detail['Использование 100-литровой кадки для воды (часов)'] = {
        '|Деревянная кадка (100 литров)':1 / 360,
        }

metadict_detail['Использование 100-литровой бочки для перевозки воды (часов)'] = {
        '|Деревянная бочка (100 литров)':1 / 360,
        }

metadict_detail['Использование 10-литрового ведра для переноски воды (часов)'] = {
        '|Деревянное ведро (10 литров)':1 / 360,
        }

metadict_detail['Использование граблей для перемешивания глины (часов)'] = {
        '|Грабли':1 / (200 * 8),
        }

metadict_detail['Использование топора для колки дров (часов)'] = {
        '|Топор':1 / 360,
        }

metadict_detail['Использование топора для колки дров (часов)'] = {
        '|Топор':1 / 360,
        }

metadict_detail['Использование топора для колки пней на смоляк (часов)'] = {
        '|Топор':1 / (200 * 8),
        }

metadict_detail['Использование киркомотыги для корчёвки сосновых пней (часов)'] = {
        '|Киркомотыга':1 / (200 * 8),
        }

metadict_detail['Использование лопаты для перемещения глины (часов)'] = {
        '|Большая лопата':1 / (200 * 8),
        }

metadict_detail['Использование грузовой тележки (часов)'] = {
        '|Грузовая тележка (груз 100 кг)':1 / (200 * 8),
        }

metadict_detail['Использование грузовой телеги (часов)'] = {
        '|Грузовая телега (груз 1000 кг)':1 / (200 * 8),
        }

metadict_detail['Использование тележки с отвалом для земляных работ (часов)'] = {
        '|Тележка (отвал)':1 / (200 * 8),
        }

metadict_detail['Использование тележки с отвалом для перемещения глины (часов)'] = {
        '|Тележка (отвал)':1 / (200 * 8),
        }

metadict_detail['Использование 0.5-кубометра/час механической глиномялки (часов)'] = {
        '|Механическая глиномялка (0.5-кубометра/час)':1 / (200 * 8),
        }

metadict_detail['Использование 8-кубометровой смоляной печи (часов)'] = {
        # исправить
            # Печь таки не работает круглые сутки.
            # Её ведь перезагружать нужно!
        '|Смоляная печь (6 литров/час)':1 / (200 * 24),
        }

metadict_detail['Использование 1000x1000 соломенного мата (часов)'] = {
        '|Соломенный мат (квадратный метр)':1 / (200 * 24),
        }

metadict_detail['Использование прямоугольного мундштука для глиномялки (часов)'] = {
        # Исправить
            # Эта фигня, вообще, нужна?
        }

metadict_detail['Использование станка для резки кирпича (часов)'] = {
        '|Станок для резки кирпича':1 / (200 * 8),
        }

metadict_detail['Использование 6-кубометровых штабелей для сушки кирпича (часов)'] = {
        # Сушка длится 15 суток:
        '|Штабель для сушки кирпича':1 / (24 * 15),
        }

metadict_detail['Использование 6-кубометровых штабелей для обжига кирпича (часов)'] = {
        # Обжиг длится 200 часов:
        '|Штабель для обжига кирпича':1 / 200,
        }

metadict_detail['Использование 5-кубометров/час механизированной лесопильной рамы (часов)'] = {
        # Лесопилка работает в две смены, 300 дней в году.
        '|Механизированная лесопильная рама (5-кубометров/час)':1 / (8*2*300),
        }

metadict_detail['Использование грузового планёра (часов)'] = {
        '|Грузовой планёр (груз 100 кг)':1 / (200*8),
        }

metadict_detail['Использование грузового поезда (часов)'] = {
        # Исправить
            # Вообще-то поезда могут гонять и день и ночь
        '|Грузовой поезд (груз 400 тонн)':1 / (200*16),
        }

metadict_detail['Использование грузового барка (часов)'] = {
        # Исправить
            # Парусные суда. Каков сезон навигации?
        '|Грузовой барк (груз 1400 тонн)':1 / (200*24),
        }

metadict_detail['Использование грузовой баржи (часов)'] = {
        # Исправить
            # Пегаско-двигательные плоскодонки. Крылатые пашут в две смены.
            # Таки реки в Эквестрии замерзают, или всё же нет?
        '|Грузовая баржа (груз 200 тонн)':1 / (200*16),
        }

metadict_detail['Использование 100-литрового ящика для хранения несыпучих грузов (часов)'] = {
        # Исправить
            # Не используется
        '|Решётчатый деревянный ящик (100 литров)':1 / (360*24),
        }

metadict_detail['Использование 100-литрового ящика для хранения сыпучих грузов (часов)'] = {
        # Исправить
            # Не используется
        '|Щитовой деревянный ящик (100 литров)':1 / (360*24),
        }

metadict_detail['Использование 100-литровой бочки для хранения воды (часов)'] = {
        '|Деревянная бочка (100 литров)':1 / (360*24),
        }

metadict_detail['Использование 100-литровой бочки для хранения продовольствия (часов)'] = {
        '|Деревянная бочка (100 литров)':1 / (360*24),
        }

metadict_detail['Использование 100-литровой бочки для хранения промышленных товаров (часов)'] = {
        '|Деревянная бочка (100 литров)':1 / (360*24),
        }

metadict_detail['Использование 20-литрового мешка для хранения продовольствия (часов)'] = {
        '|Холщёвый мешок (20 литров)':1 / (360*24),
        }

metadict_detail['Использование 20-литрового мешка для хранения промышленных товаров (часов)'] = {
        '|Холщёвый мешок (20 литров)':1 / (360*24),
        }

metadict_detail['Использование 100-литровой корзины для хранения продовольствия (часов)'] = {
        '|Плетёная корзина (100 литров)':1 / (360*24),
        }
