#----
# Тара (литры)
# Насыпная плотность сыпучих материалов
    # http://alurtrend.com.ua/spip.php?article24
# Объём к массе (кубометр/тонна):
    # http://www.libussr.ru/doc_ussr/usr_14950.htm
    # Мука, крупы -- 1.33-1.75
    # Фрукты, овощи -- 2.34-2.45
    # Консервы всякие -- 2.0-2.15
    # Изделия макаронные -- 4.42-5.24
    # Товары галантерейные -- 2.83
    # Машины стиральные -- 2.45
    # Ткань всякая -- 2.8-3.0
    # Одеяла -- 4.6-6.14
    # Мебель -- 4.6-8.0

metadict_detail['|=Бочка арахисового масла (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка вина (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка кленового сиропа (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка конопляного масла (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка льняного масла (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка мёда (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка оливкового масла (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка подсолнечного масла (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка соевого масла (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка какао-масла (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка яблочного сидра (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка квашеной капусты (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка консервированной свёклы (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка консервированных кабачков (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка консервированных огурцов (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка консервированных томатов (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка мочёной вишни (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка мочёных груш (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка мочёных яблок (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок изюма (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок овсяной муки (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок овсяной крупы (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок арахиса (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок кукурузной крупы (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок пшеничного солода (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок пшеничной муки (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок соевых бобов (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок сухой горчицы (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок какао-порошка (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок сухой фасоли (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок сушёной вишни (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок сушёной груши (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок сушёных трав (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок сушёных яблок (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок соли (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок тростникового сахара (килограмм)'] = {
        # Сахар рафинируют в Эквестрии
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка дёгтя (килограмм)'] = {
        '|==Стройматериалы (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок извести негашёной (килограмм)'] = {
        # Исправить
            # Добавь отдельную категорию
        '|==Стройматериалы (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок цемента М400 (килограмм)'] = {
        '|==Стройматериалы (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка промышленных товаров (нетто) (килограмм)':1,
        }

#----
# Импорт:

metadict_detail['|=Корзина тростникового сахара-сырца (килограмм)'] = {
        # Импорт из Эверглейдса
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Импорт продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина кофейных зёрен (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Импорт продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок какао-бобов (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Импорт продовольствия (нетто) (килограмм)':1,
        }

metadict_detail['|=Мешок сушёных чайных листьев (килограмм)'] = {
        '|==Продовольствие (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Импорт продовольствия (нетто) (килограмм)':1,
        }

#----
# Местные перевозки, город-деревня:

metadict_detail['|=Ведро питьевой воды (килограмм)'] = {
        # Исправить.
            # Тут работает водопровод.
            # Либо пони тащит воду от колодца до дома.
            # А ещё есть водосток, это сотня литров при осадках в 2 мм/сутки и крыше 8x6 метров.
        '|==Вода (тонн)':1 / 1000,
        #'|====Грузов произведено (тонн)':1 / 1000,
        'Доставка воды для хозяйства (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка хозяйственной воды (килограмм)'] = {
        '|==Вода (тонн)':1 / 1000,
        #'|====Грузов произведено (тонн)':1 / 1000,
        'Доставка воды для хозяйства (нетто) (килограмм)':1,
        }

metadict_detail['|=Бочка промышленной воды (килограмм)'] = {
        '|==Вода (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка воды для промышленности (нетто) (килограмм)':1,
        }

metadict_detail['|=Ведро кленового сока (килограмм)'] = {
        '|==Сырьё (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина дикорастущих растений (килограмм)'] = {
        '|==Сырьё (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка грузов от ближайшего леса (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина батата (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина винограда (килограмм)'] = {
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина вишни (килограмм)'] = {
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина груш (килограмм)'] = {
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина кабачка (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина капусты белокочанной (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина картофеля (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина красной фасоли в стручках (килограмм)'] = {
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина соевых бобов в стручках (килограмм)'] = {
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина лука репчатого (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина моркови (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина огурцов (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина перца сладкого (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина початков кукурузы (килограмм)'] = {
        # Исправить
            # Конечно, кукуруза нифига не зернобобовые.
            # Но, блин, початки требуется обработать и зёрна просушить!
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина сахарной свёклы (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина томатов (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина тыквы (килограмм)'] = {
        '|==Овощи (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка овощей (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина чайных листьев (килограмм)'] = {
        '|==Сырьё (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина яблок (килограмм)'] = {
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка фруктов (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина арахиса в шелухе (килограмм)'] = {
        '|==Зернобобовые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зернобобовых (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина зерна овса (килограмм)'] = {
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина плодов оливы (килограмм)'] = {
        # Так-то это масличное сырьё, но плоды перерабатывают на месте.
        '|==Фрукты (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина зерна пшеницы (килограмм)'] = {
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка зерновых (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина семян горчицы белой (килограмм)'] = {
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина семян конопли (килограмм)'] = {
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина семян льна (килограмм)'] = {
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина семян подсолнечника (килограмм)'] = {
        '|==Зерновые (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка масличного сырья (нетто) (килограмм)':1,
        }

metadict_detail['|=Корзина плодов какао (килограмм)'] = {
        '|==Сырьё (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (нетто) (килограмм)':1,
        }

metadict_detail['|=Связка сахарного тростника (килограмм)'] = {
        '|==Сырьё (тонн)':1 / 1000,
        '|====Грузов произведено (тонн)':1 / 1000,
        'Доставка сельскохозяйственного сырья (нетто) (килограмм)':1,
        }

#----
# Перевозка без тары:

metadict_detail['|=Кирпич (тонн)'] = {
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Пиломатериалы свежие (тонн)'] = {
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка стройматериалов (тонн)':1,
        }

metadict_detail['|=Глина (тонн)'] = {
        '|==Стройматериалы (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Круглый лес (тонн)'] = {
        '|==Сырьё (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Дрова (тонн)'] = {
        '|==Дрова (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка дров (тонн)':1,
        }

metadict_detail['|=Грунт (тонн)'] = {
        # Исправить
            # Ну и в какую категорию включить бесполезный чернозём?
        '|==Сырьё (тонн)':1,
        'Вывоз мусора (тонн)':1,
        }

metadict_detail['|=Опилки древесные (тонн)'] = {
        '|==Сырьё (тонн)':1,
        'Вывоз мусора (тонн)':1,
        }

metadict_detail['|=Сухая солома (тонн)'] = {
        '|==Сырьё (тонн)':1,
        'Вывоз мусора (тонн)':1,
        }

metadict_detail['|=Песок (тонн)'] = {
        '|==Сырьё (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }

metadict_detail['|=Смоляк (тонн)'] = {
        '|==Сырьё (тонн)':1,
        '|====Грузов произведено (тонн)':1,
        'Доставка строительного сырья (тонн)':1,
        }
