#----
# Готовы блюда, заготовки:

metadict_detail['Варёный картофель (килограмм)'] = {
        # Расчеты производительности и количества персонала для овощного цеха:
        # https://www.pitportal.ru/chef2010/10921.html
        'Картофель (килограмм)':1.25,
        'Вода для готовки (литр)':1,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Варёный батат (килограмм)'] = {
        'Батат (килограмм)':1.25,
        'Вода для готовки (литр)':1,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Варёная морковь (килограмм)'] = {
        'Морковь (килограмм)':1.2,
        'Вода для готовки (литр)':1,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Варёная свёкла (килограмм)'] = {
        'Свёкла столовая (килограмм)':1.25,
        'Вода для готовки (литр)':1,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Варёный лук (килограмм)'] = {
        'Лук репчатый (килограмм)':1.16,
        'Вода для готовки (литр)':1,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Яблоко мочёное (килограмм)'] = {
        # Годными считаются только 80% плодов.
        # Затраты свежих яблок - до 1100 кг на 1 г готового продукта
            # http://konservirovanie.su/books/item/f00/s00/z0000000/st010.shtml
        'Яблоко (килограмм)':1.3,
        'Рассол для мочения фруктов (килограмм)':1,
        '_-Домашняя консервация фруктов (килограмм)':1,
        '|=Бочка мочёных яблок (килограмм)':1 * 2,
        }

metadict_detail['Груша мочёная (килограмм)'] = {
        'Груша (килограмм)':1.3,
        'Рассол для мочения фруктов (килограмм)':1,
        '_-Домашняя консервация фруктов (килограмм)':1,
        '|=Бочка мочёных груш (килограмм)':1 * 2,
        }

metadict_detail['Вишня мочёная (килограмм)'] = {
        'Вишня (килограмм)':1.3,
        'Рассол для мочения фруктов (килограмм)':1,
        '_-Домашняя консервация фруктов (килограмм)':1,
        '|=Бочка мочёной вишни (килограмм)':1 * 2,
        }

metadict_detail['Кабачок консервированный (килограмм)'] = {
        'Кабачок (килограмм)':1.3,
        'Рассол для консервации овощей (килограмм)':1,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированных кабачков (килограмм)':1 * 2,
        }

metadict_detail['Огурцы консервированные (килограмм)'] = {
        'Огурцы (килограмм)':1.2,
        'Рассол для консервации овощей (килограмм)':1,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированных огурцов (килограмм)':1 * 2,
        }

metadict_detail['Томаты консервированные (килограмм)'] = {
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st007.shtml
        'Томаты (килограмм)':1.3,
        'Рассол для консервации овощей (килограмм)':1,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированных томатов (килограмм)':1 * 2,
        }

metadict_detail['Свёкла консервированная (килограмм)'] = {
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st003.shtml
        'Свёкла столовая (килограмм)':1.4,
        'Рассол для консервации овощей (килограмм)':1,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированной свёклы (килограмм)':1 * 2,
        }

metadict_detail['Капуста квашеная (килограмм)'] = {
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st002.shtml
        'Капуста белокочанная (килограмм)':1.3,
        'Рассол для квашения капусты (килограмм)':1,
        '_-Квашение капусты (килограмм)':1,
        '|=Бочка квашеной капусты (килограмм)':1 * 2,
        }

metadict_detail['Овсяная каша (килограмм)'] = {
        'Овсяная крупа (килограмм)':0.25,
        'Вода для готовки (литр)':0.75,
        'Соль пищевая (грамм)':2,
        '_-Варка каши (килограмм)':1,
        }

metadict_detail['Фасолевая каша (килограмм)'] = {
        'Фасоль сухая (килограмм)':0.33,
        'Вода для готовки (литр)':0.66,
        'Соль пищевая (грамм)':2,
        '_-Варка каши (килограмм)':1,
        }

metadict_detail['Кукурузная каша (килограмм)'] = {
        'Кукурузная крупа (килограмм)':0.33,
        'Вода для готовки (литр)':0.66,
        'Соль пищевая (грамм)':2,
        '_-Варка каши (килограмм)':1,
        }

metadict_detail['Арахисовая паста (килограмм)'] = {
        'Арахис (килограмм)':1,
        'Соль пищевая (грамм)':10,
        'Вода для готовки (литр)':0.25,
        '_-Производство арахисовой пасты (килограмм)':1,
        }

metadict_detail['Шоколад горький (килограмм)'] = {
        # http://thermalinfo.ru/svojstva-produktov/kulinariya-i-hleb/svojstva-shokolada-i-kakao
        'Какао-порошок (килограмм)':0.45,
        'Какао-масло (килограмм)':0.23,
        'Сахар (килограмм)':0.32,
        '_-Производство горького шоколада (килограмм)':1,
        }

metadict_detail['Шоколад ванильный (килограмм)'] = {
        # "Рецептуры на шоколад, шоколадные изделия и какао порошок" 1968 год СССР:
        'Какао-порошок (килограмм)':0.199,
        'Какао-масло (килограмм)':0.281,
        'Сахар (килограмм)':0.536,
        'Ваниль (грамм)':0.3,
        '_-Производство горького шоколада (килограмм)':1,
        }

metadict_detail['Шоколад с изюмом (килограмм)'] = {
        'Какао-порошок (килограмм)':0.189,
        'Какао-масло (килограмм)':0.165,
        'Сахар (килограмм)':0.359,
        'Изюм (килограмм)':0.296,
        'Ваниль (грамм)':0.3,
        '_-Производство горького шоколада (килограмм)':1,
        }

metadict_detail['Медовые пряники (килограмм)'] = {
        # Исправить
            # Вообще-то это тяжёлое заварное тесто.
            # Аммоний как разрыхлитель используют не зря.
        # http://www.hleb.net/prjanik/350/index-r.html#medovyeprjaniki
        'Мука пшеничная (килограмм)':0.56,
        'Сахар (килограмм)':0.111,
        'Мёд (килограмм)':0.39,
        'Вода для готовки (литр)':0.111,
        'Сода пищевая (грамм)':5.6,
        '_-Выпечка медовых пряников (килограмм)':1,
        }

metadict_detail['Яблочный джем (килограмм)'] = {
        'Яблоко (килограмм)':0.66 * 1.3,
        'Сахар (килограмм)':0.33,
        '_-Варка яблочного джема (килограмм)':1,
        }

metadict_detail['Яблочный джем (рецепт)'] = {
        'Яблоко (100 грамм)':5,
        'Сахар (100 грамм)':5,
        }

metadict_detail['Пшеничный хлеб (килограмм)'] = {
        # Исправить
            # Сделай отдельно домашний и фабричный хлеб.
            # Трудозатраты-то отличаются в 5 раз!
        # Дрожжи у пекарей свои
            # http://www.libussr.ru/doc_ussr/usr_12090.htm
        'Мука пшеничная (килограмм)':1 / 1.3,
        'Соль пищевая (грамм)':1.3,
        'Жидкие дрожжи (грамм)':50,
        'Вода для готовки (литр)':0.25,
        '_-Выпечка хлеба (килограмм)':1,
        }

metadict_detail['Овсяное печенье (килограмм)'] = {
        # http://penzafood.com/izdeliya/ovsyanoe-pechene.html
        'Мука пшеничная (килограмм)':0.294,
        'Мука овсяная (килограмм)':0.126,
        'Сахар (килограмм)':0.371,
        'Соевое масло (килограмм)':0.137,
        'Изюм (килограмм)':0.042,
        'Корица молотая (грамм)':0.7,
        'Ваниль (грамм)':0.5,
        'Сода пищевая (грамм)':2.5,
        'Соль пищевая (грамм)':3.8,
        '_-Выпечка овсяного печенья (килограмм)':1,
        }

metadict_detail['Компот (килограмм)'] = {
        'Сухофрукты (килограмм)':0.1,
        'Сахар (грамм)':100,
        'Вода питьевая (литр)':0.8,
        '_-Варка компота (килограмм)':1,
        }

metadict_detail['Травяной напиток (литр)'] = {
        'Вода питьевая (литр)':1,
        'Травяной сбор (грамм)':20,
        '_-Приготовление чая (литр)':1,
        }

metadict_detail['Чёрный чай (литр)'] = {
        'Вода питьевая (литр)':1,
        'Сушёные чайные листья (грамм)':12,
        '_-Приготовление чая (литр)':1,
        }

metadict_detail['Кофе (литр)'] = {
        'Вода питьевая (литр)':1,
        'Кофе молотый (грамм)':30,
        '_-Приготовление кофе (литр)':1,
        }

metadict_detail['Вино красное сухое (килограмм)'] = {
        # Нормы технологического проектирования винодельческих заводов по переработке винограда:
            # http://www.norm-load.ru/SNiP/Data1/9/9947/index.htm#i831023
            # https://ru.wikisource.org/wiki/ЭСБЕ/Виноделие
        'Виноград (килограмм)':1.4,
        '_-Приготовление вина (килограмм)':1,
        '|=Бочка вина (килограмм)':1,
        }

metadict_detail['Яблочный сидр (килограмм)'] = {
        # https://therumdiary.ru/napitki/vina/domashnij-sidr-ot-a-do-yu.html
        # https://ru.wikisource.org/wiki/ЭСБЕ/Плодовое_вино
        # https://ru.wikisource.org/wiki/ЭСБЕ/Сидр
        'Яблоко (килограмм)':2,
        '_-Приготовление яблочного сидра (килограмм)':1,
        '|=Бочка яблочного сидра (килограмм)':1,
        }

#----
# Смеси, растворы:

metadict_detail['Сухофрукты (килограмм)'] = {
        'Яблоко сушёное (килограмм)':0.5,
        'Вишня сушёная (килограмм)':0.2,
        'Груша сушёная (килограмм)':0.2,
        'Изюм (килограмм)':0.1,
        }

metadict_detail['Рассол для мочения фруктов (килограмм)'] = {
        # Исправить
            # Больше специй!
            # Сочетания: эстрагон и базилик, корица и гвоздика. Что там ещё к яблокам подойдёт?
        # Сахарный раствор 6%. Мочение.
            # http://konservirovanie.su/books/item/f00/s00/z0000000/st010.shtml
        'Сахар (грамм)':60,
        'Соль пищевая (грамм)':15,
        'Горчица сухая (грамм)':2,
        'Солод пшеничный (грамм)':5,
        'Вода для готовки (литр)':1,
        }

metadict_detail['Рассол для консервации овощей (килограмм)'] = {
        # Исправить
            # Стоит заметить, пряностями соленья не испортишь. А ещё можно листья добавлять:
            # 1-2 головки чеснока, 50 грамм укропа, по 8 смородиновых и вишнёвых листьев, 2-3 дубовых.
            # 1 лист хрена, 1 стебель эстрагона, 2 стебля базилика, щепотки две красного перца.
        # Рассол 6% концентрации. Соление, стало быть.
            # http://konservirovanie.su/books/item/f00/s00/z0000000/st002.shtml
        'Соль пищевая (грамм)':60,
        'Горчица сухая (грамм)':5,
        'Головка чеснока (штука)':1,
        'Перец красный (грамм)':1,
        'Вода для готовки (литр)':1,
        }

metadict_detail['Рассол для квашения капусты (килограмм)'] = {
        # Рассол 3% концентрации, квашение.
            # Таки тмин лучше горчицы, причём гораздо.
        'Горчица сухая (грамм)':5,
        'Соль пищевая (грамм)':30,
        'Вода для готовки (литр)':1,
        }

metadict_detail['Жидкие дрожжи (грамм)'] = {
        'Жидкие дрожжи (килограмм)':1 / 1000,
        }

metadict_detail['Жидкие дрожжи (килограмм)'] = {
        # Из солода
        'Сахар (грамм)':50,
        'Солод пшеничный (грамм)':150,
        'Вода для готовки (литр)':1,
        }

metadict_detail['Специи для имбирных пряников (на килограмм)'] = {
        'Кардамон (грамм)':10,
        'Корица молотая (грамм)':10,
        'Имбирь молотый (грамм)':10,
        'Мускатный орех молотый (грамм)':3,
        }

metadict_detail['Глазурь для медовых пряников (на килограмм)'] = {
        'Сахар (грамм)':100,
        'Вода для готовки (литр)':0.03,
        }

#----
# Специи, консерваторы, добавки:

metadict_detail['Кофе молотый (грамм)'] = {
        'Кофе молотый (килограмм)':1/1000,
        }

metadict_detail['Солод пшеничный (грамм)'] = {
        'Солод пшеничный (килограмм)':1/1000,
        }

metadict_detail['Горчица сухая (грамм)'] = {
        'Горчица сухая (килограмм)':1/1000,
        }

metadict_detail['Перец красный (грамм)'] = {
        'Перец красный (килограмм)':1/1000,
        }

metadict_detail['Корица молотая (грамм)'] = {
        'Корица молотая (килограмм)':1/1000,
        }

metadict_detail['Ваниль (грамм)'] = {
        'Ваниль (килограмм)':1/1000,
        }

metadict_detail['Травяной сбор (грамм)'] = {
        'Травяной сбор (килограмм)':1/1000,
        }

metadict_detail['Сушёные чайные листья (грамм)'] = {
        'Сушёные чайные листья (килограмм)':1/1000,
        }

metadict_detail['Сахар (грамм)'] = {
        'Сахар (килограмм)':1/1000,
        }

metadict_detail['Соль пищевая (грамм)'] = {
        'Соль пищевая (килограмм)':1/1000,
        }

metadict_detail['Сода пищевая (грамм)'] = {
        'Сода пищевая (килограмм)':1/1000,
        }

metadict_detail['Зубчик чеснока (штука)'] = {
        # Исправить
            # Не ленись, переведи в граммы.
        # Головка чеснока весит 6 грамм, часть счищается.
        'Чеснок (килограмм)':6/1000 * 1.25,
        }

metadict_detail['Головка чеснока (штука)'] = {
        # Головка чеснока весит 60 грамм.
        'Чеснок (килограмм)':60/1000,
        }

#----
# Полуфабрикаты, заменители:

metadict_detail['Подсолнечное масло (килограмм)'] = {
        'Семена подсолнечника (килограмм)':3,
        '_-Производство подсолнечного масла (килограмм)':1,
        '|=Бочка подсолнечного масла (килограмм)':1,
        }

metadict_detail['Оливковое масло (килограмм)'] = {
        'Плоды оливы (килограмм)':10,
        '_-Производство оливкового масла (килограмм)':1,
        '|=Бочка оливкового масла (килограмм)':1,
        }

metadict_detail['Льняное масло (килограмм)'] = {
        'Семена льна (килограмм)':4,
        '_-Производство льняного масла (килограмм)':1,
        '|=Бочка льняного масла (килограмм)':1,
        }

metadict_detail['Конопляное масло (килограмм)'] = {
        'Семена конопли (килограмм)':4,
        '_-Производство конопляного масла (килограмм)':1,
        '|=Бочка конопляного масла (килограмм)':1,
        }

metadict_detail['Соевое масло (килограмм)'] = {
        'Соевые бобы неочищенные (килограмм)':10,
        '_-Производство соевого масла (килограмм)':1,
        '|=Бочка соевого масла (килограмм)':1,
        }

metadict_detail['Арахисовое масло (килограмм)'] = {
        # Исправить
            # На самом деле пони едят арахисовую пасту
        'Арахисовая паста (килограмм)':2.2,
        '_-Производство арахисового масла (килограмм)':1,
        '|=Бочка арахисового масла (килограмм)':1,
        }

metadict_detail['Кленовый сироп (килограмм)'] = {
        'Кленовый сок (килограмм)':40,
        '_-Выварка кленового сиропа (килограмм)':1,
        '|=Бочка кленового сиропа (килограмм)':1,
        }

metadict_detail['Мёд (килограмм)'] = {
        'Мёд в сотах (килограмм)':1,
        '_-Упаковка мёда в бочки (килограмм)':1,
        '|=Бочка мёда (килограмм)':1,
        }

metadict_detail['Какао-порошок (килограмм)'] = {
        # Исправить
            # Из-за этой фигни плантации какао-бобов удваиваются.
            # А что делать? Введём коэффициент 0.5
        'Какао-бобы сухие (килограмм)':4 * 0.5,
        '_-Производство какао-порошка (килограмм)':1,
        '|=Бочка какао-порошка (килограмм)':1,
        }

metadict_detail['Какао-масло (килограмм)'] = {
        'Какао-бобы сухие (килограмм)':4 * 0.5,
        '_-Производство масла какао (килограмм)':1,
        '|=Бочка какао-масла (килограмм)':1,
        }

metadict_detail['Сахар (килограмм)'] = {
        # Иногда заменяется мёдом. На самом деле нет.
        'Тростниковый сахар (килограмм)':1,
        }

metadict_detail['Тростниковый сахар (килограмм)'] = {
        'Тростниковый сахар-сырец (килограмм)':1.1,
        '_-Производство рафинированного сахара (килограмм)':1,
        '|=Бочка тростникового сахара (килограмм)':1,
        }

metadict_detail['Тростниковый сахар-сырец (килограмм)'] = {
        # Примитивный техпроцесс, из 10% сахарозы в стеблях извлекают только 5% сахара.
            # https://carbofood.ru/sugar-technology/saxarnyj-trostnik-texnologiya
        'Сахарный тростник (килограмм)':1/0.05,
        'Известь свежегашёная (килограмм)':0.0035,
        '_-Производство тростникового сахара-сырца (килограмм)':1,
        '|=Бочка тростникового сахара-сырца (килограмм)':1,
        }

metadict_detail['Овсяная крупа (килограмм)'] = {
        'Зерно овса (килограмм)':1.3,
        '_-Производство овсяной крупы (килограмм)':1,
        '|=Бочка овсяной крупы (килограмм)':1,
        }

metadict_detail['Арахис (килограмм)'] = {
        # Массовая доля шелухи: от 15 до 47%
        'Арахисовые бобы неочищенные (килограмм)':1.3,
        '_-Чистка арахиса (килограмм)':1,
        '|=Бочка арахиса (килограмм)':1,
        }

metadict_detail['Соевые бобы (килограмм)'] = {
        'Соевые бобы неочищенные (килограмм)':1.3,
        '_-Чистка соевых бобов (килограмм)':1,
        '|=Бочка соевых бобов (килограмм)':1,
        }

metadict_detail['Фасоль сухая (килограмм)'] = {
        'Бобы красной фасоли неочищенные (килограмм)':1.3,
        '_-Чистка и сушка фасоли (килограмм)':1,
        '|=Бочка сухой фасоли (килограмм)':1,
        }

metadict_detail['Ваниль (килограмм)'] = {
        # Сушёные стручки ванили:
            # https://ru.wikisource.org/wiki/ЭСБЕ/Ваниль
            # https://ru.wikipedia.org/wiki/Ваниль_(пряность)
        'Стручки ванили (килограмм)':2,
        '_-Ферментизация и сушка стручков ванили (килограмм)':1,
        '|=Бочка сухой ванили (килограмм)':1,
        }

metadict_detail['Перец красный (килограмм)'] = {
        'Стручки красного перца (килограмм)':3,
        '_-Сушка красного перца (килограмм)':1,
        }

metadict_detail['Корица молотая (килограмм)'] = {
        'Кора корицы (килограмм)':1.1,
        '_-Помол корицы (килограмм)':1,
        }

metadict_detail['Какао-бобы сухие (килограмм)'] = {
        # ВЛИЯНИЕ ФЕРМЕНТАЦИИ И СУШКИ НА КАЧЕСТВО КАКАО БОБОВ:
            # http://bibliotekar.ru/5-kakao/4.htm
            # После обработки какао бобы теряют 50% массы (плюс оболочка 50%)
        # https://ru.wikisource.org/wiki/ЭСБЕ/Какао
        'Плоды дерева какао (килограмм)':1 / 0.5 / 0.5,
        '_-Ферметизация и сушка какао-бобов (килограмм)':1,
        '|=Бочка какао-бобов (килограмм)':1,
        }

metadict_detail['Кукурузная крупа (килограмм)'] = {
        # Исправить
            # Объединить процессы
        'Початки кукурузы (килограмм)':3,
        '_-Чистка и сушка кукурузы (килограмм)':1,
        '_-Дробление кукурузных зёрен (килограмм)':1,
        '|=Бочка кукурузной крупы (килограмм)':1,
        }

metadict_detail['Мука пшеничная (килограмм)'] = {
        # Пшеница при помоле теряет 25% веса.
        'Зерно пшеницы (килограмм)':1.25,
        '_-Помол пшеничной муки (килограмм)':1,
        '|=Бочка пшеничной муки (килограмм)':1,
        }

metadict_detail['Мука овсяная (килограмм)'] = {
        'Зерно овса (килограмм)':1.25,
        '_-Помол овсяной муки (килограмм)':1,
        '|=Бочка овсяной муки (килограмм)':1,
        }

metadict_detail['Мука соевая (грамм)'] = {
        'Мука соевая (килограмм)':0.001,
        }

metadict_detail['Мука соевая (килограмм)'] = {
        'Соевые бобы (килограмм)':1.25,
        '_-Помол соевой муки (килограмм)':1,
        '|=Бочка соевой муки (килограмм)':1,
        }

metadict_detail['Солод пшеничный (килограмм)'] = {
        # Крупноразмолотые проросшие зёрна пшеницы.
        'Зерно пшеницы (килограмм)':1.25,
        '_-Производство пшеничного солода (килограмм)':1,
        '|=Бочка пшеничного солода (килограмм)':1,
        }

metadict_detail['Яблоко сушёное (килограмм)'] = {
        # Настольная книга садовода 7.14. Сушка:
        # http://www.citrus.abc64.ru/bookgardene714.htm
        'Яблоко (килограмм)':9,
        '_-Сушка яблок (килограмм)':1,
        '|=Бочка сушёных яблок (килограмм)':1,
        }

metadict_detail['Груша сушёная (килограмм)'] = {
        'Груша (килограмм)':7.5,
        '_-Сушка груши (килограмм)':1,
        '|=Бочка сушёной груши (килограмм)':1,
        }

metadict_detail['Вишня сушёная (килограмм)'] = {
        'Вишня (килограмм)':6,
        '_-Сушка вишни (килограмм)':1,
        '|=Бочка сушёной вишни (килограмм)':1,
        }

metadict_detail['Изюм (килограмм)'] = {
        'Виноград (килограмм)':5,
        '_-Сушка винограда (килограмм)':1,
        '|=Бочка изюма (килограмм)':1,
        }

metadict_detail['Кофе молотый (килограмм)'] = {
        'Кофейные зёрна (килограмм)':1,
        '_-Жарение и помол кофе (килограмм)':1,
        }

metadict_detail['Кофейные зёрна (килограмм)'] = {
        'Плоды кофейного дерева (килограмм)':3,
        '|=Бочка кофейных зёрен (килограмм)':1,
        }

metadict_detail['Горчица сухая (килограмм)'] = {
        'Семена горчицы белой (килограмм)':1.5,
        '_-Помол семян горчицы (килограмм)':1,
        '|=Бочка сухой горчицы (килограмм)':1,
        }

metadict_detail['Травяной сбор (килограмм)'] = {
        # Исправить
            # Перенести в смеси, разделить на фракции.
            # Сушёные коренья одуванчиков, цветы ромашки, фенхель.
        'Дикорастущие растения (килограмм)':4,
        '_-Сушка дикорастущих растений (килограмм)':1,
        '|=Бочка сушёных трав (килограмм)':1,
        }

metadict_detail['Сушёные чайные листья (килограмм)'] = {
        'Чайные листья (килограмм)':4,
        '_-Сушка чайных листьев (килограмм)':1,
        '|=Бочка сушёных чайных листьев (килограмм)':1,
        }

#----
# Вода (группировка)

metadict_detail['Вода для мытья овощей (литр)'] = {
        'Вода хозяйственная (литр)':1,
        }

metadict_detail['Вода для мытья фруктов (литр)'] = {
        'Вода хозяйственная (литр)':1,
        }

metadict_detail['Вода для мытья сухофруктов (литр)'] = {
        'Вода хозяйственная (литр)':1,
        }

metadict_detail['Вода для мытья посуды (литр)'] = {
        'Вода хозяйственная (литр)':1,
        }

metadict_detail['Вода для готовки (литр)'] = {
        'Вода хозяйственная (литр)':1,
        }

metadict_detail['Вода для уборки (литр)'] = {
        'Вода хозяйственная (литр)':1,
        }

metadict_detail['Вода для смыва (литр)'] = {
        'Вода хозяйственная (литр)':1,
        }

metadict_detail['Вода для умывания (литр)'] = {
        'Вода хозяйственная (литр)':1,
        }

metadict_detail['Вода для мытья копыт (литр)'] = {
        'Вода хозяйственная (литр)':1,
        }

metadict_detail['Вода питьевая (литр)'] = {
        'Вода кипячёная (литр)':1,
        }

metadict_detail['Вода для бани (литр)'] = {
        # Воду смешивают, чтобы сбавить температуру
        'Вода кипячёная (литр)':0.5,
        'Вода хозяйственная (литр)':0.5,
        }

metadict_detail['Вода для душа (литр)'] = {
        'Вода кипячёная (литр)':0.5,
        'Вода хозяйственная (литр)':0.5,
        }

metadict_detail['Вода для мытья вещей (литр)'] = {
        'Вода кипячёная (литр)':1,
        }

#----
# Вода (источники)

metadict_detail['Вода кипячёная (литр)'] = {
        '-Водоснабжение (литр)':1,
        '_-Кипячение воды (литр)':1,
        }

metadict_detail['Вода хозяйственная (литр)'] = {
        '-Водоснабжение (литр)':1,
        }

#----
# Вода (транспортировка)

metadict_detail['Вода водопроводная (кубометр)'] = {
        # Исправить
            # Таки учитываем водопроводный транспорт, или нет?
        }

metadict_detail['Вода колодезная (кубометр)'] = {
        # Исправить
            # Эм, 100 часов перевозки воды в год на каждого сельского пони?
            # Получается, кто-то в семье 2 часа каждый день пашет водовозом. Это сурово!
            # Пили касту пегасов-водовозов, расширяй водопровод или урезай потребности селян.
        #'|=Бочка хозяйственной воды (килограмм)':1000,
        }

metadict_detail['Вода для строительства (кубометр)'] = {
        # Исправить
            # Воду для строительства отдельно от промышленной
        #'-Водоснабжение (литр)':1000,
        '|=Бочка промышленной воды (килограмм)':1000,
        }

#----
# Соль (группировка)

metadict_detail['Соль пищевая (килограмм)'] = {
        'Соль (тонн)':0.001,
        }

metadict_detail['Соль (тонн)'] = {
        # Исправить
            # Соль перевозят в бочках.
        'Производство соли (тонн)':1,
        '|=Бочка соли (килограмм)':1000,
        }

#----
# Коррекция величин (центнеры):

metadict_detail['Семена горчицы белой (килограмм)'] = {
        'Выращивание Семена горчицы белой (центнер)':1/100,
        '|=Корзина семян горчицы белой (килограмм)':1,
        }

metadict_detail['Семена льна (килограмм)'] = {
        'Выращивание Семена льна (центнер)':1/100,
        '|=Корзина семян льна (килограмм)':1,
        }

metadict_detail['Семена конопли (килограмм)'] = {
        'Выращивание Семена конопли (центнер)':1/100,
        '|=Корзина семян конопли (килограмм)':1,
        }

metadict_detail['Семена подсолнечника (килограмм)'] = {
        'Выращивание Семена подсолнечника (центнер)':1/100,
        '|=Корзина семян подсолнечника (килограмм)':1,
        }

metadict_detail['Плоды оливы (килограмм)'] = {
        'Выращивание Плоды оливы (центнер)':1/100,
        '|=Корзина плодов оливы (килограмм)':1,
        }

metadict_detail['Бобы красной фасоли неочищенные (килограмм)'] = {
        'Выращивание Бобы красной фасоли неочищенные (центнер)':1/100,
        '|=Корзина красной фасоли в стручках (килограмм)':1,
        }

metadict_detail['Початки кукурузы (килограмм)'] = {
        'Выращивание Початки кукурузы (центнер)':1/100,
        '|=Корзина початков кукурузы (килограмм)':1,
        }

metadict_detail['Соевые бобы неочищенные (килограмм)'] = {
        'Выращивание Соевые бобы неочищенные (центнер)':1/100,
        '|=Корзина соевых бобов в стручках (килограмм)':1,
        }

metadict_detail['Арахисовые бобы неочищенные (килограмм)'] = {
        'Выращивание Арахисовые бобы неочищенные (центнер)':1/100,
        '|=Корзина арахиса в шелухе (килограмм)':1,
        }

metadict_detail['Виноград (килограмм)'] = {
        'Выращивание Виноград (центнер)':1/100,
        '|=Корзина винограда (килограмм)':1,
        }

metadict_detail['Яблоко (килограмм)'] = {
        'Выращивание Яблоко (центнер)':1/100,
        '|=Корзина яблок (килограмм)':1,
        }

metadict_detail['Груша (килограмм)'] = {
        'Выращивание Груша (центнер)':1/100,
        '|=Корзина груш (килограмм)':1,
        }

metadict_detail['Вишня (килограмм)'] = {
        'Выращивание Вишня (центнер)':1/100,
        '|=Корзина вишни (килограмм)':1,
        }

metadict_detail['Зерно пшеницы (килограмм)'] = {
        # Исправить
            # Хау, учти побочные продукты, ту же солому.
        'Выращивание Зерно пшеницы (центнер)':1/100,
        '|=Корзина зерна пшеницы (килограмм)':1,
        }

metadict_detail['Зерно овса (килограмм)'] = {
        'Выращивание Зерно овса (центнер)':1/100,
        '|=Корзина зерна овса (килограмм)':1,
        }

metadict_detail['Сахарный тростник (килограмм)'] = {
        'Выращивание Сахарный тростник (центнер)':1/100,
        '|=Связка сахарного тростника (килограмм)':1,
        }

metadict_detail['Чайные листья (килограмм)'] = {
        'Выращивание Чайные листья (центнер)':1/100,
        '|=Корзина чайных листьев (килограмм)':1,
        }

metadict_detail['Плоды дерева какао (килограмм)'] = {
        'Выращивание плодов дерева какао (центнер)':1/100,
        '|=Корзина плодов какао (килограмм)':1,
        }

metadict_detail['Кора корицы (килограмм)'] = {
        'Выращивание корицы (центнер)':1/100,
        '|=Бочка корицы (килограмм)':1,
        }

metadict_detail['Стручки красного перца (килограмм)'] = {
        'Выращивание красного перца (центнер)':1/100,
        '|=Корзина стручков красного перца (килограмм)':1,
        }

metadict_detail['Стручки ванили (килограмм)'] = {
        'Выращивание ванили (центнер)':1/100,
        '|=Корзина стручков ванили (килограмм)':1,
        }

metadict_detail['Плоды кофейного дерева (килограмм)'] = {
        'Выращивание плодов кофейного дерева (центнер)':1/100,
        '|=Корзина плодов кофейного дерева (килограмм)':1,
        }

metadict_detail['Дикорастущие растения (килограмм)'] = {
        'Выращивание Дикорастущие растения (центнер)':1/100,
        '|=Корзина дикорастущих растений (килограмм)':1,
        }

metadict_detail['Батат (килограмм)'] = {
        'Выращивание Батат (центнер)':1/100,
        '|=Корзина батата (килограмм)':1,
        }

metadict_detail['Картофель (килограмм)'] = {
        'Выращивание Картофель (центнер)':1/100,
        '|=Корзина картофеля (килограмм)':1,
        }

metadict_detail['Тыква (килограмм)'] = {
        'Выращивание Тыква (центнер)':1/100,
        '|=Корзина тыквы (килограмм)':1,
        }

metadict_detail['Томаты (килограмм)'] = {
        'Выращивание Томаты (центнер)':1/100,
        '|=Корзина томатов (килограмм)':1,
        }

metadict_detail['Кабачок (килограмм)'] = {
        'Выращивание Кабачок (центнер)':1/100,
        '|=Корзина кабачка (килограмм)':1,
        }

metadict_detail['Огурцы (килограмм)'] = {
        'Выращивание Огурцы (центнер)':1/100,
        '|=Корзина огурцов (килограмм)':1,
        }

metadict_detail['Морковь (килограмм)'] = {
        'Выращивание Морковь (центнер)':1/100,
        '|=Корзина моркови (килограмм)':1,
        }

metadict_detail['Капуста белокочанная (килограмм)'] = {
        'Выращивание Капуста белокочанная (центнер)':1/100,
        '|=Корзина капусты белокочанной (килограмм)':1,
        }

metadict_detail['Лук репчатый (килограмм)'] = {
        'Выращивание Лук репчатый (центнер)':1/100,
        '|=Корзина лука репчатого (килограмм)':1,
        }

metadict_detail['Чеснок (килограмм)'] = {
        'Выращивание чеснока (центнер)':1/100,
        '|=Корзина чеснока (килограмм)':1,
        }

metadict_detail['Репа (килограмм)'] = {
        'Выращивание Репа (центнер)':1/100,
        '|=Корзина репы (килограмм)':1,
        }

metadict_detail['Перец сладкий (килограмм)'] = {
        'Выращивание Перец сладкий (центнер)':1/100,
        '|=Корзина перца сладкого (килограмм)':1,
        }

metadict_detail['Свёкла столовая (килограмм)'] = {
        'Выращивание Свёкла столовая (центнер)':1/100,
        '|=Корзина сахарной свёклы (килограмм)':1,
        }

metadict_detail['Кленовый сок (килограмм)'] = {
        # Исправить
            # Объединить процессы.
        'Кленовый сок (центнер)':1/100,
        'Сбор кленового сока (килограмм)':1,
        '|=Бочка кленового сока (килограмм)':1,
        }

metadict_detail['Мёд в сотах (килограмм)'] = {
        # Исправить
            # Пони не варвары, они не бортничают, а аккуратно собирают мёд.
        # С одной семьи -- 25 килограмм мёда; 0.5 килограмма воска.
        'Выращивание Мёд в сотах (центнер)':1/100,
        #'Воск (килограмм)':1/50,
        #'|=Ведро мёда в сотах (килограмм)':1,
        }

#----
# Коррекция величин (тонны)

metadict_detail['Прокат стальной (килограмм)'] = {
        'Прокат стальной (тонн)':0.001,
        }

metadict_detail['Прокат стальной (тонн)'] = {
        'Производство стального проката (тонн)':1,
        '|=Прокат стальной (тонн)':1,
        }

metadict_detail['Литьё чугунное (килограмм)'] = {
        'Литьё чугунное (тонн)':0.001,
        }

metadict_detail['Литьё чугунное (тонн)'] = {
        'Производство чугунного литья (тонн)':1,
        '|=Литьё чугунное (тонн)':1,
        }

metadict_detail['Кирпич (кубометр)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Кирпичное_производство
        # Вес тысячи кирпичей 260 пудов -- 4.24 тонны (вес штуки 4.24 кг, вес кубометра 2.12 тонны)
        'Полевое производство кирпича (кубометр)':1,
        '|=Кирпич (тонн)':2.12,
        }

metadict_detail['Опилкобетон лёгкий (кубометр)'] = {
        # Исправить
            # Вообще-то для арболита требуется щепа
        '_-Производство лёгкого опилкобетона (кубометр)':1,
        'Опилки древесные (кубометр)':1.2,
        'Известь негашёная (кубометр)':0.1,
        'Цемент (кубометр)':0.1,
        'Песок (кубометр)':0.15,
        '|=Опилкобетон лёгкий (тонн)':0.5,
        }

metadict_detail['Саман лёгкий (кубометр)'] = {
        '_-Производство лёгкого самана (кубометр)':1,
        'Сухая солома (кубометр)':0.8,
        'Глина мятая (кубометр)':0.2,
        '|=Саман лёгкий (тонн)':0.5,
        }

metadict_detail['Глиносоломенные ковры 25-мм (квадратный метр)'] = {
        # Плотность глиносоломы -- 0.5 тонны/кубометр (0.0125 тонны/кв.метр)
        '_-Пропитка глиной соломенных ковров (квадратный метр)':1,
        'Глина необработанная (кубометр)':0.006,
        'Соломенные ковры 25-мм (квадратный метр)':1,
        '|=Рулон глиносоломенного ковра (тонн)':0.5 * 0.025,
        }

metadict_detail['Соломенные ковры 25-мм (квадратный метр)'] = {
        # Толщина ковра -- 25 миллиметров
        # Метр ковра -- 0.05 кг пеньковой нити в основе
        '_-Производство соломенных ковров (квадратный метр)':1,
        'Пеньковые верёвки 3-мм (метр)':10,
        'Сухая солома (кубометр)':0.025,
        '|=Рулон соломенного ковра (тонн)':0.1 * 0.025,
        }

metadict_detail['Толь (квадратный метр)'] = {
        # https://ru.wikisource.org/wiki/ЭСБЕ/Толь
            # Толщиною картон берется обыкновенно от 1 мм или немного менее до 1,7 мм,
            # причем на вес в 50 кг идет от 120 до 60 кв. м (630 грамм/кв.метр)
            # На 100 вес. частей картона расход смолы составляет от 140 до 150 весов. частей.
            # Стало быть расход смолы: 0.63 * 1.45 = 0.91 кг/кв.метр
        # Пергамин. Масса картона основы -- 0.35 кг/кв.метр
            # http://docs.cntd.ru/document/9056512
            # https://mkrovlya.ru/products/catalog/karton_krovelnyy/
        '_-Производство пергамина (квадратный метр)':1,
        'Картон толщиной 1.3-мм (квадратный метр)':1,
        'Дёготь (килограмм)':0.91,
        '|=Рулон толя (тонн)':0.75 / 1000,
        }

metadict_detail['Пеньковые верёвки 3-мм (метр)'] = {
        # Объём метра: 3.14159265 * 0.0015 ** 2 * 1 = 0.000007 кубометра (0.0074 кг/метр)
            # http://tehtab.ru/guide/guideequipment/ropes/penkaropestrength/
        '_-Производство 3-мм пеньковой бечевы (метр)':1,
        'Пенька (килограмм)':0.0075,
        '|=Пеньковые верёвки (тонн)':0.0075 / 1000,
        }

metadict_detail['Пиломатериалы (кубометр)'] = {
        # Исправить
            # Уточнить насыпную плотность при погрузке.
            # Отдельно должны быть высушенные пиломатериалы.
        'Полевое производство пиломатериалов (кубометр)':1,
        '|=Пиломатериалы свежие (тонн)':1,
        }

metadict_detail['Глина мятая (кубометр)'] = {
        'Полевое производство глины (кубометр)':1,
        '|=Глина (тонн)':2.6,
        }

metadict_detail['Глина необработанная (кубометр)'] = {
        'Добыча глины (кубометр)':1,
        '|=Глина (тонн)':1.9,
        }

metadict_detail['Цемент (килограмм)'] = {
        'Цемент (тонн)':0.001,
        }

metadict_detail['Цемент (тонн)'] = {
        'Цемент (кубометр)':1 / 1.5,
        }

metadict_detail['Цемент (кубометр)'] = {
        'Производство цемента (кубометр)':1,
        '|=Бочка цемента М400 (килограмм)':1300,
        }

metadict_detail['Песок (кубометр)'] = {
        'Добыча песка (кубометр)':1,
        '|=Песок (тонн)':1.4,
        }

metadict_detail['Грунт (кубометр)'] = {
        # Вывоз грунта (и его доставка)
        '|=Грунт (тонн)':1.6,
        }

metadict_detail['Щебень (кубометр)'] = {
        'Добыча щебня (кубометр)':1,
        '|=Щебень (тонн)':1.6,
        }

metadict_detail['Гравий (кубометр)'] = {
        'Добыча гравия (кубометр)':1,
        '|=Гравий (тонн)':1.6,
        }

metadict_detail['Камень бутовый (кубометр)'] = {
        'Добыча бутового камня (кубометр)':1,
        '|=Бутовый камень (тонн)':1.6,
        }

metadict_detail['Известь негашёная (килограмм)'] = {
        'Известь негашёная (тонн)':1/1000,
        }

metadict_detail['Известь негашёная (тонн)'] = {
        'Производство извести негашёной (тонн)':1,
        '|=Бочка извести негашёной (килограмм)':1000,
        }

metadict_detail['Стекло жидкое (килограмм)'] = {
        'Стекло жидкое (тонн)':0.001,
        }

metadict_detail['Стекло жидкое (тонн)'] = {
        'Производство жидкого стекла (тонн)':1,
        '|=Бочка жидкого стекла (килограмм)':1000,
        }

#metadict_detail['Стекло (кубометр)'] = {
#        # Исправить
#            # Уточнить складскую плотность стекла.
#        '|=Стекло (тонн)':2.6,
#        }

metadict_detail['Опилки древесные (кубометр)'] = {
        # Мокрая древесина дуба, насыпная плотность.
            # http://tehnopost.kiev.ua/drova/17-tablitsa-plotnosti-schepyi.html
        '|=Опилки древесные (тонн)':0.3,
        }

metadict_detail['Сухая солома (кубометр)'] = {
        # Думаю, сухая солома у понек есть всегда.
        '|=Тюк сухой соломы (тонн)':0.1,
        }

metadict_detail['Асбест (кубометр)'] = {
        'Асбест (тонн)':2.5,
        }

metadict_detail['Асбест (килограмм)'] = {
        'Асбест (тонн)':0.001,
        }

metadict_detail['Асбест (тонн)'] = {
        # http://www.most-52.ru/1/7/8/229/236/
        # http://docs.cntd.ru/document/1200024950
        'Добыча асбеста (тонн)':1,
        '|=Бочка асбеста (килограмм)':1000,
        }

metadict_detail['Меловый порошок (килограмм)'] = {
        'Меловый порошок (тонн)':0.001,
        }

metadict_detail['Меловый порошок (тонн)'] = {
        'Добыча мела (тонн)':1,
        '|=Бочка мелового порошка (килограмм)':1000,
        }

metadict_detail['Бумага (килограмм)'] = {
        'Бумага (тонн)':0.001,
        }

metadict_detail['Бумага (тонн)'] = {
        'Производство бумаги (тонн)':1,
        '|=Рулон бумаги (килограмм)':1000,
        }

metadict_detail['Пакля (килограмм)'] = {
        'Пакля (тонн)':0.001,
        }

metadict_detail['Пакля (тонн)'] = {
        'Производство пакли (тонн)':1,
        '|=Тюк пакли (тонн)':1,
        }

metadict_detail['Дрова (МДж)'] = {
        # Теплота сгорания дров (в среднем) — 15 МДж/килограмм
        'Дрова (килограмм)':1 / 15,
        }

metadict_detail['Дрова (килограмм)'] = {
        'Дрова (тонн)':0.001,
        }

metadict_detail['Дрова (тонн)'] = {
        # Свежие, с большой влажностью.
        'Дрова (кубометр)':1,
        }

metadict_detail['Лес круглый (кубометр)'] = {
        'Валка среднего леса (кубометр)':1,
        '|=Лес круглый (тонн)':1,
        }

metadict_detail['Дрова (кубометр)'] = {
        # Исправить
            # Часть дров пони получают за счёт отходов производства.
            # А другую часть требуется расколоть, прежде чем использовать.
        # Это насыпная плотность дров!
        # https://naruservice.com/articles/udelnyj-ves-drov
        'Валка среднего леса (кубометр)':1,
        '_-Колка дров (кубометр)':1,
        '|=Дрова (тонн)':1,
        }

metadict_detail['Пакля пропитаная (килограмм)'] = {
        # http://stroysvoimirukami.ru/gost-16183-77/
        'Пакля (килограмм)':0.7,
        'Дёготь (килограмм)':0.3,
        '_-Пропитка пакли (килограмм)':1,
        '|=Тюк пропитаной пакли (тонн)':1 / 1000,
        }

metadict_detail['Дегтярное масло (килограмм)'] = {
        # Исправить
            # Используется для антисептирования древесины. Не лучший вариант.
        'Дёготь (килограмм)':1,
        '_-Производство дегтярного масла (килограмм)':1,
        '|=Бочка дегтярного масла (килограмм)':1,
        }

metadict_detail['Дёготь (килограмм)'] = {
        'Производство дёгтя (литр)':1,
        '|=Бочка дёгтя (килограмм)':1,
        }

metadict_detail['Смоляк (кубометр)'] = {
        # Сосновые пни после 20-летней выдержки.
        'Корчёвка смоляка (кубометр)':1,
        '|=Смоляк (тонн)':1,
        }
