#----
# Строительство зданий, сооружений (трудозатраты):

metadict_model['Кирпичная кладка в 0.5 кирпича (квадратный метр)'] = {
        # Толщина 125 мм:
        'Кирпичная кладка (кубометр)':0.125,
        }

metadict_model['Кирпичная кладка в 1 кирпич (квадратный метр)'] = {
        # Толщина 250 мм:
        'Кирпичная кладка (кубометр)':0.250,
        }

metadict_model['Кирпичная кладка в 1.5 кирпича (квадратный метр)'] = {
        # Толщина 250 + 10 + 125 = 385 мм:
        'Кирпичная кладка (кубометр)':0.385,
        }

metadict_model['Кирпичная кладка в 2 кирпича (квадратный метр)'] = {
        # Толщина 250 + 10 + 250 = 510 мм:
        'Кирпичная кладка (кубометр)':0.510,
        }

metadict_model['Кирпичная кладка в 2.5 кирпича (квадратный метр)'] = {
        # Толщина 250 + 10 + 250 + 10 + 125 = 645 мм:
        'Кирпичная кладка (кубометр)':0.645,
        }

metadict_model['Котлован (кубометр)'] = {
        'Земляные работы немеханизированные (кубометр)':1,
        }

metadict_model['Гидроизоляция горизонтальная оклеенная (квадратный метр)'] = {
        'Гидроизоляция горизонтальная оклеенная (100 квадратных метров)':1/100,
        }

metadict_model['Гидроизоляция боковая оклеенная (квадратный метр)'] = {
        'Гидроизоляция боковая оклеенная (100 квадратных метров)':1/100,
        }

metadict_model['Гидроизоляция горизонтальная цементная с жидким стеклом (квадратный метр)'] = {
        'Гидроизоляция горизонтальная цементная с жидким стеклом (100 квадратных метров)':1/100,
        }

metadict_model['Гидроизоляция боковая цементная с жидким стеклом (квадратный метр)'] = {
        'Гидроизоляция боковая цементная с жидким стеклом (100 квадратных метров)':1/100,
        }

metadict_model['Рубка стен из брусьев толщиной 180 мм (квадратный метр)'] = {
        'Рубка стен из брусьев толщиной 180 мм (100 квадратных метров)':1/100,
        }

metadict_model['Рубка стен из брусьев толщиной 100 мм (квадратный метр)'] = {
        'Рубка стен из брусьев толщиной 100 мм (100 квадратных метров)':1/100,
        }

metadict_model['Конопатка стен из брусьев (квадратный метр)'] = {
        'Конопатка стен из брусьев (100 квадратных метров)':1/100,
        }

metadict_model['Обшивка стен рубленых (квадратный метр)'] = {
        'Обшивка стен рубленых (100 квадратных метров)':1/100,
        }

metadict_model['Устройство стен каркасной конструкции (квадратный метр)'] = {
        'Устройство стен каркасной конструкции (100 квадратных метров)':1/100,
        }

metadict_model['Сборка стен каркасной конструкции (квадратный метр)'] = {
        'Сборка стен каркасной конструкции (100 квадратных метров)':1/100,
        }

metadict_model['Устройство перекрытий с укладкой балок (на сруб) (квадратный метр)'] = {
        'Устройство перекрытий с укладкой балок (на сруб) (100 квадратных метров)':1/100,
        }

metadict_model['Устройство перекрытий с укладкой балок (на каркас) (квадратный метр)'] = {
        'Устройство перекрытий с укладкой балок (на каркас) (100 квадратных метров)':1/100,
        }

metadict_model['Устройство дощатых перекрытий (на каркас) (квадратный метр)'] = {
        'Устройство дощатых перекрытий (на каркас) (100 квадратных метров)':1/100,
        }

metadict_model['Устройство заборов (квадратный метр)'] = {
        # Высотой 1.2 метра
        'Устройство заборов (100 квадратных метров)':1/100,
        }

metadict_model['Устройство калиток (квадратный метр)'] = {
        # Высотой 1.2 метра
        'Устройство калиток (100 квадратных метров)':1/100,
        }

metadict_model['Установка оконных блоков (квадратный метр)'] = {
        'Установка оконных блоков (100 квадратных метров)':1/100,
        }

metadict_model['Установка мебели (штука)'] = {
        'Установка мебели (100 штук)':1/100,
        }

metadict_model['Простая окраска масляными составами (квадратный метр)'] = {
        'Простая окраска масляными составами (100 квадратных метров)':0.01,
        }

metadict_model['Улучшенная окраска масляными составами (квадратный метр)'] = {
        'Улучшенная окраска масляными составами (100 квадратных метров)':0.01,
        }

metadict_model['Улучшенная штукатурка цементно-известковым раствором (квадратный метр)'] = {
        'Улучшенная штукатурка цементно-известковым раствором (100 квадратных метров)':0.01,
        }

metadict_model['Устройство террас (квадратный метр)'] = {
        'Устройство террас (100 квадратных метров)':0.01,
        }

metadict_model['Облицовка керамическими плитками (квадратный метр)'] = {
        'Облицовка керамическими плитками (100 квадратных метров)':0.01,
        }

metadict_model['Прокладка 50-мм водопровода (метр)'] = {
        'Прокладка 50-мм водопровода (100 метров)':0.01,
        }

metadict_model['Прокладка 50-мм трубопровода канализации (метр)'] = {
        'Прокладка 50-мм трубопровода канализации (100 метров)':0.01,
        }

metadict_model['Прокладка 150-мм трубопровода канализации (метр)'] = {
        'Прокладка 150-мм трубопровода канализации (100 метров)':0.01,
        }

metadict_model['Прокладка 150-мм вытяжной трубы (метр)'] = {
        'Прокладка 150-мм вытяжной трубы (100 метров)':0.01,
        }

metadict_model['Устройство дощатых перегородок (квадратный метр)'] = {
        'Устройство дощатых перегородок (100 квадратных метров)':0.01,
        }

metadict_model['Укладка соломенной кровли (квадратный метр)'] = {
        'Укладка соломенной кровли (100 квадратных метров)':1 / 100,
        }

metadict_model['Устройство деревянной кровли (квадратный метр)'] = {
        'Устройство деревянной кровли (100 квадратных метров)':1 / 100,
        }

metadict_model['Устройство черепичной кровли (квадратный метр)'] = {
        'Устройство черепичной кровли (100 квадратных метров)':1 / 100,
        }

metadict_model['Устройство кровли из оцинкованной стали (квадратный метр)'] = {
        'Устройство кровли из оцинкованной стали (100 квадратных метров)':1 / 100,
        }

#----
# Строительство зданий, сооружений (нормативы):

metadict_model['Устройство подстилающего слоя (кубометр)'] = {
        # Исправить.
            # Используются компрессоры и глиномешалки.
        # Таблица ГЭСН 11-01-002 Устройство подстилающих слоев
        # http://www.norm-load.ru/SNiP/Data1/56/56035/index.htm#i32077
            # 01. Планировка основания.
            # 02. Приготовление глинобитной смесей.
            # 03. Устройство подстилающего слоя с разравниванием и уплотнением.
            # 04. Уход за подстилающими слоями.
            # Измеритель: 1 м3 подстилающего слоя
                # "11-01-002-05 (рабочие)": 7.89 нормо-часов
                # "11-01-002-05 (машинисты)": 1.25 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':10,
        'Глина (кубометр)':0.44,
        'Песок (кубометр)':1.02,
        'Вода для строительства (кубометр)':0.97,
        }

metadict_model['Устройство основания под фундаменты (кубометр)'] = {
        # Исправить.
            # Используются компрессоры и глиномешалки.
        # Таблица ГЭСН 08-01-002 Устройство основания под фундаменты
            # http://www.norm-load.ru/SNiP/Data1/56/56028/index.htm#i118260
            # 01. Разравнивание и трамбование основания.
            # Измеритель:   1 м3 основания
                # "08-01-002-01 (рабочие)": 2.3 нормо-часов
                # "08-01-002-01 (машинисты)": 0.3 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':3,
        'Песок (кубометр)':1.2,
        'Вода для строительства (кубометр)':0.15,
        }

metadict_model['Устройство глиняного замка (кубометр)'] = {
        # Исправить.
            # Используются компрессоры и глиномешалки.
        # Таблица ГЭСН 08-01-004 Боковая изоляция стен, фундаментов глиной
            # http://www.norm-load.ru/SNiP/Data1/56/56028/index.htm#i204031
            # 01. Укладка слоя мятой глины с уплотнением и приготовлением.
            # Измеритель:   1 м3 изолирующего слоя
                # "08-01-004-01 (рабочие)": 8 нормо-часов
                # "08-01-004-01 (машинисты)": 0.6 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':10,
        'Глина (кубометр)':1.15,
        'Вода для строительства (кубометр)':0.2,
        }

metadict_model['Кирпичная кладка (кубометр)'] = {
        # Пони используют 30-килограммовые керамические блоки.
        # Таблица ГЭСН 08-02-001 Кладка стен из кирпича:
            # http://www.norm-load.ru/SNiP/Data1/7/7148/index.htm#i363394
            # Кладка стен кирпичных наружных средней сложности:
            # "08-02-001-3 (рабочие)": 6 нормо-часов
        # Таблица ГЭСН 10-02-022 Сборка стен бескаркасных из арболитовых блоков:
            # http://www.norm-load.ru/SNiP/Data1/54/54271/index.htm#i1046999
            # "10-02-022-01 (рабочие)": 3 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':6,
        'Раствор кладочный М200 (кубометр)':0.24,
        'Кирпич керамический (штука)':400,
        'Вода для строительства (кубометр)':0.44,
        }

metadict_model['Основания под печи из бутового камня (кубометр)'] = {
        # Таблица ГЭСН 08-08-001 Основания под печи, очаги и трубы в нижних этажах зданий
        # http://www.norm-load.ru/SNiP/Data1/56/56028/index.htm#i1372848
            # 01. Кладка в готовых котлованах оснований из бутового камня или из кирпича и половняка.
            # 02. Устройство изоляции.
            # Измеритель: 1 м3 основания
                # "08-08-001-01 (рабочие)": 5.66 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':5.6,
        'Раствор кладочный М200 (кубометр)':0.41,
        'Камень бутовый (кубометр)':1.03,
        'Вода для строительства (кубометр)':0.04,
        }

metadict_model['Основания под печи из кирпича (кубометр)'] = {
        # Таблица ГЭСН 08-08-001 Основания под печи, очаги и трубы в нижних этажах зданий
        # http://www.norm-load.ru/SNiP/Data1/56/56028/index.htm#i1372848
            # 01. Кладка в готовых котлованах оснований из бутового камня или из кирпича и половняка.
            # 02. Устройство изоляции.
            # Измеритель: 1 м3 основания
                # "08-08-001-02 (рабочие)": 4.45 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':4.5,
        'Раствор кладочный М200 (кубометр)':0.36,
        'Кирпич-половняк керамический (кубометр)':0.6,
        'Кирпич керамический (штука)':190,
        'Вода для строительства (кубометр)':0.04,
        }

metadict_model['Кладка печей, очагов (кубометр)'] = {
        # Таблица ГЭСН 08-08-003 Кладка печей, очагов
        # http://www.norm-load.ru/SNiP/Data1/56/56028/index.htm#i1418573
            # 01. Кладка печей и очагов с устройством разделок и холодных четвертей.
            # 02. Установка приборов и металлических обрамлений-поясов.
            # 03. Приготовление глиняного раствора.
            # 04. Устройство и разборка подмостей, кружал и опалубки.
            # 05. Присоединение к дымоходам.
            # Измеритель: 1 м3 кладки (без вычета пустот)
                # "08-08-003-06 (рабочие)": 9 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':9,
        'Кирпич керамический (штука)':380,
        'Войлок строительный (килограмм)':2,
        'Прокат полосковый (килограмм)':9,
        'Вода для строительства (кубометр)':0.15,
        'Песок (кубометр)':0.14,
        'Глина (кубометр)':0.19,
        }

metadict_model['Кладка дымовых кирпичных труб (кубометр)'] = {
        # Таблица ГЭСН 08-08-005 Кладка дымовых кирпичных труб
        # http://www.norm-load.ru/SNiP/Data1/56/56028/index.htm#i1453093
            # 01. Кладка труб с устройством разделок, холодных четвертей.
            # 02. Устройство и разборка подмостей и опалубки.
            # 03. Установка стальных зонтов.
            # Измеритель: 1 м3 кладки (без вычета пустот)
                # "08-08-005-01 (рабочие)": 13 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':9,
        'Кирпич керамический (штука)':490,
        'Войлок строительный (килограмм)':3,
        'Прокат полосковый (килограмм)':10,
        'Раствор кладочный М200 (кубометр)':0.04,
        'Известь негашёная (килограмм)':0.6,
        'Песок (кубометр)':0.08,
        'Глина (кубометр)':0.12,
        }

metadict_model['Гидроизоляция боковая оклеенная (100 квадратных метров)'] = {
        # Исправить
            # Слишком дорого для маленьких пони. У них столько дёгдя попросту нет!
            # Или всё же есть? Нужно посчитать производство.
        # Таблица ГЭСН 08-01-003 Гидроизоляция стен, фундаментов
            # http://www.norm-load.ru/SNiP/Data1/56/56028/index.htm#i131121
            # 01. Огрунтовка поверхности.
            # 02. Наклейка рулонных материалов с разогреванием мастики.
            # 03. Укладка дополнительных слоев гидроизоляционных материалов
            # в местах сопряжения боковой изоляции с горизонтальной.
            # Измеритель:   100 м2 изолируемой поверхности
                # "08-01-003-05 (рабочие)": 47 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':47,
        'Битум строительный БН-90/10 (тонн)':0.016,
        'Керосин для технических целей КТ-1 (тонн)':0.024,
        'Битумная мастика (тонн)':0.44,
        'Материалы гидроизоляционные рулонные (квадратный метр)':230,
        }

metadict_model['Гидроизоляция горизонтальная оклеенная (100 квадратных метров)'] = {
        # Таблица ГЭСН 08-01-003 Гидроизоляция стен, фундаментов
            # http://www.norm-load.ru/SNiP/Data1/56/56028/index.htm#i131121
            # 01. Выравнивание изолируемой поверхности раствором.
            # 02. Наклейка рулонных материалов с разогреванием мастики.
            # Измеритель:   100 м2 изолируемой поверхности
                # "08-01-003-03 (рабочие)": 20.1 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':20,
        'Битум строительный БН-90/10 (тонн)':0.016,
        'Керосин для технических целей КТ-1 (тонн)':0.024,
        'Битумная мастика (тонн)':0.42,
        'Материалы гидроизоляционные рулонные (квадратный метр)':220,
        'Раствор кладочный М200 (кубометр)':2.5,
        }

metadict_model['Гидроизоляция горизонтальная цементная с жидким стеклом (100 квадратных метров)'] = {
        # Таблица ГЭСН 08-01-003 Гидроизоляция стен, фундаментов
            # http://www.norm-load.ru/SNiP/Data1/56/56028/index.htm#i131121
            # 01. Частичная приколка изолируемой поверхности.
            # 02. Нанесение изоляционного слоя из раствора с жидким стеклом.
            # Измеритель:   100 м2 изолируемой поверхности
                # "08-01-003-01 (рабочие)": 38.2 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':38,
        'Стекло жидкое калийное (килограмм)':50,
        'Раствор кладочный М200 (кубометр)':3.1,
        'Вода для строительства (кубометр)':0.225,
        }

metadict_model['Гидроизоляция боковая цементная с жидким стеклом (100 квадратных метров)'] = {
        # Таблица ГЭСН 08-01-003 Гидроизоляция стен, фундаментов
            # http://www.norm-load.ru/SNiP/Data1/56/56028/index.htm#i131121
            # 01. Частичная приколка изолируемой поверхности.
            # 02. Нанесение изоляционного слоя из раствора с жидким стеклом.
            # Измеритель:   100 м2 изолируемой поверхности
                # "08-01-003-04 (рабочие)": 88.8 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':90,
        'Стекло жидкое калийное (килограмм)':50,
        'Раствор отделочный цементно-известковый (кубометр)':2.8,
        'Вода для строительства (кубометр)':0.225,
        }

metadict_model['Рубка стен из брусьев толщиной 180 мм (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i77591
        # Таблица ГЭСН 10-01-007 Рубка стен из брусьев толщиной 180 мм
            # 01. Укладка подкладной доски с прокладкой просмоленной пакли, обернутой двумя слоями толя.
            # 02. Изготовление врубок на месте.
            # 03. Изготовление и установка нагелей (шипов).
            # 04. Рубка стен.
            # 05. Антисептирование нижних венцов.
            # 06. Первичная конопатка стен.
            # Измеритель: 100 м2 стен (за вычетом проемов)
                # "10-01-007-03 (рабочие)": 296 нормо-часов
                # "10-01-007-03 (машинисты)": 3.3 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':300,
        'Пакля пропитаная (килограмм)':263,
        'Брус обрезной (кубометр)':18.4,
        'Доска обрезная (кубометр)':0.19,
        'Войлок строительный (килограмм)':7,
        'Гвозди строительные (килограмм)':1,
        'Толь гидроизоляционный ТГ-350 (килограмм)':35.4,
        'Паста антисептическая строительная (килограмм)':5.25,
        }

metadict_model['Рубка стен из брусьев толщиной 100 мм (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i77591
        # Таблица ГЭСН 10-01-007 Рубка стен из брусьев толщиной 180 мм
            # 01. Укладка подкладной доски с прокладкой просмоленной пакли, обернутой двумя слоями толя.
            # 02. Изготовление врубок на месте.
            # 03. Изготовление и установка нагелей (шипов).
            # 04. Рубка стен.
            # 05. Антисептирование нижних венцов.
            # 06. Первичная конопатка стен.
            # Измеритель: 100 м2 стен (за вычетом проемов)
                # "10-01-007-03 (рабочие)": 286 нормо-часов
                # "10-01-007-03 (машинисты)": 3.3 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':290,
        'Пакля пропитаная (килограмм)':147,
        'Брус обрезной (кубометр)':10.2,
        'Доска обрезная (кубометр)':0.11,
        'Войлок строительный (килограмм)':7,
        'Гвозди строительные (килограмм)':1,
        'Толь гидроизоляционный ТГ-350 (килограмм)':33.6,
        'Паста антисептическая строительная (килограмм)':4.6,
        }

metadict_model['Сборка стен из брусьев (100 квадратных метров)'] = {
        # Исправить
            # Не используется
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i1116771
        # Таблица ГЭСН 10-02-024 Сборка стен из брусьев
            # 01. Сборка стен из брусьев с установкой обгонных досок и вкладышей,
            # прокладкой пакли обернутой толем под подкладную доску,
            # антисептированием нижних венцов и первичной конопаткой стен.
            # Измеритель: 100 м2 стен (за вычетом проемов)
                # "10-02-024-03 (рабочие)": 231 нормо-часов
                # "10-02-024-03 (машинисты)": 4.76 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':235,
        'Доска обрезная (кубометр)':0.19,
        'Войлок строительный (килограмм)':7,
        'Гвозди строительные (килограмм)':1,
        'Толь гидроизоляционный ТГ-350 (килограмм)':35.4,
        'Паста антисептическая строительная (килограмм)':5.25,
        }

metadict_model['Обшивка стен рубленых (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i105139
        # Таблица ГЭСН 10-01-008 Дополнительные работы по устройству деревянных стен
            # 01. Установка прибоин и обшивка досками.
            # Измеритель: 100 м2 стен, фронтонов (за вычетом проемов) и развернутых поверхностей карнизов
                # "10-01-008-01 (рабочие)": 40 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':40,
        'Доска обрезная (кубометр)':1.43,
        'Брус обрезной (кубометр)':0.64,
        'Гвозди строительные (килограмм)':3.7,
        }

metadict_model['Устройство стен каркасной конструкции (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i1066631
        # Таблица ГЭСН 10-02-019 Сборка стен каркасной конструкции
            # 01. Сборка наружных и внутренних стен с установкой рам каркаса,
            # верхних и нижних обвязок, заполнением каркаса плитами фибролитовыми.
            # 02. Обшивка стен плитами твердыми древесноволокнистыми
            # с устройством пароизоляции пергамином.
            # 03. Обшивка стен досками обшивки.
            # Измеритель: 100 м2 стен (за вычетом проемов)
                # Сборка стен каркасной конструкции наружных
                # с заполнением плитами фибролитовыми в 2 слоя
                # с обшивкой досками обшивки
                # "10-02-019-01 (рабочие)": 277.95 нормо-часов
                # "10-02-019-01 (машинисты)": 3.55 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':281,
        'Доска обрезная 25 мм (квадратный метр)':100,
        'Доска обрезная 15 мм (квадратный метр)':100,
        'Брус обрезной 50x150 мм (метр)':20,
        'Лёгкий саман для утепления (кубометр)':8,
        'Пергамин кровельный П-350 (квадратный метр)':111,
        'Поковки из квадратных заготовок (килограмм)':26,
        'Гвозди строительные (килограмм)':5.2,
        'Раствор отделочный цементно-известковый (кубометр)':0.36,
        }

metadict_model['Сборка стен каркасной конструкции (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i1066631
        # Таблица ГЭСН 10-02-019 Сборка стен каркасной конструкции
            # 01. Сборка наружных и внутренних стен с установкой рам каркаса,
            # верхних и нижних обвязок, заполнением каркаса плитами фибролитовыми.
            # 02. Обшивка стен плитами твердыми древесноволокнистыми
            # с устройством пароизоляции пергамином.
            # 03. Обшивка стен досками обшивки.
            # Измеритель: 100 м2 стен (за вычетом проемов)
                # Сборка стен каркасной конструкции наружных
                # с заполнением плитами фибролитовыми в 2 слоя
                # с обшивкой досками обшивки
                # "10-02-019-01 (рабочие)": 277.95 нормо-часов
                # "10-02-019-01 (машинисты)": 3.55 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':281,
        'Гвозди кровельные и толевые (килограмм)':2.5,
        'Гвозди строительные (килограмм)':2.7,
        'Раствор отделочный цементно-известковый (кубометр)':0.36,
        }

metadict_model['Устройство перекрытий с укладкой балок (на сруб) (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i216044
        # Таблица ГЭСН 10-01-021 Устройство перекрытий с укладкой балок
            # 01. Укладка балок с черепными брусками.
            # 02. Установка ригелей с креплением хомутами.
            # 03. Укладка наката.
            # 04. Прокладка пергамина.
            # 05. Утепление перекрытий плитами минераловатными.
            # Измеритель: 100 м2 перекрытий
                # "10-01-021-07 (рабочие)": 187.48 нормо-часов
                # "10-01-021-07 (машинисты)": 2.9 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':190,
        'Доска обрезная 25 мм (квадратный метр)':100,
        'Доска обрезная 15 мм (квадратный метр)':100,
        'Брус обрезной 50x150 мм (метр)':20,
        'Лёгкий саман для утепления (кубометр)':8,
        'Гвозди строительные (килограмм)':3.25,
        'Поковки из квадратных заготовок (килограмм)':26,
        'Пергамин кровельный П-350 (квадратный метр)':111,
        'Паста антисептическая строительная (килограмм)':5.25,
        }

metadict_model['Устройство перекрытий с укладкой балок (на каркас) (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i216044
        # Таблица ГЭСН 10-01-021 Устройство перекрытий с укладкой балок
            # 01. Укладка балок с черепными брусками.
            # 02. Установка ригелей с креплением хомутами.
            # 03. Укладка наката.
            # 04. Прокладка пергамина.
            # 05. Утепление перекрытий плитами минераловатными.
            # Измеритель: 100 м2 перекрытий
                # "10-01-021-11 (рабочие)": 124.26 нормо-часов
                # "10-01-021-11 (машинисты)": 1.94 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':126,
        'Доска обрезная 25 мм (квадратный метр)':100,
        'Доска обрезная 15 мм (квадратный метр)':100,
        'Брус обрезной 50x150 мм (метр)':20,
        'Лёгкий саман для утепления (кубометр)':8,
        'Гвозди строительные (килограмм)':3.25,
        'Поковки из квадратных заготовок (килограмм)':26,
        'Пергамин кровельный П-350 (квадратный метр)':111,
        'Паста антисептическая строительная (килограмм)':5.25,
        }

metadict_model['Установка стропил (кубометр)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i58796
        # Таблица ГЭСН 10-01-002 Установка стропил
            # 01. Изготовление элементов стропил из досок и брусьев.
            # 02. Контрольная сборка стропил на бойке.
            # 03. Укладка мауэрлатов с антисептированием пастами и обертыванием толем.
            # 04. Установка стропил с креплением.
            # Измеритель: 1 м3 древесины в конструкции
                # "10-01-002-01 (рабочие)": 24.09 нормо-часов
                # "10-01-002-01 (машинисты)": 2.7 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':26,
        'Поковки из квадратных заготовок (килограмм)':38,
        'Проволока стальная 6 мм (килограмм)':4.4,
        'Толь гидроизоляционный ТГ-350 (квадратный метр)':3.4,
        #'Доска обрезная (кубометр)':0.83,
        #'Брус обрезной (кубометр)':0.22,
        'Гвозди строительные (килограмм)':3.25,
        'Паста антисептическая строительная (килограмм)':2,
        }

metadict_model['Сборка деревянной кровли (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i1167653
        # Таблица ГЭСН 10-02-035 Сборка кровли, карнизов, фронтонов
            # 01. Сборка кровли с установкой стропил, подкосов, прогонов и устройством обрешетки,
            # сборка слуховых окон с устройством каркаса, обшивкой боковых стенок.
            # 02. Сборка карнизов с прибивкой кобылок, лобовой доски, подшивкой досками обшивки.
            # Измеритель: 100 м2 кровли, развернутой поверхности карниза, фронтонов
                # "10-02-035-01 (рабочие)": 58 нормо-часов
                # "10-02-035-01 (машинисты)": 0.63 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':60,
        'Подковки из квадратных заготовок (килограмм)':18,
        'Подковки оцинкованные (килограмм)':10,
        'Гвозди кровельные и толевые (килограмм)':1.8,
        'Толь гидроизоляционный ТГ-350 (квадратный метр)':5,
        }

metadict_model['Устройство кровли из оцинкованной стали (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56036/index.htm#i155271
        # Таблица ГЭСН 12-01-007 Устройство кровель различных типов
            # 01. Устройство обрешетки.
            # 02. Устройство кровель с обделкой коньков, ребер, разжелобков, труб,
            # примыканий к стенам и слуховым окнам с заделкой зазоров раствором.
                # "12-01-007-09 (рабочие)": 98.6 нормо-часов
                # "12-01-007-09 (машинисты)": 0.54 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':100,
        'Гвозди кровельные и толевые (килограмм)':7.2,
        'Поковки из квадратных заготовок (килограмм)':73,
        'Сталь оцинкованная 0.7 мм (квадратный метр)':105,
        'Доска обрезная (кубометр)':1.8,
        }

metadict_model['Устройство внутриквартирных лестниц (квадратный метр)'] = {
        # Пони маленькие создания (рост в холке 60 см, длина ноги 35 см):
            # Проступёнок (вертикаль, высота подъёма) -- 0.1 метра
            # Проступь (горизонтальная плоскость) -- 0.2 метра
            # В лестнице должно быть 22-24 ступени, длина 4.8 метра, плюс площадки.
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i535307
        # Таблица ГЭСН 10-01-052 Устройство внутриквартирных лестниц, крылец и козырьков
            # 01. Изготовление элементов, сборка и установка лестничных маршей, площадок со стойками, перил.
            # 02. Подшивка лестничных маршей и площадок досками.
            # Измеритель: 1 м2 горизонтальной проекции
                # 10-01-052-1 (рабочие): 5 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':5,
        'Гвозди строительные (килограмм)':0.34,
        'Доска обрезная (кубометр)':0.25,
        'Брус обрезной (кубометр)':0.05,
        }

metadict_model['Устройство крылец (квадратный метр)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i535307
        # Таблица ГЭСН 10-01-052 Устройство внутриквартирных лестниц, крылец и козырьков
            # 01. Заготовка и установка элементов крылец.
            # Измеритель: 1 м2 горизонтальной проекции
                # 10-01-052-3 (рабочие): 8.5 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':9,
        'Гвозди строительные (килограмм)':0.8,
        'Доска обрезная (кубометр)':0.15,
        'Брус обрезной (кубометр)':0.2,
        }

metadict_model['Устройство козырьков (квадратный метр)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i535307
        # Таблица ГЭСН 10-01-052 Устройство внутриквартирных лестниц, крылец и козырьков
            # 01. Заготовка и установка элементов козырьков.
            # Измеритель: 1 м2 горизонтальной проекции
                # 10-01-052-4 (рабочие): 5 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':5,
        'Гвозди строительные (килограмм)':0.12,
        'Доска обрезная (кубометр)':0.03,
        'Брус обрезной (кубометр)':0.02,
        }

metadict_model['Устройство заборов (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i667935
        # Таблица ГЭСН 10-01-070 Устройство заборов
            # 01. Заготовка, антисептирование и установка деревянных столбов в готовые ямы
            # на подкладки из кирпича с последующей обратной засыпкой.
            # 02. Изготовление щитов забора с установкой и креплением их.
            # Измеритель: 100 м2 забора
                # Устройство заборов (с установкой столбов):
                # Решетчатых высотой до 1,2 м
                # 10-01-070-02 (рабочие): 135 нормо-часов
                # 10-01-070-02 (машинисты): 3.5 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':135,
        'Болты с гайками и шайбами строительные (килограмм)':29,
        'Лесоматериалы круглые 140-270 мм (кубометр)':1.77,
        'Гвозди строительные (килограмм)':5.6,
        'Брус обрезной (кубометр)':1.09 + 1.34,
        'Паста антисептическая строительная (килограмм)':3.9,
        'Кирпич керамический (штука)':88,
        }

metadict_model['Устройство калиток (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i674023
        # Таблица ГЭСН 10-01-071 Устройство калиток
            # 01. Заготовка, антисептирование и установка деревянных столбов в готовые ямы
            # на подкладки из кирпича с последующей обратной засыпкой.
            # 02. Изготовление элементов калиток с постановкой поковок и навеской их.    
            # Измеритель: 100 м2 калиток
                # Устройство калиток (с установкой столбов):
                # Решетчатых высотой до 1,2 м
                # 10-01-071-02 (рабочие): 369 нормо-часов
                # 10-01-071-02 (машинисты): 2.9 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':372,
        'Поковки из квадратных заготовок (килограмм)':100,
        'Болты с гайками и шайбами строительные (килограмм)':100,
        'Лесоматериалы круглые 140-270 мм (кубометр)':4.16,
        'Гвозди строительные (килограмм)':3.5,
        'Брус обрезной (кубометр)':3.41 + 0.64,
        'Доска обрезная (кубометр)':1.84,
        'Паста антисептическая строительная (килограмм)':10.5,
        'Кирпич керамический (штука)':360,
        }

metadict_model['Установка дверных блоков (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i423740
        # Таблица ГЭСН 10-01-040 Заполнение наружных и внутренних дверных проемов отдельными элементами в деревянных рубленых стенах
            # 01. Установка коробок с прибивкой вертикальных брусков для образования гребня,
            # выборкой паза в торцах брусьев (бревен).
            # 02. Пригонка и навеска дверных полотен с установкой приборов.
            # 03. Установка наличников.
            # Измеритель: 100 м2 проемов
            # Заполнение наружных и внутренних дверных проемов отдельными элементами
            # в деревянных рубленых стенах, площадь проема:
                # "10-01-040-1 (рабочие)": 442 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':442,
        'Гвозди строительные (килограмм)':0.3,
        'Ерши металлические (килограмм)':25,
        'Брус обрезной (кубометр)':0.59,
        'Наличники (метр)':660,
        'Коробки дверные (метр)':315,
        #'Полотна для блоков дверных (квадратный метр)':85,
        }

metadict_model['Установка оконных блоков (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i255538
        # Таблица ГЭСН 10-01-027 Установка в жилых и общественных зданиях блоков оконных с переплетами:
            # 01. Установка блоков.
            # 02. Прибивка к коробкам вертикальных брусков для образования гребня
            # и выборка паза в торцах брусьев (бревен).
            # 03. Конопатка коробок.
            # 04. Установка накладных приборов
            # Измеритель: 100 м2 проемов
                # "10-01-027-07" (рабочие): 470 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':470,
        'Брус обрезной (кубометр)':0.63,
        'Пакля пропитаная (килограмм)':260,
        'Гвозди строительные (килограмм)':16,
        'Шурупы строительные (килограмм)':11.4,
        'Паста антисептическая строительная (килограмм)':2.2,
        'Доски подоконные деревянные (метр)':83,
        #'Блоки оконные (квадратный метр)':100,
        'Вода для строительства (кубометр)':2,
        'Наличники (метр)':587,
        }

metadict_model['Установка мебели (100 штук)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i586522
        # Таблица ГЭСН 10-01-059 Установка штучных изделий
            # Установка столов, шкафов под мойки, холодильных шкафов и др.
            # 01. Установка штучных изделий с креплением, уплотнением швов примыкания раскладками.
            # Измеритель: 100 шт. изделий
                # "10-01-059-01" (рабочие): 75.15 нормо-часов
                # "10-01-059-01" (машинисты): 2.3 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':78,
        'Гвозди строительные (килограмм)':12,
        'Подковки из квадратных заготовок (килограмм)':35,
        'Штапик деревянный 19x19 мм (метров)':400,
        }

metadict_model['Простая окраска масляными составами (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/54/54295/index.htm#i1635472
        # Таблица ГЭСН 15-04-024 Простая окраска масляными составами
            # Простая окраска масляными составами по дереву:
            # 15-04-024-01      стен
            # Измеритель: 100 м2 окрашиваемой поверхности
                # "15-04-024-01" (рабочие): 28 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':28,
        'Олифа комбинированная марки К-2 (килограмм)':8.4,
        'Шпатлевка масляно-клеевая (килограмм)':5,
        'Краски (килограмм)':27,
        }

metadict_model['Улучшенная окраска масляными составами (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/54/54295/index.htm#i1656646
        # Таблица ГЭСН 15-04-025 Улучшенная окраска масляными составами
            # Улучшенная окраска масляными составами по дереву:
            # 15-04-025-01    стен
            # Измеритель: 100 м2 окрашиваемой поверхности
                # "15-04-025-01" (рабочие): 58.52 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':58,
        'Олифа для улучшенной окраски (килограмм)':9.1,
        'Шпатлевка масляно-клеевая (килограмм)':38,
        'Краски (килограмм)':26,
        }

metadict_model['Улучшенная штукатурка цементно-известковым раствором (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56039/index.htm#i707554
        # Таблица ГЭСН 15-02-001 Улучшенная штукатурка цементно-известковым раствором по камню
            # 01. Подготовка поверхности.
            # 02. Нанесение раствора на поверхности с разравниванием и затиркой накрывного слоя.
            # 03. Вытягивание тяг с разделкой углов.
            # 04. Уход за штукатуркой.
            # Измеритель: 100 м2 оштукатуриваемой поверхности
            # Улучшенная штукатурка фасадов цементно-известковым раствором по камню:
            # 15-02-001-01      стен
                # "15-02-001-01" (рабочие): 70.88 нормо-часа
                # "15-02-001-01" (машинисты): 2.78 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':75,
        'Раствор отделочный цементно-известковый (кубометр)':1.89,
        'Вода для строительства (кубометр)':0.35,
        }

metadict_model['Облицовка керамическими плитками (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56039/index.htm#i226171
        # Таблица ГЭСН 15-01-019 Гладкая облицовка стен, столбов, пилястр и откосов
            # 01. Набивка по деревянным поверхностям проволочной сетки 
                # и устройство подготовительного слоя с нарезкой борозд.
            # 02. Сортировка плиток.
            # 03. Облицовка поверхностей.
            # 04. Перерубка плиток и подточка кромок.
            # 05. Заполнение швов.
            # 06. Распудривание облицованных поверхностей.
            # 07. Очистка и промывка поверхности облицовки.
            # Гладкая облицовка стен, столбов, пилястр и откосов
                # (без карнизных, плинтусных и угловых плиток)
                # с установкой плиток туалетного гарнитура на клее из сухих смесей:
            # Измеритель: 100 м2 поверхности облицовки
            # 15-01-019-08      по дереву
                # "15-04-025-01" (рабочие): 204.07 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':206,
        'Сетка проволочная тканая с ячейками №5 (квадратный метр)':105,
        'Плитки керамические рядковые (квадратный метр)':99,
        'Клей для облицовочных работ (килограмм)':375,
        'Смесь сухая для заделки швов (килограмм)':50,
        'Раствор отделочный цементно-известковый (кубометр)':1.2,
        'Вода для строительства (кубометр)':0.93,
        }

metadict_model['Прокладка 50-мм трубопровода канализации (100 метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56040/index.htm#i106890
        # Таблица ГЭСН 16-01-005 Прокладка по стенам зданий и в каналах трубопроводов
        # из чугунных канализационных труб
            # 01. Прокладка трубопровода из готовых узлов с заделкой раструбов.
            # 02. Установка и заделка креплений.
            # 03. Установка задвижек.
            # 04. Гидравлическое испытание трубопровода.
            # Измеритель: 100 м трубопровода
            # Прокладка по стенам зданий и в каналах трубопроводов
            # из чугунных канализационных труб диаметром:
            # 16-01-005-01                         50 мм
                # "16-01-005-01" (рабочие): 77.7 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':77.7,
        'Каболка (килограмм)':8,
        'Цемент гипсоглинозёмный расширяющийся (килограмм)':22,
        'Чугунная труба диаметром 50-мм (метр)':100,
        'Муфты надвижные для чугунных труб диаметром 50-мм':10,
        'Вода для строительства (кубометр)':0.39,
        }

metadict_model['Прокладка 50-мм водопровода (100 метров)'] = {
        '_-Работа строительной бригады (нормо-часов)':77.7,
        'Каболка (килограмм)':8,
        'Цемент гипсоглинозёмный расширяющийся (килограмм)':22,
        'Чугунная труба диаметром 50-мм (метр)':100,
        'Муфты надвижные для чугунных труб диаметром 50-мм':10,
        'Вода для строительства (кубометр)':0.39,
        }

metadict_model['Прокладка 150-мм трубопровода канализации (100 метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56040/index.htm#i106890
        # Таблица ГЭСН 16-01-005 Прокладка по стенам зданий и в каналах трубопроводов
        # из чугунных канализационных труб
            # 01. Прокладка трубопровода из готовых узлов с заделкой раструбов.
            # 02. Установка и заделка креплений.
            # 03. Установка задвижек.
            # 04. Гидравлическое испытание трубопровода.
            # Измеритель: 100 м трубопровода
            # Прокладка по стенам зданий и в каналах трубопроводов
            # из чугунных канализационных труб диаметром:
            # 16-01-005-03                         150 мм
                # "16-01-005-03" (рабочие): 101 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':101,
        'Каболка (килограмм)':12,
        'Цемент гипсоглинозёмный расширяющийся (килограмм)':31,
        'Чугунная труба диаметром 150-мм (метр)':100,
        'Муфты надвижные для чугунных труб диаметром 150-мм':10,
        'Вода для строительства (кубометр)':3.53,
        }

metadict_model['Сборка дощатых перегородок (100 метров)'] = {
        # Исправить
            # Это именно сборка, без подготовки дощатых щитов.
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i1143783
        # Таблица ГЭСН 10-02-031 Сборка перегородок
            # 01. Сборка перегородок щитовых.
            # Измеритель: 100 м2 панелей и перегородок (без вычета проемов)
            # 10-02-031-03     дощатых щитовых
                # "10-02-031-03" (рабочие): 46.89 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':47,
        'Гвозди строительные (килограмм)':8,
        }

#----
# Строительство зданий, сооружений (оценочно):

metadict_model['Прокладка 150-мм вытяжной трубы (100 метров)'] = {
        '_-Работа строительной бригады (нормо-часов)':101,
        'Цемент гипсоглинозёмный расширяющийся (килограмм)':31,
        'Чугунная труба воздуховода диаметром 150-мм (метр)':100,
        'Муфты надвижные для чугунных труб диаметром 150-мм':10,
        'Вода для строительства (кубометр)':3.53,
        }

metadict_model['Устройство деревянной кровли (100 квадратных метров)'] = {
        # Исправить
            # Уточнить трудозатраты
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i1167653
        # Таблица ГЭСН 10-02-035 Сборка кровли, карнизов, фронтонов
            # 01. Сборка кровли с установкой стропил, подкосов, прогонов и устройством обрешетки,
            # сборка слуховых окон с устройством каркаса, обшивкой боковых стенок.
            # 02. Сборка карнизов с прибивкой кобылок, лобовой доски, подшивкой досками обшивки.
            # Измеритель: 100 м2 кровли, развернутой поверхности карниза, фронтонов
                # "10-02-035-01 (рабочие)": 58 нормо-часов
                # "10-02-035-01 (машинисты)": 0.63 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':160,
        'Гвозди кровельные и толевые (килограмм)':3.25,
        'Доска обрезная 20 мм (квадратный метр)':100 * 2,
        'Брус обрезной 50x150 мм (метр)':20,
        'Поковки из квадратных заготовок (килограмм)':26,
        'Пергамин кровельный П-350 (квадратный метр)':111,
        }

metadict_model['Устройство черепичной кровли (100 квадратных метров)'] = {
        # Исправить
            # Уточнить трудозатраты
        # http://www.arhplan.ru/img/articles/ris-94-ustroystvo-cherepichnoy-krovli.jpg
        # 1) Брусчатое или дощатое основание (зависит от вида черепицы)
        # 2) Монтаж черепицы внахлёст (каждая черепица имеет фальц и пазы)
        # 3) Штукатурка известковым раствором (со стороны чердака)
        '_-Работа строительной бригады (нормо-часов)':300,
        'Брус обрезной 50x50 мм (метр)':100,
        'Гвозди кровельные и толевые (килограмм)':3.25,
        'Поковки из квадратных заготовок (килограмм)':26,
        'Черепица керамическая желобчатая (квадратный метр)':122,
        'Раствор отделочный цементно-известковый (кубометр)':2.8,
        }

metadict_model['Устройство террас (100 квадратных метров)'] = {
        # Исправить
            # Уточнить материалы (особенно для перил)
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i1222167
        # Таблица ГЭСН 10-02-045 Сборка веранд и террас
            # 01. Сборка террас с установкой каркасов, ограждений и устройством карнизов.
            # Измеритель: 100 м2 пола
            # Сборка: террас
                # 10-02-045-2 (рабочие): 99.41 нормо-часов
                # 10-02-045-2 (машинисты): 0.41 нормо-часов
        '_-Работа строительной бригады (нормо-часов)':101,
        'Гвозди строительные (килограмм)':40,
        'Битумная мастика (тонн)':0.109,
        'Доска обрезная 25 мм (квадратный метр)':100,
        'Лесоматериалы круглые 140-270 мм (кубометр)':1.77,
        'Брус обрезной 50x150 мм (метр)':20,
        }

metadict_model['Укладка соломенной кровли (100 квадратных метров)'] = {
        # http://www.krovlirussia.ru/rubriki/materialy-i-texnologii/kamyshovye-kryshi-sposoby-ukladki-krovelnoj-solomy
        # Жерди каждые 0.3 метра, на них крепятся снопики соломы.
        '_-Работа строительной бригады (нормо-часов)':160,
        'Проволока вязальная (килограмм)':23,
        'Жерди диаметром 40 мм (метр)':1 / 0.4 * 100,
        'Кровельная солома 300 мм (квадратный метр)':105,
        }

metadict_model['Земляные работы немеханизированные (кубометр)'] = {
        # Исправить
            # Вообще-то пони используют отвалы.
            # https://vignette.wikia.nocookie.net/mlp/images/d/dc/Stallions_Angry_S1E11.png
        # Мини-бульдозер массой 300 кг с 30-кВт движком (типичный пегас) -- 36 кубометров/час
        # Производительность человека с малой пехотной лопаткой -- 0.5 кубометра/час
        # С большой сапёрной лопатой -- 1 кубометр/час
        '_-Работа землекопа (нормо-часов)':20/60,
        'Использование тележки с отвалом для земляных работ (часов)':20/60,
        }

metadict_model['Конопатка стен из брусьев (100 квадратных метров)'] = {
        # Исправить
            # Уточнить
        # Баня 5x4 метра (36 кв. метров?) -- 10 дней, один человек на 7-8 часов (75 нормо-часов).
        '_-Работа строительной бригады (нормо-часов)':210,
        'Пакля пропитаная (килограмм)':147,
        }

metadict_model['Устройство дощатых перегородок (100 квадратных метров)'] = {
        # Исправить
            # Это именно сборка, без подготовки дощатых щитов.
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i1143783
        # Таблица ГЭСН 10-02-031 Сборка перегородок
            # 01. Сборка перегородок щитовых.
            # Измеритель: 100 м2 панелей и перегородок (без вычета проемов)
            # 10-02-031-03     дощатых щитовых
                # "10-02-031-03" (рабочие): 46.89 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':87,
        'Гвозди строительные (килограмм)':4,
        'Доска обрезная 15 мм (квадратный метр)':100,
        'Брус обрезной 50x150 мм (метр)':10,
        'Поковки из квадратных заготовок (килограмм)':16,
        }

metadict_model['Устройство дощатых перекрытий (на каркас) (100 квадратных метров)'] = {
        # http://www.norm-load.ru/SNiP/Data1/56/56034/index.htm#i216044
        # Таблица ГЭСН 10-01-021 Устройство перекрытий с укладкой балок
            # 01. Укладка балок с черепными брусками.
            # 02. Установка ригелей с креплением хомутами.
            # 03. Укладка наката.
            # 04. Прокладка пергамина.
            # 05. Утепление перекрытий плитами минераловатными.
            # Измеритель: 100 м2 перекрытий
                # "10-01-021-11 (рабочие)": 124.26 нормо-часов
                # "10-01-021-11 (машинисты)": 1.94 нормо-часа
        '_-Работа строительной бригады (нормо-часов)':90,
        'Доска обрезная 25 мм (квадратный метр)':100,
        'Брус обрезной 50x150 мм (метр)':20,
        'Гвозди строительные (килограмм)':3.25,
        'Поковки из квадратных заготовок (килограмм)':26,
        'Паста антисептическая строительная (килограмм)':5.25,
        }
