#----
# Семьи:
    # Модель жизненного цикла крестьянского дворохозяйства (2002)
    # http://vln.by/node/117

metadict_army['Семья горожан'] = {
        'Горожане':5,
        '-Городское домохозяйство':1,
        }

metadict_army['Семья селян'] = {
        'Селяне':5,
        '-Сельское домохозяйство':1,
        }

#----
# Поселенцы:

metadict_army['Горожане'] = {
        'Земнопони':0.25,
        'Единороги':0.35,
        'Пегасы':0.4,
        }

metadict_army['Селяне'] = {
        'Земнопони':0.9,
        'Единороги':0.02,
        'Пегасы':0.08,
        }

#----
# Распределение полов

metadict_army['Земнопони'] = {
        'Кобылки-земнопони':0.58333,
        'Жеребцы-земнопони':0.41667,
        }

metadict_army['Пегасы'] = {
        'Кобылки-пегаски':0.65,
        'Жеребцы-пегасы':0.35,
        }

metadict_army['Единороги'] = {
        'Кобылки-единорожки':0.587,
        'Жеребцы-единороги':0.413,
        }

#----
# Распределение возрастов

metadict_army['Жеребцы-единороги'] = {
        'Жеребцы-единороги (0 лет)':0.014988,
        'Жеребцы-единороги (1-10 лет)':0.148190,
        'Жеребцы-единороги (11-20 лет)':0.144952,
        'Жеребцы-единороги (21-30 лет)':0.141175,
        'Жеребцы-единороги (31-40 лет)':0.136077,
        'Жеребцы-единороги (41-50 лет)':0.127839,
        'Жеребцы-единороги (51-60 лет)':0.112374,
        'Жеребцы-единороги (61-70 лет)':0.093309,
        'Жеребцы-единороги (71-80 лет)':0.065296,
        'Жеребцы-единороги (81-90 лет)':0.015800,
        }

metadict_army['Жеребцы-земнопони'] = {
        'Жеребцы-земнопони (0 лет)':0.014988,
        'Жеребцы-земнопони (1-10 лет)':0.148190,
        'Жеребцы-земнопони (11-20 лет)':0.144952,
        'Жеребцы-земнопони (21-30 лет)':0.141175,
        'Жеребцы-земнопони (31-40 лет)':0.136077,
        'Жеребцы-земнопони (41-50 лет)':0.127839,
        'Жеребцы-земнопони (51-60 лет)':0.112374,
        'Жеребцы-земнопони (61-70 лет)':0.093309,
        'Жеребцы-земнопони (71-80 лет)':0.065296,
        'Жеребцы-земнопони (81-90 лет)':0.015800,
        }

metadict_army['Жеребцы-пегасы'] = {
        'Жеребцы-пегасы (0 лет)':0.014988,
        'Жеребцы-пегасы (1-10 лет)':0.148190,
        'Жеребцы-пегасы (11-20 лет)':0.144952,
        'Жеребцы-пегасы (21-30 лет)':0.141175,
        'Жеребцы-пегасы (31-40 лет)':0.136077,
        'Жеребцы-пегасы (41-50 лет)':0.127839,
        'Жеребцы-пегасы (51-60 лет)':0.112374,
        'Жеребцы-пегасы (61-70 лет)':0.093309,
        'Жеребцы-пегасы (71-80 лет)':0.065296,
        'Жеребцы-пегасы (81-90 лет)':0.015800,
        }

metadict_army['Кобылки-единорожки'] = {
        'Кобылки-единорожки (0 лет)':0.014988,
        'Кобылки-единорожки (1-10 лет)':0.148190,
        'Кобылки-единорожки (11-20 лет)':0.144952,
        'Кобылки-единорожки (21-30 лет)':0.141175,
        'Кобылки-единорожки (31-40 лет)':0.136077,
        'Кобылки-единорожки (41-50 лет)':0.127839,
        'Кобылки-единорожки (51-60 лет)':0.112374,
        'Кобылки-единорожки (61-70 лет)':0.093309,
        'Кобылки-единорожки (71-80 лет)':0.065296,
        'Кобылки-единорожки (81-90 лет)':0.015800,
        }

metadict_army['Кобылки-земнопони'] = {
        'Кобылки-земнопони (0 лет)':0.014988,
        'Кобылки-земнопони (1-10 лет)':0.148190,
        'Кобылки-земнопони (11-20 лет)':0.144952,
        'Кобылки-земнопони (21-30 лет)':0.141175,
        'Кобылки-земнопони (31-40 лет)':0.136077,
        'Кобылки-земнопони (41-50 лет)':0.127839,
        'Кобылки-земнопони (51-60 лет)':0.112374,
        'Кобылки-земнопони (61-70 лет)':0.093309,
        'Кобылки-земнопони (71-80 лет)':0.065296,
        'Кобылки-земнопони (81-90 лет)':0.015800,
        }

metadict_army['Кобылки-пегаски'] = {
        'Кобылки-пегаски (0 лет)':0.014988,
        'Кобылки-пегаски (1-10 лет)':0.148190,
        'Кобылки-пегаски (11-20 лет)':0.144952,
        'Кобылки-пегаски (21-30 лет)':0.141175,
        'Кобылки-пегаски (31-40 лет)':0.136077,
        'Кобылки-пегаски (41-50 лет)':0.127839,
        'Кобылки-пегаски (51-60 лет)':0.112374,
        'Кобылки-пегаски (61-70 лет)':0.093309,
        'Кобылки-пегаски (71-80 лет)':0.065296,
        'Кобылки-пегаски (81-90 лет)':0.015800,
        }

#----
# Профессии

metadict_army['Жеребцы-единороги (0 лет)'] = {                       
        'Единороги-младенцы':1,
        }

metadict_army['Жеребцы-единороги (1-10 лет)'] = {
        'Единороги-дети':6/9,
        'Единороги-школьники':3/9,
        }

metadict_army['Жеребцы-единороги (11-20 лет)'] = {
        'Единороги-школьники':4/9,
        'Единороги-подмастерья':5/9,
        }

metadict_army['Жеребцы-единороги (21-30 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (31-40 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (41-50 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (51-60 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Жеребцы-единороги (61-70 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-единороги (71-80 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-единороги (81-90 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Жеребцы-земнопони (0 лет)'] = {
        'Земнопони-младенцы':1,
        }

metadict_army['Жеребцы-земнопони (1-10 лет)'] = {
        'Земнопони-дети':6/9,
        'Земнопони-школьники':3/9,
        }

metadict_army['Жеребцы-земнопони (11-20 лет)'] = {
        'Земнопони-школьники':4/9,
        'Земнопони-подмастерья':5/9,
        }

metadict_army['Жеребцы-земнопони (21-30 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (31-40 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (41-50 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (51-60 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Жеребцы-земнопони (61-70 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-земнопони (71-80 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-земнопони (81-90 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Жеребцы-пегасы (0 лет)'] = {
        'Пегасы-младенцы':1,
        }

metadict_army['Жеребцы-пегасы (1-10 лет)'] = {
        'Пегасы-дети':6/9,
        'Пегасы-школьники':3/9,
        }

metadict_army['Жеребцы-пегасы (11-20 лет)'] = {
        'Пегасы-школьники':4/9,
        'Пегасы-подмастерья':5/9,
        }

metadict_army['Жеребцы-пегасы (21-30 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (31-40 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (41-50 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (51-60 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Жеребцы-пегасы (61-70 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Жеребцы-пегасы (71-80 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Жеребцы-пегасы (81-90 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-единорожки (0 лет)'] = {                           
        'Единороги-младенцы':1,
        }

metadict_army['Кобылки-единорожки (1-10 лет)'] = {
        'Единороги-дети':6/9,
        'Единороги-школьники':3/9,
        }

metadict_army['Кобылки-единорожки (11-20 лет)'] = {
        'Единороги-школьники':4/9,
        'Единороги-подмастерья':5/9,
        }

metadict_army['Кобылки-единорожки (21-30 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (31-40 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (41-50 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (51-60 лет)'] = {
        'Единороги-рабочие':1,
        }

metadict_army['Кобылки-единорожки (61-70 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-единорожки (71-80 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-единорожки (81-90 лет)'] = {
        'Единороги-старики':1,
        }

metadict_army['Кобылки-земнопони (0 лет)'] = {
        'Земнопони-младенцы':1,
        }

metadict_army['Кобылки-земнопони (1-10 лет)'] = {
        'Земнопони-дети':6/9,
        'Земнопони-школьники':3/9,
        }

metadict_army['Кобылки-земнопони (11-20 лет)'] = {
        'Земнопони-школьники':4/9,
        'Земнопони-подмастерья':5/9,
        }

metadict_army['Кобылки-земнопони (21-30 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (31-40 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (41-50 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (51-60 лет)'] = {
        'Земнопони-рабочие':1,
        }

metadict_army['Кобылки-земнопони (61-70 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-земнопони (71-80 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-земнопони (81-90 лет)'] = {
        'Земнопони-старики':1,
        }

metadict_army['Кобылки-пегаски (0 лет)'] = {
        'Пегасы-младенцы':1,
        }

metadict_army['Кобылки-пегаски (1-10 лет)'] = {
        'Пегасы-дети':6/9,
        'Пегасы-школьники':3/9,
        }

metadict_army['Кобылки-пегаски (11-20 лет)'] = {
        'Пегасы-школьники':4/9,
        'Пегасы-подмастерья':5/9,
        }

metadict_army['Кобылки-пегаски (21-30 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (31-40 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (41-50 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (51-60 лет)'] = {
        'Пегасы-рабочие':1,
        }

metadict_army['Кобылки-пегаски (61-70 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-пегаски (71-80 лет)'] = {
        'Пегасы-старики':1,
        }

metadict_army['Кобылки-пегаски (81-90 лет)'] = {
        'Пегасы-старики':1,
        }

#----
# Трудовые ресурсы

metadict_army['Единороги-младенцы'] = {
        # Исправить
            # Здесь же рассчитай потребность в родильных домах, школах, больницах.
        '-Младенцы':1,
        }

metadict_army['Единороги-дети'] = {
        '-Дети':1,
        }

metadict_army['Единороги-школьники'] = {
        '-Школьники':1,
        }

metadict_army['Единороги-подмастерья'] = {
        '_+Работа единорога (дней/год)':200 / 2,
        '-Подмастерья':1,
        }

metadict_army['Единороги-рабочие'] = {
        '_+Работа единорога (дней/год)':200,
        '-Рабочие':1,
        }

metadict_army['Единороги-старики'] = {
        '_+Работа единорога (дней/год)':200 / 2,
        '-Старики':1,
        }

metadict_army['Земнопони-младенцы'] = {
        '-Младенцы':1,
        }

metadict_army['Земнопони-дети'] = {
        '-Дети':1,
        }

metadict_army['Земнопони-школьники'] = {
        '-Школьники':1,
        }

metadict_army['Земнопони-подмастерья'] = {
        '_+Работа земнопони (дней/год)':200 / 2,
        '-Подмастерья':1,
        }

metadict_army['Земнопони-рабочие'] = {
        '_+Работа земнопони (дней/год)':200,
        '-Рабочие':1,
        }

metadict_army['Земнопони-старики'] = {
        '_+Работа земнопони (дней/год)':200 / 2,
        '-Старики':1,
        }

metadict_army['Пегасы-младенцы'] = {
        '-Младенцы':1,
        }

metadict_army['Пегасы-дети'] = {
        '-Дети':1,
        }

metadict_army['Пегасы-школьники'] = {
        '-Школьники':1,
        }

metadict_army['Пегасы-подмастерья'] = {
        '_+Работа пегаса (дней/год)':200 / 2,
        '-Подмастерья':1,
        }

metadict_army['Пегасы-рабочие'] = {
        '_+Работа пегаса (дней/год)':200,
        '-Рабочие':1,
        }

metadict_army['Пегасы-старики'] = {
        '_+Работа пегаса (дней/год)':200 / 2,
        '-Старики':1,
        }

#----
# Возрасты (упрощение)

metadict_army['-Младенцы'] = {
        '--Жеребята':1,
        }

metadict_army['-Дети'] = {
        '--Жеребята':1,
        }

metadict_army['-Школьники'] = {
        '--Жеребята':1,
        }

metadict_army['-Подмастерья'] = {
        '--Жеребята':1,
        }

metadict_army['-Рабочие'] = {
        '--Взрослые':1,
        }

metadict_army['-Старики'] = {
        '--Пожилые':1,
        }

#----
# Возрасты (объединение)

metadict_army['--Жеребята'] = {
        '-Эквестрийские пони':1,
        }

metadict_army['--Взрослые'] = {
        '-Эквестрийские пони':1,
        }

metadict_army['--Пожилые'] = {
        '-Эквестрийские пони':1,
        }

#----
# Трудовые ресурсы (нормо-часы)

metadict_army['_+Работа единорога (дней/год)'] = {
        '_+Работа единорога (нормо-часов)':8,
        }

metadict_army['_+Работа земнопони (дней/год)'] = {
        '_+Работа земнопони (нормо-часов)':8,
        }

metadict_army['_+Работа пегаса (дней/год)'] = {
        '_+Работа пегаса (нормо-часов)':8,
        }
