#----
# Готовы блюда, заготовки:

metadict_detail['Варёный картофель (килограмм)'] = {
        # Расчеты производительности и количества персонала для овощного цеха:
        # https://www.pitportal.ru/chef2010/10921.html
        'Картофель (килограмм)':1.25,
        'Вода для готовки (литр)':1,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Варёный батат (килограмм)'] = {
        'Батат (килограмм)':1.25,
        'Вода для готовки (литр)':1,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Варёная морковь (килограмм)'] = {
        'Морковь (килограмм)':1.2,
        'Вода для готовки (литр)':1,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Варёная свёкла (килограмм)'] = {
        'Свёкла столовая (килограмм)':1.25,
        'Вода для готовки (литр)':1,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Варёный лук (килограмм)'] = {
        'Лук репчатый (килограмм)':1.16,
        'Вода для готовки (литр)':1,
        '_-Варка корнеплодов (килограмм)':1,
        }

metadict_detail['Яблоко мочёное (килограмм)'] = {
        # Годными считаются только 80% плодов.
        # Затраты свежих яблок - до 1100 кг на 1 г готового продукта
            # http://konservirovanie.su/books/item/f00/s00/z0000000/st010.shtml
        'Яблоко (килограмм)':1.3,
        'Рассол для мочения фруктов (килограмм)':1,
        '_-Домашняя консервация фруктов (килограмм)':1,
        '|=Бочка мочёных яблок (килограмм)':1 * 2,
        '|=Бочка мочёных яблок (литр)':1.2 * 2,
        }

metadict_detail['Груша мочёная (килограмм)'] = {
        'Груша (килограмм)':1.3,
        'Рассол для мочения фруктов (килограмм)':1,
        '_-Домашняя консервация фруктов (килограмм)':1,
        '|=Бочка мочёных груш (килограмм)':1 * 2,
        '|=Бочка мочёных груш (литр)':1.2 * 2,
        }

metadict_detail['Вишня мочёная (килограмм)'] = {
        'Вишня (килограмм)':1.3,
        'Рассол для мочения фруктов (килограмм)':1,
        '_-Домашняя консервация фруктов (килограмм)':1,
        '|=Бочка мочёной вишни (килограмм)':1 * 2,
        '|=Бочка мочёной вишни (литр)':1.2 * 2,
        }

metadict_detail['Кабачок консервированный (килограмм)'] = {
        'Кабачок (килограмм)':1.3,
        'Рассол для консервации овощей (килограмм)':1,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированных кабачков (килограмм)':1 * 2,
        '|=Бочка консервированных кабачков (литр)':1.2 * 2,
        }

metadict_detail['Огурцы консервированные (килограмм)'] = {
        'Огурцы (килограмм)':1.2,
        'Рассол для консервации овощей (килограмм)':1,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированных огурцов (килограмм)':1 * 2,
        '|=Бочка консервированных огурцов (литр)':1.2 * 2,
        }

metadict_detail['Томаты консервированные (килограмм)'] = {
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st007.shtml
        'Томаты (килограмм)':1.3,
        'Рассол для консервации овощей (килограмм)':1,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированных томатов (килограмм)':1 * 2,
        '|=Бочка консервированных томатов (литр)':1.2 * 2,
        }

metadict_detail['Свёкла консервированная (килограмм)'] = {
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st003.shtml
        'Свёкла столовая (килограмм)':1.4,
        'Рассол для консервации овощей (килограмм)':1,
        '_-Домашняя консервация овощей (килограмм)':1,
        '|=Бочка консервированной свёклы (килограмм)':1 * 2,
        '|=Бочка консервированной свёклы (литр)':1.2 * 2,
        }

metadict_detail['Капуста квашеная (килограмм)'] = {
        # http://konservirovanie.su/books/item/f00/s00/z0000000/st002.shtml
        'Капуста белокочанная (килограмм)':1.3,
        'Рассол для консервации овощей (килограмм)':1,
        '_-Квашение капусты (килограмм)':1,
        '|=Бочка квашеной капусты (килограмм)':1 * 2,
        '|=Бочка квашеной капусты (литр)':1.2 * 2,
        }

metadict_detail['Овсяная каша (килограмм)'] = {
        'Овсяная крупа (килограмм)':0.25,
        'Вода для готовки (литр)':0.75,
        'Соль пищевая (грамм)':2,
        '_-Варка каши (килограмм)':1,
        }

metadict_detail['Фасолевая каша (килограмм)'] = {
        'Фасоль сухая (килограмм)':0.33,
        'Вода для готовки (литр)':0.66,
        'Соль пищевая (грамм)':2,
        '_-Варка каши (килограмм)':1,
        }

metadict_detail['Кукурузная каша (килограмм)'] = {
        'Кукурузная крупа (килограмм)':0.33,
        'Вода для готовки (литр)':0.66,
        'Соль пищевая (грамм)':2,
        '_-Варка каши (килограмм)':1,
        }

metadict_detail['Арахисовая паста (килограмм)'] = {
        'Арахис (килограмм)':1,
        'Соль пищевая (грамм)':10,
        'Вода для готовки (литр)':0.25,
        '_-Производство арахисовой пасты (килограмм)':1,
        }

metadict_detail['Шоколад горький (килограмм)'] = {
        # http://thermalinfo.ru/svojstva-produktov/kulinariya-i-hleb/svojstva-shokolada-i-kakao
        'Какао-порошок (килограмм)':0.45,
        'Какао-масло (килограмм)':0.23,
        'Сахар (килограмм)':0.32,
        '_-Производство горького шоколада (килограмм)':1,
        }

metadict_detail['Медовые пряники (килограмм)'] = {
        # Исправить
            # Вообще-то это тяжёлое заварное тесто.
            # Аммоний как разрыхлитель используют не зря.
        # http://www.hleb.net/prjanik/350/index-r.html#medovyeprjaniki
        'Мука пшеничная (килограмм)':0.56,
        'Сахар (килограмм)':0.111,
        'Мёд (килограмм)':0.39,
        'Вода для готовки (литр)':0.111,
        'Сода пищевая (грамм)':5.6,
        '_-Выпечка медовых пряников (килограмм)':1,
        }

metadict_detail['Яблочный джем (килограмм)'] = {
        'Яблоко (килограмм)':0.66 * 1.3,
        'Сахар (килограмм)':0.33,
        '_-Варка яблочного джема (килограмм)':1,
        }

metadict_detail['Яблочный джем (рецепт)'] = {
        'Яблоко (100 грамм)':5,
        'Сахар (100 грамм)':5,
        }

metadict_detail['Пшеничный хлеб (килограмм)'] = {
        # Исправить
            # Сделай отдельно домашний и фабричный хлеб.
            # Трудозатраты-то отличаются в 5 раз!
        # Дрожжи у пекарей свои
            # http://www.libussr.ru/doc_ussr/usr_12090.htm
        'Мука пшеничная (килограмм)':1 / 1.3,
        'Соль пищевая (грамм)':1.3,
        'Жидкие дрожжи (грамм)':50,
        'Вода для готовки (литр)':0.25,
        '_-Выпечка хлеба (килограмм)':1,
        }

metadict_detail['Овсяное печенье (килограмм)'] = {
        # http://penzafood.com/izdeliya/ovsyanoe-pechene.html
        'Мука пшеничная (килограмм)':0.294,
        'Мука овсяная (килограмм)':0.126,
        'Сахар (килограмм)':0.371,
        'Соевое масло (килограмм)':0.137,
        'Изюм (килограмм)':0.042,
        'Корица молотая (грамм)':0.7,
        'Ванилин (грамм)':0.5,
        'Сода пищевая (грамм)':2.5,
        'Соль пищевая (грамм)':3.8,
        '_-Выпечка овсяного печенья (килограмм)':1,
        }

metadict_detail['Компот (килограмм)'] = {
        'Сухофрукты (килограмм)':0.1,
        'Сахар (грамм)':100,
        'Вода питьевая (литр)':0.8,
        '_-Варка компота (килограмм)':1,
        }

metadict_detail['Травяной напиток (литр)'] = {
        'Вода питьевая (литр)':1,
        'Травяной сбор (грамм)':20,
        '_-Приготовление чая (литр)':1,
        }

metadict_detail['Чёрный чай (литр)'] = {
        'Вода питьевая (литр)':1,
        'Сушёные чайные листья (грамм)':12,
        '_-Приготовление чая (литр)':1,
        }

metadict_detail['Кофе (литр)'] = {
        'Вода питьевая (литр)':1,
        'Кофе молотый (грамм)':30,
        '_-Приготовление кофе (литр)':1,
        }

metadict_detail['Вино красное сухое (килограмм)'] = {
        # Нормы технологического проектирования винодельческих заводов по переработке винограда:
        # http://www.norm-load.ru/SNiP/Data1/9/9947/index.htm#i831023
        'Виноград (килограмм)':1.4,
        '_-Приготовление вина (килограмм)':1,
        '|=Бочка вина (килограмм)':1,
        '|=Бочка вина (литр)':1.2,
        }

metadict_detail['Яблочный сидр (килограмм)'] = {
        # https://therumdiary.ru/napitki/vina/domashnij-sidr-ot-a-do-yu.html
        'Яблоко (килограмм)':2,
        '_-Приготовление яблочного сидра (килограмм)':1,
        '|=Бочка яблочного сидра (килограмм)':1,
        '|=Бочка яблочного сидра (литр)':1.2,
        }

#----
# Смеси, растворы:

metadict_detail['Сухофрукты (килограмм)'] = {
        'Яблоко сушёное (килограмм)':0.5,
        'Вишня сушёная (килограмм)':0.2,
        'Груша сушёная (килограмм)':0.2,
        'Изюм (килограмм)':0.1,
        }

metadict_detail['Рассол для мочения фруктов (килограмм)'] = {
        # Пони не пьют рассол, так что соль не вся усваивается:
            # http://konservirovanie.su/books/item/f00/s00/z0000000/st010.shtml
        'Сахар (грамм)':20,
        'Горчица сухая (грамм)':2,
        'Солод пшеничный (грамм)':5,
        'Соль пищевая (грамм)':5,
        'Соль для консервации (грамм)':5,
        'Вода для готовки (литр)':1,
        }

metadict_detail['Рассол для консервации овощей (килограмм)'] = {
        # Рассол 4% концентрации, стало быть.
            # http://konservirovanie.su/books/item/f00/s00/z0000000/st002.shtml
        'Горчица сухая (грамм)':5,
        'Соль пищевая (грамм)':20,
        'Соль для консервации (грамм)':20,
        'Вода для готовки (литр)':1,
        }

metadict_detail['Жидкие дрожжи (грамм)'] = {
        'Жидкие дрожжи (килограмм)':1 / 1000,
        }

metadict_detail['Жидкие дрожжи (килограмм)'] = {
        # Из солода
        'Сахар (грамм)':50,
        'Солод пшеничный (грамм)':150,
        'Вода для готовки (литр)':1,
        }

metadict_detail['Специи для имбирных пряников (на килограмм)'] = {
        'Кардамон (грамм)':10,
        'Корица молотая (грамм)':10,
        'Имбирь молотый (грамм)':10,
        'Мускатный орех молотый (грамм)':3,
        }

metadict_detail['Глазурь для медовых пряников (на килограмм)'] = {
        'Сахар (грамм)':100,
        'Вода для готовки (литр)':0.03,
        }

#----
# Специи, консерваторы, добавки:

metadict_detail['Кофе молотый (грамм)'] = {
        'Кофе молотый (килограмм)':1/1000,
        }

metadict_detail['Солод пшеничный (грамм)'] = {
        'Солод пшеничный (килограмм)':1/1000,
        }

metadict_detail['Горчица сухая (грамм)'] = {
        'Горчица сухая (килограмм)':1/1000,
        }

metadict_detail['Корица молотая (грамм)'] = {
        'Корица молотая (килограмм)':1/1000,
        }

metadict_detail['Ванилин (грамм)'] = {
        'Ванилин (килограмм)':1/1000,
        }

metadict_detail['Травяной сбор (грамм)'] = {
        'Травяной сбор (килограмм)':1/1000,
        }

metadict_detail['Сушёные чайные листья (грамм)'] = {
        'Сушёные чайные листья (килограмм)':1/1000,
        }

metadict_detail['Сахар (грамм)'] = {
        'Сахар (килограмм)':1/1000,
        }

metadict_detail['Соль для консервации (грамм)'] = {
        'Соль для консервации (килограмм)':1/1000,
        }

metadict_detail['Соль пищевая (грамм)'] = {
        'Соль пищевая (килограмм)':1/1000,
        }

metadict_detail['Сода пищевая (грамм)'] = {
        'Сода пищевая (килограмм)':1/1000,
        }

#----
# Полуфабрикаты, заменители:

metadict_detail['Подсолнечное масло (килограмм)'] = {
        'Семена подсолнечника (килограмм)':3,
        '_-Производство подсолнечного масла (килограмм)':1,
        '|=Бочка подсолнечного масла (килограмм)':1,
        '|=Бочка подсолнечного масла (литр)':1.2,
        }

metadict_detail['Оливковое масло (килограмм)'] = {
        'Плоды оливы (килограмм)':10,
        '_-Производство оливкового масла (килограмм)':1,
        '|=Бочка оливкового масла (килограмм)':1,
        '|=Бочка оливкового масла (литр)':1.2,
        }

metadict_detail['Льняное масло (килограмм)'] = {
        'Семена льна (килограмм)':4,
        '_-Производство льняного масла (килограмм)':1,
        '|=Бочка льняного масла (килограмм)':1,
        '|=Бочка льняного масла (литр)':1.2,
        }

metadict_detail['Конопляное масло (килограмм)'] = {
        'Семена конопли (килограмм)':4,
        '_-Производство конопляного масла (килограмм)':1,
        '|=Бочка конопляного масла (килограмм)':1,
        '|=Бочка конопляного масла (литр)':1.2,
        }

metadict_detail['Соевое масло (килограмм)'] = {
        'Соевые бобы неочищенные (килограмм)':10,
        '_-Производство соевого масла (килограмм)':1,
        '|=Бочка соевого масла (килограмм)':1,
        '|=Бочка соевого масла (литр)':1.2,
        }

metadict_detail['Арахисовое масло (килограмм)'] = {
        # Исправить
            # На самом деле пони едят арахисовую пасту
            # Эквивалент по содержанию жиров
        'Арахисовая паста (килограмм)':2.2,
        #'_-Производство арахисового масла (килограмм)':1,
        #'|=Бочка арахисового масла (килограмм)':1,
        #'|=Бочка арахисового масла (литр)':1.2,
        }

metadict_detail['Кленовый сироп (килограмм)'] = {
        'Кленовый сок (килограмм)':40,
        '_-Выварка кленового сиропа (килограмм)':1,
        '|=Бочка кленового сиропа (килограмм)':1,
        '|=Бочка кленового сиропа (литр)':1.2,
        }

metadict_detail['Мёд (килограмм)'] = {
        'Мёд в сотах (килограмм)':1,
        '_-Упаковка мёда в бочки (килограмм)':1,
        '|=Бочка мёда (килограмм)':1,
        '|=Бочка мёда (литр)':1.2,
        }

metadict_detail['Какао-порошок (килограмм)'] = {
        # Исправить
            # Из-за этой фигни плантации какао-бобов удваиваются.
            # А что делать? Ввёдм коэффициент 0.5
        'Какао-бобы сухие (килограмм)':4 * 0.5,
        '_-Производство какао-порошка (килограмм)':1,
        '|=Мешок какао-порошка (килограмм)':1,
        '|=Мешок какао-порошка (литр)':1.5,
        }

metadict_detail['Какао-масло (килограмм)'] = {
        'Какао-бобы сухие (килограмм)':4 * 0.5,
        '_-Производство масла какао (килограмм)':1,
        '|=Бочка какао-масла (килограмм)':1,
        '|=Бочка какао-масла (литр)':1.2,
        }

metadict_detail['Сахар (килограмм)'] = {
        # Иногда заменяется мёдом. На самом деле нет.
        'Тростниковый сахар (килограмм)':1,
        }

metadict_detail['Тростниковый сахар (килограмм)'] = {
        'Тростниковый сахар-сырец (килограмм)':1.1,
        '_-Производство рафинированного сахара (килограмм)':1,
        '|=Мешок тростникового сахара (килограмм)':1,
        '|=Мешок тростникового сахара (литр)':1.5,
        }

metadict_detail['Тростниковый сахар-сырец (килограмм)'] = {
        # Примитивный техпроцесс, из 10% сахарозы в стеблях извлекают только 5% сахара.
            # https://carbofood.ru/sugar-technology/saxarnyj-trostnik-texnologiya
        'Сахарный тростник (килограмм)':1/0.05,
        'Известь свежегашёная (килограмм)':0.0035,
        '_-Производство тростникового сахара-сырца (килограмм)':1,
        '|=Корзина тростникового сахара-сырца (килограмм)':1,
        '|=Корзина тростникового сахара-сырца (литр)':1.5,
        }

metadict_detail['Овсяная крупа (килограмм)'] = {
        'Зерно овса (килограмм)':1.3,
        '_-Производство овсяной крупы (килограмм)':1,
        '|=Мешок овсяной крупы (килограмм)':1,
        '|=Мешок овсяной крупы (литр)':1.5,
        }

metadict_detail['Арахис (килограмм)'] = {
        # Массовая доля шелухи: от 15 до 47%
        'Арахисовые бобы неочищенные (килограмм)':1.3,
        '_-Чистка арахиса (килограмм)':1,
        '|=Мешок арахиса (килограмм)':1,
        '|=Мешок арахиса (литр)':1.5,
        }

metadict_detail['Соевые бобы (килограмм)'] = {
        'Соевые бобы неочищенные (килограмм)':1.3,
        '_-Чистка соевых бобов (килограмм)':1,
        '|=Мешок соевых бобов (килограмм)':1,
        '|=Мешок соевых бобов (литр)':1.5,
        }

metadict_detail['Фасоль сухая (килограмм)'] = {
        'Бобы красной фасоли неочищенные (килограмм)':1.3,
        '_-Чистка и сушка фасоли (килограмм)':1,
        '|=Мешок сухой фасоли (килограмм)':1,
        '|=Мешок сухой фасоли (литр)':1.5,
        }

metadict_detail['Какао-бобы сухие (килограмм)'] = {
        # ВЛИЯНИЕ ФЕРМЕНТАЦИИ И СУШКИ НА КАЧЕСТВО КАКАО БОБОВ:
            # http://bibliotekar.ru/5-kakao/4.htm
        # После обработки какао бобы теряют 50% массы, оболочка плодов -- 50% от их массы.
        'Плоды дерева какао (килограмм)':1 / 0.5 / 0.5,
        '_-Ферметизация и сушка какао-бобов (килограмм)':1,
        '|=Мешок какао-бобов (килограмм)':1,
        '|=Мешок какао-бобов (литр)':1.5,
        }

metadict_detail['Кукурузная крупа (килограмм)'] = {
        # Исправить
            # Объединить процессы
        'Початки кукурузы (килограмм)':3,
        '_-Чистка и сушка кукурузы (килограмм)':1,
        '_-Дробление кукурузных зёрен (килограмм)':1,
        '|=Мешок кукурузной крупы (килограмм)':1,
        '|=Мешок кукурузной крупы (литр)':1.5,
        }

metadict_detail['Мука пшеничная (килограмм)'] = {
        # Пшеница при помоле теряет 25% веса.
        'Зерно пшеницы (килограмм)':1.25,
        '_-Помол пшеничной муки (килограмм)':1,
        '|=Мешок пшеничной муки (килограмм)':1,
        '|=Мешок пшеничной муки (литр)':1.5,
        }

metadict_detail['Мука овсяная (килограмм)'] = {
        'Зерно овса (килограмм)':1.25,
        '_-Помол овсяной муки (килограмм)':1,
        '|=Мешок овсяной муки (килограмм)':1,
        '|=Мешок овсяной муки (литр)':1.5,
        }

metadict_detail['Мука соевая (грамм)'] = {
        'Мука соевая (килограмм)':0.001,
        }

metadict_detail['Мука соевая (килограмм)'] = {
        'Соевые бобы (килограмм)':1.25,
        '_-Помол соевой муки (килограмм)':1,
        '|=Мешок соевой муки (килограмм)':1,
        '|=Мешок соевой муки (литр)':1.5,
        }

metadict_detail['Солод пшеничный (килограмм)'] = {
        # Крупноразмолотые проросшие зёрна пшеницы.
        'Зерно пшеницы (килограмм)':1.25,
        '_-Производство пшеничного солода (килограмм)':1,
        '|=Мешок пшеничного солода (килограмм)':1,
        '|=Мешок пшеничного солода (литр)':1.5,
        }

metadict_detail['Яблоко сушёное (килограмм)'] = {
        # Настольная книга садовода 7.14. Сушка:
        # http://www.citrus.abc64.ru/bookgardene714.htm
        'Яблоко (килограмм)':9,
        '_-Сушка яблок (килограмм)':1,
        '|=Мешок сушёных яблок (килограмм)':1,
        '|=Мешок сушёных яблок (литр)':2.5,
        }

metadict_detail['Груша сушёная (килограмм)'] = {
        'Груша (килограмм)':7.5,
        '_-Сушка груши (килограмм)':1,
        '|=Мешок сушёной груши (килограмм)':1,
        '|=Мешок сушёной груши (литр)':2.5,
        }

metadict_detail['Вишня сушёная (килограмм)'] = {
        'Вишня (килограмм)':6,
        '_-Сушка вишни (килограмм)':1,
        '|=Мешок сушёной вишни (килограмм)':1,
        '|=Мешок сушёной вишни (литр)':2.5,
        }

metadict_detail['Изюм (килограмм)'] = {
        'Виноград (килограмм)':5,
        '_-Сушка винограда (килограмм)':1,
        '|=Мешок изюма (килограмм)':1,
        '|=Мешок изюма (литр)':1.5,
        }

metadict_detail['Кофе молотый (килограмм)'] = {
        'Кофейные зёрна (килограмм)':1,
        '_-Помол кофе (килограмм)':1,
        #'|=Мешок молотого кофе (килограмм)':1,
        #'|=Мешок молотого кофе (литр)':2,
        }

metadict_detail['Горчица сухая (килограмм)'] = {
        'Семена горчицы белой (килограмм)':4,
        '_-Помол семян горчицы (килограмм)':1,
        '|=Мешок сухой горчицы (килограмм)':1,
        '|=Мешок сухой горчицы (литр)':1.5,
        }

metadict_detail['Травяной сбор (килограмм)'] = {
        # Исправить
            # Перенести в смеси, разделить на фракции.
            # Сушёные коренья одуванчиков, цветы ромашки, фенхель.
        'Дикорастущие растения (килограмм)':4,
        '_-Сушка дикорастущих растений (килограмм)':1,
        '|=Мешок сушёных трав (килограмм)':1,
        '|=Мешок сушёных трав (литр)':2.5,
        }

metadict_detail['Сушёные чайные листья (килограмм)'] = {
        'Чайные листья (килограмм)':4,
        '_-Сушка чайных листьев (килограмм)':1,
        '|=Мешок сушёных чайных листьев (килограмм)':1,
        '|=Мешок сушёных чайных листьев (литр)':2.5,
        }

#----
# Вода (группировка)

metadict_detail['Вода для строительства (кубометр)'] = {
        'Вода для строительства (литр)':1000,
        }

metadict_detail['Вода для мытья овощей (литр)'] = {
        'Хозяйственная вода (литр)':1,
        }

metadict_detail['Вода для мытья фруктов (литр)'] = {
        'Хозяйственная вода (литр)':1,
        }

metadict_detail['Вода для мытья сухофруктов (литр)'] = {
        'Хозяйственная вода (литр)':1,
        }

metadict_detail['Вода для мытья посуды (литр)'] = {
        'Хозяйственная вода (литр)':1,
        }

metadict_detail['Вода для готовки (литр)'] = {
        'Питьевая вода (литр)':1,
        }

metadict_detail['Вода питьевая (литр)'] = {
        'Питьевая вода (литр)':1,
        }

#----
# Вода (упрощение)

metadict_detail['Питьевая вода (литр)'] = {
        # Исправить
            # Допиливай водоснабжение.
            # Водопроводы, колонки, колодцы
        #'Водоснабжение (литр)':1,
        '|=Ведро питьевой воды (килограмм)':1,
        '|=Ведро питьевой воды (литр)':1.2,
        }

metadict_detail['Хозяйственная вода (литр)'] = {
        #'Водоснабжение (литр)':1,
        '|=Бочка хозяйственной воды (килограмм)':1,
        '|=Бочка хозяйственной воды (литр)':1.2,
        }

metadict_detail['Вода для строительства (литр)'] = {
        # Исправить
            # Воду для строительства отдельно от промышленной
        #'Водоснабжение (литр)':1,
        '|=Бочка промышленной воды (килограмм)':1,
        '|=Бочка промышленной воды (литр)':1.2,
        }

#----
# Соль (группировка)

metadict_detail['Соль для консервации (килограмм)'] = {
        'Соль (килограмм)':1,
        }

metadict_detail['Соль пищевая (килограмм)'] = {
        'Соль (килограмм)':1,
        }

metadict_detail['Соль (килограмм)'] = {
        'Производство пищевой соли (килограмм)':1,
        '|=Мешок соли (килограмм)':1,
        '|=Мешок соли (литр)':1.5,
        }

#----
# Коррекция величин (центнеры):

metadict_detail['Семена горчицы белой (килограмм)'] = {
        'Выращивание Семена горчицы белой (центнер)':1/100,
        '|=Корзина семян горчицы белой (килограмм)':1,
        '|=Корзина семян горчицы белой (литр)':1.5,
        }

metadict_detail['Семена льна (килограмм)'] = {
        'Выращивание Семена льна (центнер)':1/100,
        '|=Корзина семян льна (килограмм)':1,
        '|=Корзина семян льна (литр)':1.5,
        }

metadict_detail['Семена конопли (килограмм)'] = {
        'Выращивание Семена конопли (центнер)':1/100,
        '|=Корзина семян конопли (килограмм)':1,
        '|=Корзина семян конопли (литр)':1.5,
        }

metadict_detail['Семена подсолнечника (килограмм)'] = {
        'Выращивание Семена подсолнечника (центнер)':1/100,
        '|=Корзина семян подсолнечника (килограмм)':1,
        '|=Корзина семян подсолнечника (литр)':1.5,
        }

metadict_detail['Плоды оливы (килограмм)'] = {
        'Выращивание Плоды оливы (центнер)':1/100,
        '|=Корзина плодов оливы (килограмм)':1,
        '|=Корзина плодов оливы (литр)':1.5,
        }

metadict_detail['Бобы красной фасоли неочищенные (килограмм)'] = {
        'Выращивание Бобы красной фасоли неочищенные (центнер)':1/100,
        '|=Корзина красной фасоли в стручках (килограмм)':1,
        '|=Корзина красной фасоли в стручках (литр)':2.5,
        }

metadict_detail['Початки кукурузы (килограмм)'] = {
        'Выращивание Початки кукурузы (центнер)':1/100,
        '|=Корзина початков кукурузы (килограмм)':1,
        '|=Корзина початков кукурузы (литр)':2.5,
        }

metadict_detail['Соевые бобы неочищенные (килограмм)'] = {
        'Выращивание Соевые бобы неочищенные (центнер)':1/100,
        '|=Корзина соевых бобов в стручках (килограмм)':1,
        '|=Корзина соевых бобов в стручках (литр)':2.5,
        }

metadict_detail['Арахисовые бобы неочищенные (килограмм)'] = {
        'Выращивание Арахисовые бобы неочищенные (центнер)':1/100,
        '|=Корзина арахиса в шелухе (килограмм)':1,
        '|=Корзина арахиса в шелухе (литр)':1.5,
        }

metadict_detail['Виноград (килограмм)'] = {
        'Выращивание Виноград (центнер)':1/100,
        '|=Корзина винограда (килограмм)':1,
        '|=Корзина винограда (литр)':2.5,
        }

metadict_detail['Яблоко (килограмм)'] = {
        'Выращивание Яблоко (центнер)':1/100,
        '|=Корзина яблок (килограмм)':1,
        '|=Корзина яблок (литр)':2.5,
        }

metadict_detail['Груша (килограмм)'] = {
        'Выращивание Груша (центнер)':1/100,
        '|=Корзина груш (килограмм)':1,
        '|=Корзина груш (литр)':2.5,
        }

metadict_detail['Вишня (килограмм)'] = {
        'Выращивание Вишня (центнер)':1/100,
        '|=Корзина вишни (килограмм)':1,
        '|=Корзина вишни (литр)':2.5,
        }

metadict_detail['Зерно пшеницы (килограмм)'] = {
        # Исправить
            # Хау, учти побочные продукты, ту же солому.
        'Выращивание Зерно пшеницы (центнер)':1/100,
        '|=Корзина зерна пшеницы (килограмм)':1,
        '|=Корзина зерна пшеницы (литр)':1.5,
        }

metadict_detail['Зерно овса (килограмм)'] = {
        'Выращивание Зерно овса (центнер)':1/100,
        '|=Корзина зерна овса (килограмм)':1,
        '|=Корзина зерна овса (литр)':1.5,
        }

metadict_detail['Сахарный тростник (килограмм)'] = {
        'Выращивание Сахарный тростник (центнер)':1/100,
        '|=Связка сахарного тростника (килограмм)':1,
        '|=Связка сахарного тростника (литр)':5,
        }

metadict_detail['Чайные листья (килограмм)'] = {
        'Выращивание Чайные листья (центнер)':1/100,
        '|=Корзина чайных листьев (килограмм)':1,
        '|=Корзина чайных листьев (литр)':5,
        }

metadict_detail['Плоды дерева какао (килограмм)'] = {
        'Выращивание плодов дерева какао (центнер)':1/100,
        '|=Корзина плодов какао (килограмм)':1,
        '|=Корзина плодов какао (литр)':2.5,
        }

metadict_detail['Кофейные зёрна (килограмм)'] = {
        # Исправить
            # На этом уровне должны быть плоды кофейного дерева
        'Выращивание Кофейные зёрна (центнер)':1/100,
        '|=Корзина кофейных зёрен (килограмм)':1,
        '|=Корзина кофейных зёрен (литр)':2.5,
        }

metadict_detail['Дикорастущие растения (килограмм)'] = {
        'Выращивание Дикорастущие растения (центнер)':1/100,
        '|=Корзина дикорастущих растений (килограмм)':1,
        '|=Корзина дикорастущих растений (литр)':5,
        }

metadict_detail['Батат (килограмм)'] = {
        'Выращивание Батат (центнер)':1/100,
        '|=Корзина батата (килограмм)':1,
        '|=Корзина батата (литр)':2.5,
        }

metadict_detail['Картофель (килограмм)'] = {
        'Выращивание Картофель (центнер)':1/100,
        '|=Корзина картофеля (килограмм)':1,
        '|=Корзина картофеля (литр)':2.5,
        }

metadict_detail['Тыква (килограмм)'] = {
        'Выращивание Тыква (центнер)':1/100,
        '|=Корзина тыквы (килограмм)':1,
        '|=Корзина тыквы (литр)':2.5,
        }

metadict_detail['Томаты (килограмм)'] = {
        'Выращивание Томаты (центнер)':1/100,
        '|=Корзина томатов (килограмм)':1,
        '|=Корзина томатов (литр)':2.5,
        }

metadict_detail['Кабачок (килограмм)'] = {
        'Выращивание Кабачок (центнер)':1/100,
        '|=Корзина кабачка (килограмм)':1,
        '|=Корзина кабачка (литр)':2.5,
        }

metadict_detail['Огурцы (килограмм)'] = {
        'Выращивание Огурцы (центнер)':1/100,
        '|=Корзина огурцов (килограмм)':1,
        '|=Корзина огурцов (литр)':2.5,
        }

metadict_detail['Морковь (килограмм)'] = {
        'Выращивание Морковь (центнер)':1/100,
        '|=Корзина моркови (килограмм)':1,
        '|=Корзина моркови (литр)':2.5,
        }

metadict_detail['Капуста белокочанная (килограмм)'] = {
        'Выращивание Капуста белокочанная (центнер)':1/100,
        '|=Корзина капусты белокочанной (килограмм)':1,
        '|=Корзина капусты белокочанной (литр)':2.5,
        }

metadict_detail['Лук репчатый (килограмм)'] = {
        'Выращивание Лук репчатый (центнер)':1/100,
        '|=Корзина лука репчатого (килограмм)':1,
        '|=Корзина лука репчатого (литр)':2.5,
        }

metadict_detail['Репа (килограмм)'] = {
        'Выращивание Репа (центнер)':1/100,
        '|=Корзина репы (килограмм)':1,
        '|=Корзина репы (литр)':1.5,
        }

metadict_detail['Перец сладкий (килограмм)'] = {
        'Выращивание Перец сладкий (центнер)':1/100,
        '|=Корзина перца сладкого (килограмм)':1,
        '|=Корзина перца сладкого (литр)':2.5,
        }

metadict_detail['Свёкла столовая (килограмм)'] = {
        'Выращивание Свёкла столовая (центнер)':1/100,
        '|=Корзина сахарной свёклы (килограмм)':1,
        '|=Корзина сахарной свёклы (литр)':2.5,
        }

metadict_detail['Кленовый сок (килограмм)'] = {
        # Исправить
            # Объединить процессы.
        'Кленовый сок (центнер)':1/100,
        'Сбор кленового сока (килограмм)':1,
        '|=Ведро кленового сока (килограмм)':1,
        '|=Ведро кленового сока (литр)':1.2,
        }

metadict_detail['Мёд в сотах (килограмм)'] = {
        # Исправить
            # Пони не варвары, они не бортничают, а аккуратно собирают мёд.
        # С одной семьи -- 25 килограмм мёда; 0.5 килограмма воска.
        'Выращивание Мёд в сотах (центнер)':1/100,
        #'Воск (килограмм)':1/50,
        #'|=Ведро мёда в сотах (килограмм)':1,
        #'|=Ведро мёда в сотах (литр)':1.2,
        }

#----
# Коррекция величин (тонны)

metadict_detail['Кирпич (кубометр)'] = {
        'Полевое производство кирпича (кубометр)':1,
        '|=Кирпич (тонн)':1.6,
        '|=Кирпич в штабелях (кубометр)':0.7,
        }

metadict_detail['Пиломатериалы (кубометр)'] = {
        # Исправить
            # Уточнить насыпную плотность при погрузке.
            # Отдельно должны быть высушенные пиломатериалы.
        'Полевое производство пиломатериалов (кубометр)':1,
        '|=Пиломатериалы свежие (тонн)':1,
        '|=Пиломатериалы свежие в штабелях (кубометр)':1.2,
        }

metadict_detail['Глина (кубометр)'] = {
        'Полевое производство глины (кубометр)':1,
        '|=Глина (тонн)':1.6,
        '|=Глина навалом (кубометр)':0.6,
        }

metadict_detail['Цемент (кубометр)'] = {
        'Производство цемента (кубометр)':1,
        '|=Мешок цемента М400 (килограмм)':1300,
        '|=Мешок цемента М400 (литр)':1000,
        }

metadict_detail['Песок (кубометр)'] = {
        'Добыча песка (кубометр)':1,
        '|=Песок (тонн)':1.4,
        '|=Песок навалом (кубометр)':1,
        }

metadict_detail['Щебень (кубометр)'] = {
        'Добыча щебня (кубометр)':1,
        '|=Щебень (тонн)':1.4,
        '|=Щебень навалом (кубометр)':1,
        }

metadict_detail['Вывоз грунта (кубометр)'] = {
        # Исправить
            # Массу кубометра грунта подправь
        '|=Грунт (тонн)':2,
        '|=Грунт (кубометр)':1,
        }

metadict_detail['Известь свежегашёная (килограмм)'] = {
        'Известь негашёная (тонн)':1/1000,
        }

metadict_detail['Известь негашёная (килограмм)'] = {
        'Известь негашёная (тонн)':1/1000,
        }

metadict_detail['Известь негашёная (тонн)'] = {
        # Исправить
            # Плоность уточни
        'Известь негашёная (кубометр)':0.835,
        }

metadict_detail['Известь негашёная (кубометр)'] = {
        'Производство извести негашёной (тонн)':1.2,
        '|=Мешок извести негашёной (килограмм)':1200,
        '|=Мешок извести негашёной (литр)':1000,
        }

metadict_detail['Стекло (кубометр)'] = {
        # Исправить
            # Уточнить складскую плотность стекла.
        '|=Стекло (тонн)':2.6,
        '|=Стекло в упаковке (кубометр)':2,
        }

metadict_detail['Опилки древесные (кубометр)'] = {
        # Мокрая древесина дуба, насыпная плотность.
            # http://tehnopost.kiev.ua/drova/17-tablitsa-plotnosti-schepyi.html
        '|=Опилки древесные (тонн)':0.3,
        '|=Опилки древесные навалом (кубометр)':1,
        }

metadict_detail['Сухая солома (кубометр)'] = {
        # Думаю, сухая солома у понек есть всегда.
        '|=Сухая солома (тонн)':0.1,
        '|=Сухая солома навалом (кубометр)':1,
        }

metadict_detail['Дрова (килограмм)'] = {
        'Дрова (тонн)':0.001,
        }

metadict_detail['Дрова (тонн)'] = {
        # Свежие, с большой влажностью.
        'Дрова (кубометр)':1,
        }

metadict_detail['Круглый лес (кубометр)'] = {
        'Валка среднего леса (кубометр)':1,
        '|=Круглый лес (тонн)':1,
        '|=Круглый лес (кубометр)':1.5,
        }

metadict_detail['Дрова (кубометр)'] = {
        # Исправить
            # Часть дров пони получают за счёт отходов производства.
            # А другую часть требуется расколоть, прежде чем использовать.
        # Это насыпная плотность дров!
        # https://naruservice.com/articles/udelnyj-ves-drov
        'Валка среднего леса (кубометр)':1,
        '_-Колка дров (кубометр)':1,
        '|=Дрова (тонн)':1,
        '|=Дрова навалом (кубометр)':1.5,
        }

metadict_detail['Дёготь (килограмм)'] = {
        'Производство дёгтя (литр)':1,
        '|=Бочка дёгтя (килограмм)':1,
        '|=Бочка дёгтя (литр)':1.2,
        }

metadict_detail['Смоляк (кубометр)'] = {
        # Сосновые пни после 20-летней выдержки.
        'Корчёвка смоляка (кубометр)':1,
        '|=Смоляк (тонн)':1,
        '|=Смоляк навалом (кубометр)':1.5,
        }
