metadict_army['Пехотная рота'] = {
        'Пехотный взвод':3,
        }

metadict_army['Пехотный взвод'] = {
        'Командир пехотного взвода':1,
        'Отделение лёгкой пехоты':3,
        }

metadict_army['Отделение лёгкой пехоты'] = {
        'Командир отделения лёгкой пехоты':1,
        'Огневая команда':1,
        'Маневровая команда':1,
        }

metadict_army['Огневая команда'] = {
        'Боец (гранатомётчик)':1,
        'Боец (помощник гранатомётчика)':1,
        'Боец (пулемётчик)':1,
        'Боец (помощник пулемётчика)':1,
        }

metadict_army['Маневровая команда'] = {
        'Боец (старший стрелок)':1,
        'Боец (гренадер)':2,
        }
